{"symbol": "MSFT", "publishedDate": "2025-07-30 03:50:00", "publisher": "The Motley Fool", "title": "2 Stocks That Turned $1,000 Into $2 Million", "image": "https://images.financialmodelingprep.com/news/2-stocks-that-turned-1000-into-2-million-20250730.jpg", "site": "fool.com", "text": "The S&P 500 index, arguably the most consistent and proven long-term wealth-building investment mechanism in modern history, averaged a return of 8% per year from 1928 through 2024, which included some big up years and some big down years. If you could get an 8% return every year, you could turn $1,000 into $1 million in about 90 years.", "url": "https://www.fool.com/investing/2025/07/30/2-stocks-that-turned-1000-into-2-million/", "publishedDateET": "2025-07-29T23:50:00-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-30 02:49:39", "publisher": "Reuters", "title": "Microsoft restores services to Russia-backed Nayara Energy", "image": "https://images.financialmodelingprep.com/news/microsoft-restores-services-to-russiabacked-nayara-energy-20250730.jpg", "site": "reuters.com", "text": "Microsoft has restored services to Russia-backed refiner Nayara Energy, the Indian company's lawyer told a New Delhi court, days after the U.S. tech giant terminated services due to European Union sanctions.", "url": "https://www.reuters.com/business/energy/microsoft-restores-services-russia-backed-nayara-energy-2025-07-30/", "publishedDateET": "2025-07-29T22:49:39-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 19:31:02", "publisher": "Reuters", "title": "US Fermilab hit in cyberattack targeting Microsoft's SharePoint, Bloomberg News reports", "image": "https://images.financialmodelingprep.com/news/us-fermilab-hit-in-cyberattack-targeting-microsofts-sharepoint-bloomberg-20250729.jpg", "site": "reuters.com", "text": "U.S. Fermi National Accelerator Laboratory, one of the Department of Energy's 17 national labs, was attacked by hackers as part of a recent campaign seeking to exploit flaws in Microsoft's SharePoint software, Bloomberg News reported on Tuesday, citing a spokesperson from the department.", "url": "https://www.reuters.com/technology/us-fermilab-hit-cyberattack-targeting-microsofts-sharepoint-bloomberg-news-2025-07-29/", "publishedDateET": "2025-07-29T15:31:02-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 15:23:42", "publisher": "Reuters", "title": "Microsoft to be hit with Opera complaint to Brazilian antitrust regulator", "image": "https://images.financialmodelingprep.com/news/microsoft-to-be-hit-with-opera-complaint-to-brazilian-20250729.jpg", "site": "reuters.com", "text": "Norwegian browser maker Opera will file a complaint about U.S. tech giant Microsoft to Brazilian antitrust authority CADE on Tuesday for allegedly giving its Edge browser an unfair advantage over rivals.", "url": "https://www.reuters.com/legal/litigation/microsoft-be-hit-with-opera-complaint-brazilian-antitrust-regulator-2025-07-29/", "publishedDateET": "2025-07-29T11:23:42-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 14:02:43", "publisher": "Bloomberg Technology", "title": "What Access to Future OpenAI Models Means For Microsoft", "image": "https://images.financialmodelingprep.com/news/what-access-to-future-openai-models-means-for-microsoft-20250729.jpg", "site": "youtube.com", "text": "Extending the partnership with OpenAI will allow Microsoft to keep improving its AI offerings, says Goldman Sachs Global Investment Research Managing Director Kash Rangan. He reacts to news of possible changes to the companies' partnership with Caroline Hyde and Ed Ludlow on “Bloomberg Tech.", "url": "https://www.youtube.com/watch?v=uKjbjhaiX2c", "publishedDateET": "2025-07-29T10:02:43-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 13:58:57", "publisher": "Bloomberg Technology", "title": "Microsoft, OpenAI in Talks to Change Partnership", "image": "https://images.financialmodelingprep.com/news/microsoft-openai-in-talks-to-change-partnership-20250729.jpg", "site": "youtube.com", "text": "Microsoft and OpenAI are in advanced contract talks that would give Microsoft access to future tech developed by the ChatGPT maker. Bloomberg's Matt Day discusses the details with Caroline Hyde and Ed Ludlow on “Bloomberg Tech.", "url": "https://www.youtube.com/watch?v=l_F7yTCg2iE", "publishedDateET": "2025-07-29T09:58:57-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 13:04:10", "publisher": "Benzinga", "title": "Microsoft Q4 Preview: Can The Tech Giant Beat Forecasts For 10th Straight Quarter?", "image": "https://images.financialmodelingprep.com/news/microsoft-q4-preview-can-the-tech-giant-beat-forecasts-20250729.jpg", "site": "benzinga.com", "text": "Microsoft Corporation MSFT is expected to highlight growth from AI and cloud services when the technology giant reports its fourth-quarter financial results on Wednesday after the market close.", "url": "https://www.benzinga.com/trading-ideas/previews/25/07/46698434/microsoft-q4-preview-can-the-tech-giant-beat-forecasts-for-10th-straight-quarter", "publishedDateET": "2025-07-29T09:04:10-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 12:17:13", "publisher": "Zacks Investment Research", "title": "Will Cloud Results Boost Microsoft Earnings?", "image": "https://images.financialmodelingprep.com/news/will-cloud-results-boost-microsoft-earnings-20250729.jpg", "site": "zacks.com", "text": "The 2025 Q2 earnings season picks up considerable steam this week, with a wide variety of S&P 500 companies reporting results. Headlining the docket are several Mag 7 members, a list that includes Microsoft MSFT.", "url": "https://www.zacks.com/commentary/2630442/will-cloud-results-boost-microsoft-earnings?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2630442", "publishedDateET": "2025-07-29T08:17:13-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 11:39:24", "publisher": "247 Wallst", "title": "Nasdaq Composite Live: Market Gains Momentum on US-EU Trade Deal", "image": "https://images.financialmodelingprep.com/news/nasdaq-composite-live-market-gains-momentum-on-useu-trade-deal-20250729.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Has Ended Shares of AMD are Exploding Higher 10:21 am Ahead of earnings, AMD is rocketing higher thanks to reports of a price increase for its Instinct MI350 AI chips. Reports claim AMD will raise the price of these GPUs to $25,000 per unit, according to TipRanks.com. Nasdaq Heading to Higher Highs 9:54 am The Nasdaq is up about 70 points at the open, last trading at 21,177.76. Adding to the upside, AMZN is up about $1.43 a share ahead of earnings. NVDA is gaining momentum, up about $1.45. AMD is also up big, gaining about $7.20, last trading at $173.63. Stock futures are mixed, but the Nasdaq is expected to open higher. Fueling upside, President Trump announced that the U.S. reached an agreement with the European Union to lower tariffs to 15%. Magnificent 7 stocks, including Meta Platforms, Microsoft, Amazon, and Apple, are all set to post earnings this week. Investors will be listening for comments on strengthening artificial intelligence spending to gauge the justifiability of tech stock valuations. Helping, “While expectations were low coming into this season, results so far show corporate America is faring better than expected. Of the more than 30% of the S&amp;P 500 done reporting, more than 82% beat Wall Street’s forecasts,” added CNBC. Later this week, the Federal Reserve will hold its two-day meeting. The central bank is widely expected to leave interest rates as is. However, investors will be looking for an indication of a potential rate cut by September. Defense Stocks are Rallying on the US-EU Trade Deal Defense stocks are also gaining momentum after the US-EU trade deal. As part of that deal, President Trump said the EU would be “purchasing hundreds of billions of dollars’ worth of military equipment,” as quoted by CNBC. In addition, as announced shortly after the agreement, Europe will also purchase about $750 billion worth of energy. &#8220;They are going to agree to invest into the United States $600 billion more than they&#8217;re investing already. So, they&#8217;re investing a large amount of money,” added President Trump, as quoted by The Mirror. Analysts Just Reiterated an Overweight Rating on Amazon Morgan Stanley just reiterated its overweight rating on Amazon.com, noting that it’s a beneficiary of the Big Beautiful bill passed by Congress. The firm believes AMZN could capture at least $15 billion a year in tax benefits. Wells Fargo just initiated an overweight rating on Take Two Interactive (TTWO), noting that it’s bullish on the 2026 release of its latest Grand Theft Auto game. The firm anticipates that GTA 6 will sell 50 million units in fiscal year 2027. Bank of America analysts just reiterated a buy rating on Apple ahead of its earnings this week. Deutsche Bank also reiterated a buy rating on Tesla, noting that “patience” is needed with Tesla’s robotaxi, but it’s sticking with the stock. And analysts at Stifel just reiterated a buy rating on Microsoft, and raised its price target on the tech giant to $550 from $500 ahead of earnings. Analysts at Evercore ISI downgraded Cisco mainly on valuation concerns to an in-line rating. “We are downgrading Cisco to In Line as the stock is within 6% of our price target of $72. The stock has performed well recently with a +46% move over the last twelve months vs. +17% for the S&amp;P,” as quoted by CNBC. The post Nasdaq Composite Live: Market Gains Momentum on US-EU Trade Deal appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/28/nasdaq-composite-live-market-gains-momentum-on-us-eu-trade-deal/", "publishedDateET": "2025-07-29T07:39:24-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 11:39:24", "publisher": "247 Wallst", "title": "Nasdaq Composite Live: Index to Hit New Highs Today", "image": "https://images.financialmodelingprep.com/news/nasdaq-composite-live-index-to-hit-new-highs-today-20250729.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Updates appear automatically as they are published. Markets Will Continue to Rally Until Nvidia Earnings 9:39 am The Nasdaq just opened 106 points higher at 21,285.34. From here, depending on the strength of Magnificent 7 stock earnings, trade deals, and the Federal Reserve, we could see the index closer to 22,000 later this week. Helping, JPMorgan says the market will continue to run until Nvidia reports earnings in late August. “We continue to find evidence for our bullish hypothesis: (i) resilient macro data; (ii) positive earnings growth; (iii) thawing trade war rhetoric,” JPMorgan said, as quoted by CNBC. “This week we are focused on [July nonfarm payrolls] and MegaCap Tech earnings.” We’re also waiting on earnings from Meta, Microsoft, Amazon, and Apple this week. Nasdaq could easily see higher highs 9:13 am With excitement over a trade deal with the US-EU, and hopefully with China, the Nasdaq could see higher highs. Helping, we&#8217;ll soon see major earnings from some of the top Magnificent 7 stocks, and hopeful hints of a potential interest rate cut by September&#8217;s Fed meeting. Stay tuned for more. Nasdaq futures are up about 108 points to 23,599 at the moment. If it can open at that level, that’ll put the tech-heavy index at new all-time highs. According to CNBC, “The moves come after the broad market index and the Nasdaq hit new all-time and closing highs during Monday’s trading session, just barely seeing gains. It was the 15th record close for the broad market index in 2025.” Fueling momentum, tech giants like Advanced Micro Devices (AMD) soared by about $7.19 a share yesterday. Shares are up another $2.80 in premarket trading today. Helping, analysts at Bank of America just raised their price target on AMD to $200. The stock is also rising on news of a price increase for its Instinct MI350 chips. In addition, there’s been excitement over the recent US-EU trade deal. Now, markets are waiting to see if a deal can be made with China. That&#8217;s ahead of President Trump’s August 1 deadline. Plus, all eyes will be on the Federal Reserve, which is expected to leave interest rates as is. However, they’ll be listening to hints about a potential rate cut by September’s meeting. Friday will also be an important day, with the release of non-farm payroll numbers. Goldman Sachs Reiterated a Buy Rating on Microsoft Goldman Sachs says it’s bullish on Microsoft heading into earnings. “Microsoft is well-positioned to capitalize on this shift with a more capital-efficient and higher-margin recurring revenue model, just as it did during the on-prem to cloud transition,” as noted by CNBC. Analysts at Oppenheimer just reiterated a Perform rating on Apple ahead of earnings, noting, “We take a neutral view into AAPL’s F3Q25 earnings. We expect investors to focus on the revenue outlook for F4Q25 after normalizing the potential FX tailwind, Services revenue growth, and the sales trend in Greater China.” Citi analysts reiterated a buy rating on Coinbase, with a price target of $505 from $270. The firm noted the company has seen several catalysts recently. That includes the GENIUS Act, the House passage of the CLARITY Act, and its addition to the S&amp;P 500 index. Bank of America also reiterated a buy rating on Roblox, with a price target of $133. The firm sees an “extended runway for mid-20% growth as users worldwide adopt Roblox’s Metaverse, in a virtuous cycle that will draw developers, brands, and merchants to the platform,” as also quoted by CNBC. The post Nasdaq Composite Live: Index to Hit New Highs Today appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/29/nasdaq-composite-live-index-to-hit-new-highs-today/", "publishedDateET": "2025-07-29T07:39:24-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 11:07:48", "publisher": "Seeking Alpha", "title": "Microsoft: Why I Think It Is Poised To Beat Wall St's Margin Estimates", "image": "https://images.financialmodelingprep.com/news/microsoft-why-i-think-it-is-poised-to-beat-20250729.jpg", "site": "seekingalpha.com", "text": "Management and industry commentary is very gung-ho on Copilot adoption. I recognize this key growth driver but also have 1 cause for concern. I believe Wall St analysts are grossly underestimating the margin expansion benefits that could arise from Microsoft's job cuts. MSFT's valuations remains reasonable near sector medians and it is good to see it being supported by robust earnings growth.", "url": "https://seekingalpha.com/article/4805498-microsoft-why-i-think-it-is-poised-to-beat-wall-sts-margin-estimates", "publishedDateET": "2025-07-29T07:07:48-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 11:02:53", "publisher": "24/7 Wall Street", "title": "Nvidia Hits $4.3 Trillion: The AI Boom's Unstoppable Force?", "image": "https://images.financialmodelingprep.com/news/nvidia-hits-43-trillion-the-ai-booms-unstoppable-force-20250729.jpg", "site": "247wallst.com", "text": "In a historic milestone, Nvidia ( NASDAQ:NVDA ) has become the first company to reach a staggering $4.3 trillion market valuation, eclipsing the second-largest company, Microsoft ( NASDAQ:MSFT ), by $500 billion — a gap so large it is equivalent to the market caps of Starbucks ( NASDAQ:SBUX ), Nike ( NYSE:NKE ), and AT&T ( NYSE:T ) combined, with $80 billion to spare.", "url": "https://247wallst.com/investing/2025/07/29/nvidia-hits-4-3-trillion-the-ai-booms-unstoppable-force/", "publishedDateET": "2025-07-29T07:02:53-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 11:01:49", "publisher": "Zacks Investment Research", "title": "Single-Stock ETFs in Focus as Big Tech Earnings Unfold", "image": "https://images.financialmodelingprep.com/news/singlestock-etfs-in-focus-as-big-tech-earnings-unfold-20250729.jpg", "site": "zacks.com", "text": "With Big Tech earnings coming up, single-stock ETFs like MSFX, FBL, AAPX and AMZU draw fresh investor focus.", "url": "https://www.zacks.com/stock/news/2633724/single-stock-etfs-in-focus-as-big-tech-earnings-unfold?cid=CS-STOCKNEWSAPI-FT-etf_news_and_commentary-2633724", "publishedDateET": "2025-07-29T07:01:49-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 10:44:10", "publisher": "TechCrunch", "title": "Microsoft in talks to maintain access to OpenAI's tech beyond AGI milestone", "image": "https://images.financialmodelingprep.com/news/microsoft-in-talks-to-maintain-access-to-openais-tech-20250729.jpg", "site": "techcrunch.com", "text": "Microsoft is reportedly in advanced talks with OpenAI for a new agreement that would give it ongoing access to the startup's technology even if OpenAI achieves what it defines as AGI, or advanced general intelligence. If the deal goes through, it would clear a key hurdle in OpenAI's transition toward becoming a fully commercial enterprise.", "url": "https://techcrunch.com/2025/07/29/microsoft-in-talks-to-maintain-access-to-openais-tech-beyond-agi-milestone/", "publishedDateET": "2025-07-29T06:44:10-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 10:31:12", "publisher": "PYMNTS", "title": "Microsoft Seeks to Extend Access to OpenAI Technology", "image": "https://images.financialmodelingprep.com/news/microsoft-seeks-to-extend-access-to-openai-technology-20250729.jpg", "site": "pymnts.com", "text": "Microsoft and OpenAI are reportedly in advanced talks on a deal that would give Microsoft continued access to OpenAI's technology after that company achieves artificial general intelligence (AGI).", "url": "https://www.pymnts.com/news/artificial-intelligence/2025/microsoft-seeks-extend-access-openai-technology/", "publishedDateET": "2025-07-29T06:31:12-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 10:29:28", "publisher": "Seeking Alpha", "title": "Microsoft Q4 FY 2025 Earnings Preview: Buy Now Or Wait?", "image": "https://images.financialmodelingprep.com/news/microsoft-q4-fy-2025-earnings-preview-buy-now-or-20250729.jpg", "site": "seekingalpha.com", "text": "Microsoft Corporation stock has surged towards new all-time highs since our last coverage, underscoring investors' confidence in the company's AI strategy, alongside its favorable positioning as a potential tariff haven. However, MSFT stock's ballooning valuation premium may be decoupling from the underlying business' fundamental prospects. In addition to uncertain business implications from the upcoming tariffs, Microsoft also faces a growing range of company-specific challenges that remains underappreciated at its current valuation.", "url": "https://seekingalpha.com/article/4805467-microsoft-q4-fy-2025-earnings-preview-buy-now-or-wait", "publishedDateET": "2025-07-29T06:29:28-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 09:00:00", "publisher": "Business Wire", "title": "Toolio Joins Microsoft for Startups Pegasus Program to Accelerate AI-Powered Retail Planning Innovation", "image": "https://images.financialmodelingprep.com/news/toolio-joins-microsoft-for-startups-pegasus-program-to-accelerate-20250729.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--Toolio, a next-generation merchandise planning platform for modern retailers, today announced its participation in the Microsoft for Startups Pegasus Program. Toolio has also launched a strategic integration with Microsoft Azure and is now a transactable solution on Azure Marketplace, enabling Microsoft sales teams to directly bring Toolio's innovative solution to customers worldwide. Revolutionizing Retail Planning with Toolio Toolio is a cloud-native merchandise pla.", "url": "https://www.businesswire.com/news/home/20250729256064/en/Toolio-Joins-Microsoft-for-Startups-Pegasus-Program-to-Accelerate-AI-Powered-Retail-Planning-Innovation/", "publishedDateET": "2025-07-29T05:00:00-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 08:37:32", "publisher": "Reuters", "title": "Microsoft in advanced talks for continued access to OpenAI tech, Bloomberg News reports", "image": "https://images.financialmodelingprep.com/news/microsoft-in-advanced-talks-for-continued-access-to-openai-20250729.jpg", "site": "reuters.com", "text": "Microsoft is in advanced talks for a deal that would give the Windows maker continued access to critical OpenAI technology in the future, Bloomberg News reported on Tuesday, citing two people familiar with the negotiations.", "url": "https://www.reuters.com/business/microsoft-advanced-talks-continued-access-openai-tech-bloomberg-news-reports-2025-07-29/", "publishedDateET": "2025-07-29T04:37:32-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 08:11:58", "publisher": "Investors Business Daily", "title": "Will Microsoft's AI Models Break Into Palantir's Government Turf?", "image": "https://images.financialmodelingprep.com/news/will-microsofts-ai-models-break-into-palantirs-government-turf-20250729.jpg", "site": "investors.com", "text": "Palantir stock fell on Monday amid a report the government is evaluating Microsoft's artificial intelligence models. Shares rose Tuesday.", "url": "https://www.investors.com/news/technology/palantir-stock-microsoft-artificial-intelligence-competition-government/", "publishedDateET": "2025-07-29T04:11:58-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 08:00:00", "publisher": "Business Wire", "title": "KnowBe4 Collaborates With Microsoft To Tackle Risky Online Behaviors", "image": "https://images.financialmodelingprep.com/news/knowbe4-collaborates-with-microsoft-to-tackle-risky-online-behaviors-20250729.jpg", "site": "businesswire.com", "text": "TAMPA BAY, Fla.--(BUSINESS WIRE)--KnowBe4 partners with Microsoft to integrate SecurityCoach with Edge for Business, providing real-time security guidance for risky user behavior.", "url": "https://www.businesswire.com/news/home/20250729764616/en/KnowBe4-Collaborates-With-Microsoft-To-Tackle-Risky-Online-Behaviors/", "publishedDateET": "2025-07-29T04:00:00-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 07:30:00", "publisher": "Market Watch", "title": "Microsoft's stock has been on fire. Will good earnings be enough to further the rally?", "image": "https://images.financialmodelingprep.com/news/microsofts-stock-has-been-on-fire-will-good-earnings-20250729.jpg", "site": "marketwatch.com", "text": "Microsoft's hot stock performance means investors “may need some patience,” even if Azure numbers impress, according to one analyst.", "url": "https://www.marketwatch.com/story/microsofts-stock-has-been-on-fire-will-good-earnings-be-enough-to-further-the-rally-2470aba0", "publishedDateET": "2025-07-29T03:30:00-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 06:41:46", "publisher": "Reuters", "title": "Microsoft's AI edge under scrutiny as OpenAI turns to rivals for cloud services", "image": "https://images.financialmodelingprep.com/news/microsofts-ai-edge-under-scrutiny-as-openai-turns-to-20250729.jpg", "site": "reuters.com", "text": "Microsoft investors head into Wednesday's earnings with one big question: is the company's artificial intelligence edge at risk as partner OpenAI turns to rivals Google, Oracle and CoreWeave for cloud services?", "url": "https://www.reuters.com/business/microsofts-ai-edge-under-scrutiny-openai-turns-rivals-cloud-services-2025-07-29/", "publishedDateET": "2025-07-29T02:41:46-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 06:08:05", "publisher": "Invezz", "title": "Dan Niles reveals favourite ‘Magnificent Seven' stocks for the earnings season", "image": "https://images.financialmodelingprep.com/news/dan-niles-reveals-favourite-magnificent-seven-stocks-for-the-20250729.jpg", "site": "invezz.com", "text": "Niles Investment Management founder Dan Niles expects the “Magnificent Seven” names to post a strong second quarter– but he's not entirely convinced that the stocks will push meaningfully to the upside.", "url": "https://invezz.com/news/2025/07/29/dan-niles-reveals-favourite-magnificent-seven-stocks-for-the-earnings-season/", "publishedDateET": "2025-07-29T02:08:05-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 06:00:00", "publisher": "Business Wire", "title": "Esri, Microsoft, and Space42 Join to Launch “Map Africa Initiative”", "image": "https://images.financialmodelingprep.com/news/esri-microsoft-and-space42-join-to-launch-map-africa-initiative-20250729.jpg", "site": "businesswire.com", "text": "REDLANDS, Calif.--(BUSINESS WIRE)--Esri, the global leader in location intelligence, has signed a Memorandum of Understanding (MoU) with Space42 and Microsoft to support the Map Africa Initiative. The effort is a five-year endeavor to produce the most comprehensive basemap of Africa to date. The initiative will deliver high-resolution, scalable geospatial data across all 54 African countries with the goal to benefit more than 1.4 billion people. Many of Africa's official maps are fragmented, ou.", "url": "https://www.businesswire.com/news/home/20250729931695/en/Esri-Microsoft-and-Space42-Join-to-Launch-%E2%80%9CMap-Africa-Initiative%E2%80%9D/", "publishedDateET": "2025-07-29T02:00:00-04:00"}
{"symbol": "MSFT", "publishedDate": "2025-07-29 04:25:03", "publisher": "Forbes", "title": "Sell Microsoft Stock Ahead of Its Upcoming Earnings?", "image": "https://images.financialmodelingprep.com/news/sell-microsoft-stock-ahead-of-its-upcoming-earnings-20250729.jpg", "site": "forbes.com", "text": "Microsoft (NASDAQ:MSFT) is set to announce its earnings report on Wednesday, July 30, 2025. While the actual results in relation to analyst expectations will be the main factor influencing stock movement, event-driven traders might find it useful to examine historical trends.", "url": "https://www.forbes.com/sites/greatspeculations/2025/07/29/sell-microsoft-stock-ahead-of-its-upcoming-earnings/", "publishedDateET": "2025-07-29T00:25:03-04:00"}
