{
  "symbol": "PLTR",
  "quarter": 4,
  "year": 2022,
  "date": "2023-02-13 17:00:00",
  "content": "Ana Soro: Good afternoon. I'm Ana Soro from Palantir's finance team, and I'd like to welcome you to our Fourth Quarter 2022 Earnings Call. We'll be discussing the results announced in our press release issued after the market closed and posted on our Investor Relations website. During the call, we will make statements regarding our business that may be considered forward-looking within applicable securities laws, including statements regarding our first quarter and fiscal 2023 results, management's expectations for our future financial and operational performance and other statements regarding our plans, prospects and expectations. These statements are not promises or guarantees and are subject to risks and uncertainties, which would cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed after the market closed today and in our SEC filings. We undertake no obligation to update forward-looking statements, except as required by law. Further, during the course of today's call, we will refer to certain adjusted financial measures. These non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from GAAP measures. Additional information about these non-GAAP measures, including reconciliation of non-GAAP to comparable GAAP measures, is included in our press release and investor presentation provided today. Our press release, investor presentation and SEC filings are available on our Investor Relations website at investors.palantir.com. Over the course of the call, we will refer to various growth rates when discussing our business. These rates reflect year-over-year comparisons, unless otherwise stated. Joining me on today's call are Alex Karp, Chief Executive Officer; Dave Glazer, Chief Financial Officer; and Ryan Taylor, Chief Revenue Officer and Chief Legal Officer. You'll also be hearing from Shyam Sankar, our Chief Technology Officer, who prepared a few remarks, who could not join today's call as he's on the front lines with one of our customers. I'll now turn it over to Alex for opening remarks.\nAlex Karp: At Palantir, we have a tradition of talking about macro events philosophy. There would be a lot to talk about this year. I think for the first time, people have seen the impact of digitization of warfare and Palantir's central role in the world. Leaving aside this, and I would love to talk more about it in the context of our earnings call, in the context of our interactions with the broader world, the transformations on the outside of the world brought to you by Palantir seem to be equally big on the inside. Palantir, for the first time, is GAAP profitable. I, in most of my discussions, talk about product, talk about product market fit, occasionally talk about revenue. And I'm often asked, well, if it's so good, why aren't you GAAP profitable? We promised you GAAP profitability in 2025, which you thought would be in 2027 perhaps. We are now, in the last quarter GAAP profitable, and we plan to be GAAP profitable in this year. Obviously, there's a lot of questions around that, like how did we become GAAP profitable several years before anyone expected? What does it mean for our business? What does it mean that seemingly no tech company ever becomes GAAP profitable? Why is our company profitable? What sectors of the Company made it profitable? But for those of you who have been long-term supporters or even watchers of Palantir, the move from a company that was producing the most important products in the world to a company that is doing that in a profitable context is enormous, perhaps as big as our DPO. And we're proud of this because it gives us the strength and power to continue our march to support the world's most institutions -- important institutions. Thank you.\nRyan Taylor: As Alex highlighted, our company, after nearly two decades, achieved GAAP profitability for the first time last quarter. Our focus has been on building one of the most significant and durable software companies in the world. And our first profitable quarter after years of investment in our business represents the beginning of a new chapter in our company's history. In Q4 2022, we generated $509 million in revenue, and we generated $79 million in cash from operations, marking our eighth consecutive quarter of positive cash from operations. While the technology industry as a whole has been facing one of the most challenging operating environments in years, we continue to deliver on our top line and bottom line results, in particular, our combined revenue growth and adjusted operating margin. Our commercial business generated $215 million of revenue last quarter. While our U.S. commercial business slowed in the fourth quarter as a result of catch-up revenue in the prior quarter and contracting revenue from customers in our strategic investment program, we remain confident about our momentum and the opportunities ahead. We ended the quarter with 143 U.S. commercial customers, an increase of 79% year-over-year, and converted 13 pilots the most in quarter to date set up our U.S. commercial business to reaccelerate in 2023. We are deploying increasingly focused go-to-market strategies, including in the health care, supply chain, manufacturing, energy, automotive and utility sectors. The number of deals closed in health care more than doubled in the last year. We recently signed with several of the nation's largest hospital systems, including Cleveland Clinic, Tampa General and one of the oldest teaching hospitals. Our momentum continues this year, having recently signed a deal with an American for-profit operator of over 2,400 health care sites. Together, these four hospital systems represent nearly 10% of the entire hospital system in the United States. In the supply chain sector, we began work at two of the largest Coca-Cola bottlers and distributors in both the U.S. and the EMEA region. And we were called into Toyota Material Handling, a forklift manufacturer and distributor, after executives learned of our comparable supply chain work at Komatsu. Cardinal Health also recently began using Foundry to deploy AI and ML to combine diagnosis and clinical data with real-time customer purchasing and consumption data for pharmaceutical products. Our international commercial business grew 11% year-over-year in the fourth quarter, including a multimillion dollar long-term strategic partnership with Crisis24, a GardaWorld company, to deliver data-driven security and risk management, and a $50 million five-year expansion of our work with SOMPO Holdings, where Foundry is helping to improve security, health and well-being through digital transformation. Our government business overall saw growth across the board as well as we generated $293 million in revenue this past quarter, an increase of 23% year-over-year. Our U.S. government business saw continued growth in Q4, up 22% year-over-year, which reflects the strong contract activity in Q3. Likewise, our international government business was up 26% year-over-year, including the expansion of our work supporting pressing global events as well as the signing of Palantir's enterprise agreement with Defence Digital, a consolidated effort on the part of the British military to modernize its software systems. With the value of up to GBP75 million, we expect this agreement to further accelerate the growth of partnerships with defense and intelligence customers across the United Kingdom as well as our U.K. government business overall. This quarter's GAAP profitability illustrates our commitment to fiscal responsibility through management and margins while expanding our business. We acknowledge the challenges ahead and remain strongly poised for long-term growth. I'll now turn it over to Shyam.\nShyam Sankar: In 2022, our software foiled a plot to overthrow the German government, delivered $200 million of return to Tyson Foods, empowered companies through the energy crisis. Our momentum stems from the fact that we have built software that actually works, not software that's easier to sell. We publicly announced Foundry 23 at Foundry Con 2 weeks ago. The cornerstone of our product vision is that your business is computable. But just because it's computable doesn't mean you know how to compute it. This requires an ontology. Ontology is link human insight with programmable controls, enabling your people to compute the parts of your business that really matter. For example, Tyson Foods implemented a model that determines the optimal allocation of inventories to trucks and distribution centers and automatically decisions that by calling back into their ERP systems, the ontology's Webhooks. This work among the 20 use cases Tyson's delivers in Foundry, delivered $200 million of value for them. Upgrading to S4 doesn't do this. It doesn't make your business better. Your planning tools and pricing platforms don't talk to each other. ERP and MES systems don't talk to each other. So employees escape to Excel sheets, and business logic is scattered across systems. That makes your business hard to understand and harder yet to change or improve. Our customers need software to connect and orchestrate their existing systems. Your business is computable. You need Foundry to compute it. This view and a focus on our ontology is driving our product developments through 2023. Turning to Apollo. Just because you know how to compute parts of your business doesn't mean it's valuable. You need to complete the cycle of development, deployment and learning. Not only do you have to be able to push your logic out to the edge to the factory floor, to every connected node in your business you need to be able to do it repeatedly. As technology companies seek to aggressively reduce cloud costs and eliminate DevOps headcount, Apollo provides the critical technology enabler that solves not only the CTO's problem, but also the CFO's problem. We're also continuing to see traction with Fed Start, our Apollo-based offering, which enables customers to achieve FedRAMP authorization in record time and at a fraction of the cost while still reducing DevOps cost. From the Middle Eastern, the Pacific and European theaters, Gotham is today the AI-driven operating system for defense. Recent events have already proven the superiority of Gotham and AI-driven target detection and development. In 2023, we are focused on the continued development of Gotham against both targeting and fires across all domains from space to mud. A forward deployed O-3 recently wrote a python model using Gotham software development kit for JADC2 in three hours to upgrade his units targeting and fires operation, a step change versus what was possible before. We're proud of and thankful for the privilege of supporting this mission set. I'll pass it to Dave to take us through the financials.\nDave Glazer: The fourth quarter of 2022 was a milestone quarter for us. For the first time in the Company's history, we've achieved GAAP profitability. This was driven by our top line and bottom line outperformance, our continued management of stock-based compensation and fiscal discipline, the narrowing of losses from marketable securities and a gain from the acquisition of our Palantir Japan joint venture. On the back of that strength, we expect full year 2023 to be our first full year of GAAP profitability several years ahead of our original goal of GAAP profitability in 2025. Turning to our global top line results. We generated $1.91 billion in revenue in 2022, representing a growth rate of 24% year-over-year. In the fourth quarter of 2022, we generated $509 million in revenue, up 18% year-over-year and 6% sequentially. We generated $1.16 billion in total U.S. revenue in 2022, representing a growth rate of 32% over the year ago period. In the fourth quarter of 2022, U.S. revenue grew 19% year-over-year to $302 million. Overall, net dollar retention was 115%. Customer count grew 55% year-over-year and 9% quarter-over-quarter. Revenue from our existing customers continues to expand. Fourth quarter trailing 12-month revenue from our top 20 customers increased 13% year-over-year to $49 million per customer. Now moving on to our commercial segment. In 2022, our overall commercial revenue grew 29% year-over-year to $834 million. In the fourth quarter of 2022, our commercial revenue grew 11% year-over-year and 6% sequentially. Commercial revenue from strategic investment contracts was $20 million in the fourth quarter. We anticipate commercial revenue from these customers to be between $15 million to $17 million in the first quarter of 2023 compared to $39 million in the first quarter of 2022. Our full year U.S. commercial revenue grew 67% year-over-year to $335 million. In the fourth quarter of 2022, U.S. commercial revenue grew 12% year-over-year to $77 million but was down sequentially as we saw headwinds from catch-up revenue in the prior quarter as well as a decline of revenue from customers in our strategic investment program given the outsized impact of the macro environment on these customers. Our U.S. commercial customer count grew 79% year-over-year and 8% quarter-over-quarter, marking the eighth consecutive quarter of sequential growth. In the fourth quarter of 2022, our international commercial business grew 11% year-over-year and 19% sequentially driven by new deals in APAC, Canada and Europe. Turning to our government segment. In 2022, our government business grew 19% year-over-year to $1.07 billion. And in the fourth quarter of 2022, our government business grew 23% year-over-year to $293 million. We generated $826 million in U.S. government revenue in 2022, representing a growth rate of 22% year-over-year. In the fourth quarter of 2022, we generated $225 million in U.S. government revenue, representing a growth rate of 22% year-over-year and 8% sequentially. The sequential growth was driven by the commencement of certain U.S. government deals we announced last quarter. Fourth quarter billings were $387 million. Full year billings were $1.8 billion, up 21% year-over-year. TCV booked in the fourth quarter was $392 million. Full year TCV bookings was $2.7 billion, up 4% year-over-year. We ended 2022 with $3.7 billion in total remaining deal value and $973 million in remaining performance obligations. As a reminder, RPO is primarily comprised of our commercial business as it does not take into account contracts with an initial term of less than 12 months and contractual obligations that fall beyond termination for convenience clauses, both of which are common in our government business. Both remaining deal value and remaining performance obligations faced headwinds from the macroeconomic impact on customers from the strategic investment program. As a result, the total remaining deal value and the total value of our commercial contracts from our strategic investment program was down $262 million since last quarter as we continue to review the financial condition of these businesses. We'll continue to monitor the impact as the year progresses. Turning to margin and expense. Adjusted gross margin, which excludes stock-based compensation expense, was 81% for the year and 82% for the quarter. Full year 2022 adjusted expenses, when excluding stock-based compensation and related employer payroll taxes, were $1.5 billion. Fourth quarter adjusted expenses were $394 million, down roughly 1% sequentially, reflecting measures we took in quarter to manage discretionary spending and our focus on efficiencies. Full year 2022 adjusted income from operations, which excludes stock-based compensation and related employer payroll taxes, was $421 million. Fourth quarter adjusted income from operations was $114 million, representing an adjusted operating margin of 22%, 600 basis points ahead of our prior guidance. The significant beat on our adjusted income from operations guidance was driven by cost savings from our R&D efforts and disciplined spend management as well as moderated net headcount additions in the fourth quarter. The fourth quarter of 2022 was our strongest GAAP operating income quarter ever as we move closer to breakeven with an operating loss of $18 million. This is a testament to our disciplined spending amid the macro uncertainty as well as the normalization of our stock-based compensation expense overhang since becoming a public company. Stock-based compensation expense was down $38 million in the fourth quarter compared to the year ago period and down $213 million compared to the year ago period. As we look ahead to 2023, we will continue to exercise spend discipline across the Company, pace hiring while continuing to invest in high priority areas, including in our product offerings, building out our go-to-market strategy and technical roles. In addition to GAAP profitability for full year 2023, we anticipate improvement in our GAAP operating income margins over the course of the year. Fourth quarter GAAP net income was $31 million. This was a result of a strong GAAP operating quarter in addition to $13 million of investment income from our balance sheet, narrowing of losses on marketable securities to $11 million and a $44 million gain from the acquisition of our Palantir Japan joint venture. But it's not just our GAAP profitability and operating performance that I'm excited about. Our combined revenue growth and adjusted operating margin was 40% in the fourth quarter and 46% in full year 2022, our third consecutive full year in excess of the Rule of 40 and a score that we will continue to strive to achieve throughout 2023. Full year adjusted earnings per share was $0.06, and GAAP earnings per share was negative $0.18. Fourth quarter adjusted earnings per share was $0.04, and GAAP earnings per share was $0.01, marking our first quarter of positive GAAP EPS. In the fourth quarter of 2022, we generated $79 million in cash from operations, representing a margin of 15% and our eighth consecutive quarter of positive cash from operations. For the full year 2022, we generated $224 million in cash flow from operations, representing a 12% margin. We ended the fourth quarter with $2.6 billion in cash and cash equivalents, and no debt. We retain access to additional equity up to $950 million through our $500 million revolving credit facility and $450 million delayed draw term loan facility, both of which remain entirely undrawn. Now turning to our outlook. For Q1 2023, we expect revenue of between $503 million and $507 million and adjusted income from operations of $91 million to $95 million. For full year 2023, we expect revenue of between $2.18 billion and $2.23 billion, adjusted income from operations of between $481 million to $531 million and GAAP net income. Before opening the call up for questions, I'd like to take a moment to thank Jeff Buckley, our outgoing Chief Accounting Officer, for his contributions to Palantir. Jeff has been an incredible leader and a member of our team on the journey from a private company to a public company. We announced a few weeks ago that he'd be stepping down after the filing of our 10-K, and we're grateful that he will be staying on with us after to help with a seamless transition. We're excited to promote Heather Planishek to the role and look forward to continuing to build on both Jeff's and the team's successes. With that, I'll turn it over to Ana to start the Q&A.\nA - Ana Soro: Thanks, Dave. We'll begin with a few questions from our shareholders before we open up the call. The top questions are related to GAAP profitability, with the number one question from Abraham who asks, when is Palantir going to become profitable?\nAlex Karp: Well, we're profitable, and we will be profitable this year on a year basis. I think -- because if you look at the questions that come to us and just the questions I get from clients and others, one of the main questions we've gotten in public and in private is, well, we know the products are transformational. We've seen them in the context of anti-terrorism, especially in Europe. We've seen them in the context of pandemic and now in the context of changing the course of history in Eastern Europe. But if it's so powerful and so good, why aren't you profitable? And I think we took this question a lot more seriously than I think people on the outside realize precisely because there are literally thousands and thousands of users and, at this point, countries, that depend on our product for their survival. And while many of us watching this are obviously highly attenuate to share price, the people whose lives depend on our product have been very dependent on us and want to know that our financial stability now and in the future is guaranteed. So this has been much more of a priority to get us to this place. I'm happy that we have long-term supporters and shareholders that are interested in this, and we will continue to be profitable this year. And so, it's just a major achievement for Palantir. I think another reason the question gets asked is because seemingly, no tech companies ever become GAAP profitable. And that does call into question the underlying value of their products. Yes. With that, next question.\nAna Soro: Thanks, Alex. We also received a few questions on ChatGPT and AI. How does Palantir differentiate and compete with other AI software solutions and demonstrate the return on investment for potential clients?\nAlex Karp: There's been a lot of talk about recent events in consumer Internet and OpenAI, and incredible technologies that have been brought to bear. I think the biggest event in digitalization AI is actually on the battlefield. Palantir took over basically nonpublic programs when the rest of Silicon Valley at the time was very interested in not working with the military, potentially also opening offices in adversarial countries. At the time, AI was a joke, and most people purveying it were partially purveying some form of a PowerPoint bordering on fraud. And so we had a lot of thought going into this and spent the last five years building the core infrastructure that you would need to power and train AI algorithms. The proof in the pudding is simply look at events in Eastern Europe. And so every country in the world is looking how to do it. But what's super interesting in the consumer context is the technologies we built that will allow you to do AI in private networks, institutions and enterprises, have precursor technologies that will take other companies four or five years to build. For example, how do you do AI in a regulated context? Look at a lot of our clients, they're almost all regulated in one form or another. Oil and gas is regulated. Hospitals are regulated. Health care is regulated. Manufacturers is regulated. You can't just run an algorithm on a private network the same way you could on a non-regulated public network. And then there's security issues, there's transparency issues. In the war context, how do you know if the AI made the decision? Under what conditions does AI make the decision? Under who is responsible? What is the chain of authority? How do you do it while maintaining security, because some of the people using the product may actually be working for the other side? There's just thousands and thousands of issues here that required years and years of software build, which we are now going to continue to supply to our allies across the world and to our consumer customers. So we're very, very excited about this, excited about the interest and excited about bringing the fight to our adversaries.\nAna Soro: Thanks, Alex. We received a few questions on SBC and dilution, including one from Christopher, who asks at what point is Palantir hoping to reduce SBC?\nDave Glazer: Thanks, Christopher. We're laser-focused on SBC and we have been the last few years. If you go back to the quarter that we went public, Q3 of 2020, we had $849 million in that quarter of SBC. You go back to Q4 of 2022, just last quarter it was only $129 million. The last six quarters, we've been down sequentially each quarter with our SBC, and 2022 versus 2021 is down 27% year-over-year. Stepping back, the ultimate test around SBC is really like, are you GAAP profitable? And the answer now is yes. It's yes in Q4. And as we look forward to 2023, the answer is yes there as well. Equity overall, we want to make sure that we align our employees and our stockholders. And you sort of see that in the current results, which are all resulting in GAAP profitability. And so we plan to keep that alignment, to push on the top line, improve the margin and to stay GAAP profitable.\nAna Soro: Thanks, Dave. This next question is for you, Ryan. Zachary asks, what are Palantir's primary goals for 2023?\nRyan Taylor: Thanks, Zachary. We're planning to keep our heads down, keep doing what we've been doing, which means delivering to our customers on their critical missions with an eye towards long-term growth. And what that specifically means is continuing to focus on both top line and bottom line, our revenue growth, adjusted operating margins and delivering on GAAP profitability, as we've laid out. In the U.S. commercial space, we grew 67% year-over-year. As I highlighted earlier, we have a lot of strong indicators of momentum going into this year, and we expect to deliver another landmark year in U.S. commercial. In the U.S. government space, we'll continue doubling down on the backbone of our business, one of our most important customers, which means seeking to accelerate defense, civil and intelligence space. And obviously, there are factors such as whether or not there's a continuing resolution that might affect the timing of that, but our long-term outlook on U.S. government is extremely strong. In the international space, we're looking to grow the defense business outside of the U.S. as our allied countries are looking to deploy the expertise that we've honed over 20 years around the world in the most important missions. We're looking to grow our work in civil. We're particularly excited about health care and keep our momentum in the U.K. government. And all while doing that, we seek to continue to deliver on GAAP profitability.\nAlex Karp: A different version of that is we will maintain our discipline around GAAP profitability precisely because the world is recognizing our crucial contribution to the West. We see this in war. We see this in the commercial areas. We see this in health care. We see this where people are embracing technology, especially in the U.S., especially around AI, especially around AI with security models, in private networks. And so there's a tethering between our financial discipline and our ability to just continue crushing in the service of what we believe is important, Western institutions and that they survive and thrive better than adversarial institutions.\nAna Soro: Thank you, Ryan and Alex. Our next question is from Brent with Jefferies. Brent, please turn on your camera and then you'll receive a prompt to unmute your line.\nBrent Thill: Dr. Karp, as it relates to the government business, I'm curious if you could just give us an update. I think last year, you had mentioned there were a handful of transactions that got pushed and ultimately not exactly sure what happened there, if you could address that? And then secondarily, there was a CNBC reporter that I think you spoke to just had some comments about strategic interest in Palantir. And I'm just curious if you can just recap maybe what that conversation was and just ultimately how you're thinking about current multiples and where things have gone to you at this point.\nAlex Karp: Taking the second question first. Really, we've been asked -- we were asked -- a number of reporters have asked me and in general, since -- look, you have a general move where in the last five years, enterprise software has moved from being a sales motion to an existential part of the enterprise, whether the enterprises commercial or in government. The war in the Ukraine proves this. I think most commercial entities in America know this. It's not clear that people know this outside of America, but this is a crucial part of your enterprise. It's also pretty clear that we've built proprietary technology that will allow you to do this in private networks in the context of regulated enterprises that is not available anywhere else. And it would take years and years to build. And that just generates a lot of interest in not -- in Palantir in a way that you didn't have before. And so our basic view of Palantir is we are in this to make institutions of the West stronger. We believe we're winning. Because we're winning, I think there's going to be a lot of interest in us in buying our software and potentially in buying us, but we are pretty focused on our product, which is us. So really not thinking about that very much at all. Gratified that there's been speculation all over that people might want to buy us, but that's really irrelevant. Then on government, there's really -- you're asking about the U.S. government. The U.S. government has these continuing resolutions. We have a number of large-scale contracts that are in the works. There's really no update. The only update is with this call is coming from Washington. It's coming from Washington because regulators, people in Congress and people in the military also have seen what's going on. And there's just a different level of interest in what we provide. It's just -- what does that mean year-on-year? I don't know. I do know that the CAGR on our U.S. government has historically been over 30%. And I think there's a debate among people who support us or don't support us whether that's going to be in the future, the future will represent in the past. I would say every time you open the news, you see another thing that makes Palantir more valuable, whether it's wars in the East or balloons over our society. This is a world that is dangerous that needs AI-driven and, in general, software-driven weaponry. And no other company in the world has been focused on this for the last 20 years than we are. And we are also on these programs. So the short version is no news. The long version is I'm very optimistic.\nAna Soro: Thanks, Alex. Our next question is from Mariana with Bank of America. Mariana, please turn on your camera and then you'll receive a prompt to unmute your line.\nMariana Perez Mora: So my question is about the revenue growth into next year. Do you mind describing what are the main drivers that make...\nAlex Karp: By the way, your -- we lost you. We lost you after what are the main drivers. I think what you're asking is what are the main drivers that will affect us our revenue build this year?\nMariana Perez Mora: All right. I don't know if you can still hear me or not.\nAlex Karp: Sporadically. I'll say -- I don't know if you guys want to say a couple of words on this or do you want me to launch into my...\nRyan Taylor: Yes. I think -- thank you. So I think as we highlighted, like momentum in U.S. commercial is strong. We expect it to be a key part of our growth in our business. U.S. government, obviously critical to our business. Now we expect to see more of that coming later in Q2 and second half of the year. And then in the international business, I think it's continued to deliver on the defense-related initiatives that we're working on. I think combined, those will be the key drivers for our...\nAlex Karp: Maybe a more direct answer or one that is -- roughly 61% of our business comes from the U.S. I think there's a lot of positive indicators that, that will continue to grow. I'm bullish on commercial. I just met with our commercial team. I suspect that will grow north of 40%. There's lots of reasons for that. The main -- despite the fact that we may have a recession, and of course, the recession is severe enough, it will affect our revenue in the U.S. But you see a lot of positive -- our customers went from something like 80 to 143 last year. It's almost 70%, 80% growth. And then in the U.S., we only have 15% of the top 1,000 companies buying our product, which means we have a lot of room for growth. And last and not least, arguably, most importantly, in the U.S., all parts of the enterprise buy our product. So outside the U.S., it's really CEOs forcing business decision for us on the Company, which is historically we sold our product all over the world. Inside the U.S., it's IT people. It's subdivisions, it's CEOs. Really doesn't matter. They buy different parts of the product, and they're friendly to new things, and they've also gone through a cycle of seeing a lot of the enterprise products are just for churning and storing your data that there's not many results, and they're actually very expensive. And people are suspectful of having a compute model and something that gives you a margin. So the U.S., it looks very strong. U.S. government, we've already been asked about. The weakness in our business is just non-U.S. commercial that grew around 12% last year. I think outside the U.S., they're a lot less friendly to new innovations. It's not clear how they'll react to AI, although we can do AI in the context of data protection. You just have a lack of resistivity in parts of Europe to new technology. So the over-under is, the 61% of our business that is strong is growing and will be a larger part of our business. I suspect the macro environment is largely driven by adversarial nations to America will help us. And then international government, I think that's very likely over time to be very strong because the MetaConstellation product looks like the most cost-effective way to defend your country in the world. And our Ukrainian allies are willing to talk about it and see its value. So I see a lot of -- and we're already seeing countries that are on the border of adversaries, being very, very interested in this product. So, the way I would think about this is think of the U.S. -- I think of the U.S. as being strong. International government as being a real possibility and a drag is just the economic and cultural events in Europe, which is still a significant part of our business. So that's the over and under.\nAna Soro: Thanks, Alex. Our last question is from Gabriela with Goldman Sachs. Gabriela, please turn on your camera and then you'll receive a prompt to unmute your line.\nGabriela Borges: Great. A couple of follow-ups on your commercial business. Firstly, could you give us a little detail on how the large deal pipeline is evolving? And as the macro impacting our ability to close any of the deals in the U.S. on large deals specifically? And then secondly, as you think about the mix between large deals and small deals, are you seeing engagement to date from your U.S. customers that are landing potentially smaller quota in the half a million dollar kind of range, are you seeing engagement to date that suggests the path towards your classic kind of $3 million to $5 million opportunity?\nRyan Taylor: Great. So I think on the first question, one, we're obviously seeing our largest customers are growing. If you look at the top 20 customers we have, we're seeing growth there. As you see the average customer size is decreasing, and that's in part because of the volume of customers that we're bringing on to the customers into our space. And so, I think we're seeing both growth in large customers and a broader set of customers, which -- but at the same time, I think in Q4, we saw a number of those smaller customers come on, convert into larger deals within the quarter, particularly in the commercial space. And we're seeing a number of these smaller customers convert longer-term enterprise deals, and we're seeing the momentum there. I also think, at the same time, we're seeing a lot of the ability to sell across a broader set of customers in a smaller price range in a way that we can get started at a smaller price point, but then grow from there as well.\nAlex Karp: 53% of our business are large deals, and that's almost $50 million. So that -- some people love that. Some people don't. I loved it because it means we're a little more recession-proof. So then you have a tale of two stories, tale of two cities. The small -- the average revenue size went from 6.5 to just over $5 million. So it's decreasing. It's decreasing for exactly the reason Ryan says. It's decreasing because we're doing well in the U.S. Most U.S. commercial customers don't buy $50 million contracts. They buy $2 million, $3 million contracts. I think we're going to see a lot more of that. What I see on the ground there are a lot of people wanting to use our software. We believe in our software. So we're open to a lower price point. We are more expensive than what I would offer some other products, but that we also think it's more valuable. So I think what you're going to see is kind of a tale of two cities at Palantir, large contracts getting larger and many, many more small contracts, especially in the U.S.\nAna Soro: Thank you, Alex and Ryan. Alex, we have a lot of individual investors on the line. Is there anything you'd like to say before we end the call?\nAlex Karp: We -- I value individual investors quite a bit, we do at Palantir, all of us at Palantir, individual investors. We listen to you. We are very proud that we're GAAP profitable in Q4 last year. We plan to be GAAP profitable this year. That's in part because we listened to you. It's in great part because we listened to our partners and customers on the frontline and at institutions that rely on us for their livelihood and for their life that they need to -- they need a company, they need talent here to be as strong as possible. That's why we became -- we went into the black, why we're planning to stay in the black on a yearly basis and why we have $2.6 billion in the bank and no debt. And it's going to be tough weather out there. We believe, I believe the macroeconomic environment, the political environment is going to be rough and often terrible. That gives Palantir crucial role, and we really, really respect your support.\nAna Soro: Thank you. That concludes Q&A for today's call."
}