{"symbol": "AAPL", "publishedDate": "2021-10-27 18:35:00", "publisher": "Reuters", "title": "Microsoft nearly overtakes Apple as most valuable company", "image": "https://images.financialmodelingprep.com/news/microsoft-nearly-overtakes-apple-as-most-valuable-company-20211027.jpg", "site": "reuters.com", "text": "A surge in Microsoft Corp's shares nearly unseated Apple Inc as the world's most valuable company on Wednesday, a day before the iPhone maker reports its quarterly results.", "url": "https://www.reuters.com/technology/microsoft-nearly-overtakes-apple-most-valuable-company-2021-10-27/", "publishedDateET": "2021-10-27T14:35:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 15:19:00", "publisher": "Market Watch", "title": "The Ratings Game: Here are the companies that Apple's ad changes are hurting, and the ones that can withstand the pain", "image": "https://images.financialmodelingprep.com/news/the-ratings-game-here-are-the-companies-that-apples-20211027.jpg", "site": "marketwatch.com", "text": "The latest batch of internet earnings helped reveal the winners and losers from Apple Inc.'s privacy-related changes to its mobile operating system.", "url": "https://www.marketwatch.com/story/here-are-the-companies-that-apples-ad-changes-are-hurting-and-the-ones-that-can-withstand-the-pain-11635362369", "publishedDateET": "2021-10-27T11:19:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 14:28:25", "publisher": "GuruFocus", "title": "Ken Fisher Trims Top Holdings Apple and Visa, Boosts ETF", "image": "https://images.financialmodelingprep.com/news/ken-fisher-trims-top-holdings-apple-and-visa-boosts-20211027.jpg", "site": "gurufocus.com", "text": "Prolific investor Ken Fisher (Trades, Portfolio), leader of Fisher Asset Management, disclosed his third-quarter portfolio earlier this week.", "url": "https://www.gurufocus.com/news/1555530/ken-fisher-trims-top-holdings-apple-and-visa-boosts-etf", "publishedDateET": "2021-10-27T10:28:25-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 13:40:37", "publisher": "Schaeffers Research", "title": "Could This Apple Rival See More Growth in 2022?", "image": "https://images.financialmodelingprep.com/news/could-this-apple-rival-see-more-growth-in-2022-20211027.jpeg", "site": "schaeffersresearch.com", "text": "Dell Technologies Inc. (NYSE:DELL) is an American tech company headquartered in Round Rock, Texas.", "url": "https://www.schaeffersresearch.com/content/analysis/2021/10/27/could-this-apple-rival-see-more-growth-in-2022", "publishedDateET": "2021-10-27T09:40:37-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 12:41:00", "publisher": "Seeking Alpha", "title": "ETO: A Solid Dividend Fund But Expensive", "image": "https://images.financialmodelingprep.com/news/eto-a-solid-dividend-fund-but-expensive-20211027.jpg", "site": "seekingalpha.com", "text": "ETO: A Solid Dividend Fund But Expensive", "url": "https://seekingalpha.com/article/4462440-eto-solid-dividend-fund-expensive", "publishedDateET": "2021-10-27T08:41:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 12:11:13", "publisher": "Zacks Investment Research", "title": "A Deep Dive into the Apple (AAPL) and Amazon (AMZN) Earnings Charts", "image": "https://images.financialmodelingprep.com/news/a-deep-dive-into-the-apple-aapl-and-amazon-20211027.jpg", "site": "zacks.com", "text": "They are two trillion-dollar companies that are among the best performing stocks of the last decade. But what do their earnings track records look like?", "url": "https://www.zacks.com/stock/news/1817584/a-deep-dive-into-the-apple-aapl-and-amazon-amzn-earnings-charts", "publishedDateET": "2021-10-27T08:11:13-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 11:15:14", "publisher": "24/7 Wall Street", "title": "Earnings Previews: Amazon, Apple, Starbucks, US Steel", "image": "https://images.financialmodelingprep.com/news/earnings-previews-amazon-apple-starbucks-us-steel-20211027.jpg", "site": "247wallst.com", "text": "More than 100 companies in our watch list reported earnings after markets closed Monday and before they opened again on Tuesday.", "url": "https://247wallst.com/investing/2021/10/27/earnings-previews-amazon-apple-starbucks-us-steel/", "publishedDateET": "2021-10-27T07:15:14-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 10:16:07", "publisher": "Investopedia", "title": "Apple Earnings: What to Look For", "image": "https://images.financialmodelingprep.com/news/apple-earnings-what-to-look-for-20211027.jpg", "site": "investopedia.com", "text": "Apple (AAPL) reports Q4 earnings after market close on Oct. 28. Can it keep revenue and profits rising at a torrid pace amid the supply chain crisis?", "url": "https://www.investopedia.com/apple-q4-fy2021-earnings-report-preview-5207192", "publishedDateET": "2021-10-27T06:16:07-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 09:54:40", "publisher": "Zacks Investment Research", "title": "Is a Surprise Coming for Apple (AAPL) This Earnings Season?", "image": "https://images.financialmodelingprep.com/news/is-a-surprise-coming-for-apple-aapl-this-earnings-20211027.jpeg", "site": "zacks.com", "text": "Apple (AAPL) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season.", "url": "https://www.zacks.com/stock/news/1817385/is-a-surprise-coming-for-apple-aapl-this-earnings-season", "publishedDateET": "2021-10-27T05:54:40-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 08:43:00", "publisher": "Reuters", "title": "Amazon seen triumphing over Apple privacy changes in digital ad business", "image": "https://images.financialmodelingprep.com/news/amazon-seen-triumphing-over-apple-privacy-changes-in-digital-20211027.jpg", "site": "reuters.com", "text": "Amazon.com is expected to emerge as a winner in the digital advertising arena, surviving Apple's privacy changes better than rivals Facebook and Snap.", "url": "https://www.reuters.com/article/amazon-com-results-advertising/amazon-seen-triumphing-over-apple-privacy-changes-in-digital-ad-business-idUSKBN2HH1NO", "publishedDateET": "2021-10-27T04:43:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 08:05:00", "publisher": "Reuters", "title": "Apple adds suppliers to clean-energy pledge, including more chip firms", "image": "https://images.financialmodelingprep.com/news/apple-adds-suppliers-to-cleanenergy-pledge-including-more-chip-firms-20211027.jpg", "site": "reuters.com", "text": "Apple Inc said on Wednesday that 175 of its suppliers have now committed to use clean energy for the work they do for the iPhone maker, helping to bring more than 9 gigawatts of clean energy onto power grids.", "url": "https://www.reuters.com/article/apple-renewables/apple-adds-suppliers-to-clean-energy-pledge-including-more-chip-firms-idUSKBN2HH1JF", "publishedDateET": "2021-10-27T04:05:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 08:00:00", "publisher": "Business Wire", "title": "Apple Charges Forward to 2030 Carbon Neutral Goal, Adding 9 Gigawatts of Clean Power and Doubling Supplier Commitments", "image": "https://images.financialmodelingprep.com/news/apple-charges-forward-to-2030-carbon-neutral-goal-adding-20211027.jpg", "site": "businesswire.com", "text": "CUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced it has more than doubled the number of suppliers committed to using 100 percent clean energy over the last year, accelerating progress toward its ambitious 2030 goal to be carbon neutral across its supply chain and products. In total, 175 Apple suppliers will transition to using renewable energy, and the company and its suppliers will bring online more than 9 gigawatts of clean power around the world. These actions will avoid over 18 mi", "url": "https://www.businesswire.com/news/home/20211027005361/en/Apple-Charges-Forward-to-2030-Carbon-Neutral-Goal-Adding-9-Gigawatts-of-Clean-Power-and-Doubling-Supplier-Commitments/", "publishedDateET": "2021-10-27T04:00:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 08:00:00", "publisher": "Business Wire", "title": "Apple Charges Forward to 2030 Carbon Neutral Goal, Adding 9 Gigawatts of Clean Power and Doubling Supplier Commitments", "image": "https://images.financialmodelingprep.com/news/apple-charges-forward-to-2030-carbon-neutral-goal-adding-9-20211027.png", "site": "businesswire.com", "text": "CUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced it has more than doubled the number of suppliers committed to using 100 percent clean energy over the last year, accelerating progress toward its ambitious 2030 goal to be carbon neutral across its supply chain and products. In total, 175 Apple suppliers will transition to using renewable energy, and the company and its suppliers will bring online more than 9 gigawatts of clean power around the world. These actions will avoid over 18 million metric tons of CO2e annually — the equivalent of taking over 4 million cars off the road each year. The company added 10 new projects for its first-of-a-kind Power for Impact™ initiative to bring clean energy solutions to communities around the world. These projects are designed to provide renewable power to under-resourced communities while supporting economic growth and social impact. “Every company should be a part of the fight against climate change, and together with our suppliers and local communities, we’re demonstrating all of the opportunity and equity green innovation can bring,” said Tim Cook, Apple’s CEO. “We’re acting with urgency, and we’re acting together. But time is not a renewable resource, and we must act quickly to invest in a greener and more equitable future.” While Apple is already carbon neutral across its global operations, by 2030, every Apple device sold will have a net-zero climate impact. Since announcing this goal last year, the company has not only dramatically increased the number of its suppliers transitioning to renewable energy, but also expanded the amount of recycled material in its products and established new projects focused on environmental justice. In total, Apple has reduced its carbon emissions by 40 percent over the past five years. “For too long, the communities most impacted by climate change haven’t had a seat at the table. That has to change, and we’re committed to being part of that change,” said Lisa Jackson, Apple’s vice president of Environment, Policy, and Social Initiatives. “The new projects we’re sharing will help communities by developing new local renewable projects, creating a healthier and more equitable world while advancing the fight against climate change.” Supplier Momentum In the US, 19 suppliers in Apple’s Supplier Clean Energy Program, including Solvay, are scaling their use of renewable energy across their Apple operations, often going beyond their business with Apple. In Europe, 19 suppliers are now part of the program, including STMicroelectronics, which has started nine additional projects to deliver renewable energy for its broader operations since joining Apple’s program. In China, 50 suppliers are now part of the program, with many maximizing their use of on-site solutions. In India, Japan, and South Korea, 31 suppliers have joined, including SK Hynix, one of the first Korean suppliers to participate. Apple is also creating new pathways for the use of recycled materials while maintaining its high standards for sourcing, collaborating with suppliers to move toward a circular economy that eliminates the need for carbon-intensive mining and conserves resources. This includes recycled sources of gold, cobalt, aluminum, and rare earth elements, among other materials that are now part of Apple products. These advancements, along with suppliers transitioning to renewable energy, are reducing the environmental impact of the company’s products. Recent milestones include an 11 percent reduction in the carbon footprint of iPhone® 13 Pro and an eight percent reduction for the 16-inch MacBook Pro®, compared to previous generations. Supporting Communities Apple is also announcing support for 10 new renewable projects around the world through its Power for Impact program: In the United States, Apple will work with the Oceti Sakowin Power Authority, formed by six Sioux tribes to jointly develop tribal renewable energy resources by financing, developing, constructing, and operating power generation and transmission facilities for the wholesale market. This project is on track to create a large-scale wind power development in the Midwest, and follows the organization’s participation in Apple’s Impact Accelerator, part of the company’s Racial Equity and Justice Initiative. In South Africa, Apple is bringing renewable energy to over 3,500 households that previously lacked access. The company will also help reduce electricity costs for the Pioneer School for the Visually Impaired by funding rooftop solar installations. And in Nigeria, Apple will support the development of a solar power system to serve a primary healthcare center in the state of Ondo, as well as 200 households in the surrounding region. In the Philippines, Apple will help fund an educational institution that provides scholarships to high-achieving, under-resourced students by offsetting electricity expenses through a new rooftop solar installation. In Thailand, Apple is participating in an effort to increase renewable energy production and battery storage to ensure reliable access to electricity, and replacing the use of polluting diesel fuel for a remote fishing village that relies on refrigerators to maintain the quality of its fish products. Apple’s work to support a program in Vietnam will provide solar electricity for 20 schools around the country, and help teach thousands of children about sustainable development and STEM. In Colombia, Apple is helping to bring online a rooftop solar power system at the Santa Ana Hospital Infantil, and the money saved on energy bills will allow the hospital to purchase more equipment and medications. A rooftop solar installation at Ciudad Don Bosco, a nonprofit that provides educational and social services for under-resourced youth, will help the group advance its sustainable development goals. In Israel, Apple is supporting the Nitzana Educational Eco-Village for at-risk youth with solar installations to help lower electricity costs and generate a new source of revenue for the organization. Apple will continue to focus on communities most impacted by climate change as it pursues its environmental goals. For more information on the company’s environmental initiatives, visit apple.com/environment. To view the full list of suppliers participating in Apple’s Supplier Clean Energy Program, visit apple.com/environment/Apple_Supplier_Clean_Energy_Commitments_October-2021.pdf. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042. © 2021 Apple Inc. All rights reserved. Apple, the Apple logo, Power for Impact, iPhone, and MacBook Pro are trademarks of Apple. Other company and product names may be trademarks of their respective owners.", "url": "https://www.businesswire.com/news/home/20211027005361/en/Apple-Charges-Forward-to-2030-Carbon-Neutral-Goal-Adding-9-Gigawatts-of-Clean-Power-and-Doubling-Supplier-Commitments", "publishedDateET": "2021-10-27T04:00:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 07:00:15", "publisher": "Forbes", "title": "Should You Pick This At-Home Fitness Stock Over Apple?", "image": "https://images.financialmodelingprep.com/news/should-you-pick-this-athome-fitness-stock-over-apple-20211027.jpg", "site": "forbes.com", "text": "Mega-cap computing titan Apple (NASDAQ: AAPL) has also been looking to play a larger role in the fitness space with its wearables such as the Apple Watch and digital services such as Apple Fitness.", "url": "https://www.forbes.com/sites/greatspeculations/2021/10/27/should-you-pick-this-at-home-fitness-stock-over-apple/", "publishedDateET": "2021-10-27T03:00:15-04:00"}
{"symbol": "AAPL", "publishedDate": "2021-10-27 06:00:36", "publisher": "InvestorPlace", "title": "The Chip Crunch Won't Take a Big Bite Out of Apple", "image": "https://images.financialmodelingprep.com/news/the-chip-crunch-wont-take-a-big-bite-out-20211027.jpg", "site": "investorplace.com", "text": "As traders place their bets in anticipation of Apple's earnings release, AAPL stock might stumble briefly, but should recover quickly. The post The Chip Crunch Won't Take a Big Bite Out of Apple appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/10/chip-crunch-wont-take-a-big-bite-out-of-aapl-stock/", "publishedDateET": "2021-10-27T02:00:36-04:00"}
