{"symbol": "AAPL", "publishedDate": "2025-05-01 03:33:40", "publisher": "TechXplore", "title": "US judge says Apple defied order in App Store case", "image": "https://images.financialmodelingprep.com/news/us-judge-says-apple-defied-order-in-app-store-20250501.jpg", "site": "techxplore.com", "text": "A US judge on Wednesday accused Apple of defying an order to loosen its grip on the App Store payment system to the point that criminal charges could be warranted.", "url": "https://techxplore.com/news/2025-05-apple-defied-app-case.html", "publishedDateET": "2025-04-30T23:33:40-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-05-01 03:32:47", "publisher": "Proactive Investors", "title": "Apple shares fall after judge refers App Store case for possible criminal probe", "image": "https://images.financialmodelingprep.com/news/apple-shares-fall-after-judge-refers-app-store-case-20250501.jpg", "site": "proactiveinvestors.co.uk", "text": "Apple Inc's (NASDAQ:AAPL, ETR:APC) shares fell around 1.6% in after-hours trading on Wednesday after a US judge ruled the company had violated a court order relating to its App Store payments policy. The decision, in a long-running case brought by Fortnite maker Epic Games, referred Apple to federal prosecutors to consider a potential criminal contempt investigation.", "url": "https://www.proactiveinvestors.co.uk/companies/news/1070503", "publishedDateET": "2025-04-30T23:32:47-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-05-01 01:41:13", "publisher": "Invezz", "title": "Judge slams Apple on App Store fees, orders halt to outside commissions, refers case for criminal probe", "image": "https://images.financialmodelingprep.com/news/judge-slams-apple-on-app-store-fees-orders-halt-20250501.jpg", "site": "invezz.com", "text": "In a sharply critical ruling with potentially far-reaching consequences, a federal judge has found Apple Inc. in violation of a previous court order aimed at opening up its App Store to alternative payment methods.", "url": "https://invezz.com/news/2025/05/01/judge-slams-apple-on-app-store-fees-orders-halt-to-outside-commissions-refers-case-for-criminal-probe/", "publishedDateET": "2025-04-30T21:41:13-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-05-01 00:02:01", "publisher": "Business Insider", "title": "A judge found that an Apple executive 'outright lied under oath' in Epic Games case", "image": "https://images.financialmodelingprep.com/news/a-judge-found-that-an-apple-executive-outright-lied-20250501.jpg", "site": "businessinsider.com", "text": "A judge on Wednesday said that Apple was not complying with a 2021 injunction in the Epic Games case. Apple ignored a court order and an executive \"outright lied under oath,\" the judge wrote.", "url": "https://www.businessinsider.com/judge-finds-apple-executive-lied-under-oath-refers-criminal-investigation-2025-4", "publishedDateET": "2025-04-30T20:02:01-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 21:59:01", "publisher": "The Guardian", "title": "Apple referred to federal prosecutors after judge rules it violated court order", "image": "https://images.financialmodelingprep.com/news/apple-referred-to-federal-prosecutors-after-judge-rules-it-20250430.jpg", "site": "theguardian.com", "text": "Judge says executive told ‘outright lies' when he gave testimony in antitrust case from Fortnite maker Epic Games", "url": "https://www.theguardian.com/technology/2025/apr/30/apple-fortnite-court-order-violation", "publishedDateET": "2025-04-30T17:59:01-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 21:29:56", "publisher": "TechCrunch", "title": "Epic Games just scored a win against Apple", "image": "https://images.financialmodelingprep.com/news/epic-games-just-scored-a-win-against-apple-20250430.jpg", "site": "techcrunch.com", "text": "Epic Games notched a win in an ongoing legal dispute with Apple. The result could be Fortnite returning to the U.S. iOS app store as early as next week.", "url": "https://techcrunch.com/2025/04/30/epic-games-just-scored-a-win-against-apple/", "publishedDateET": "2025-04-30T17:29:56-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 20:39:40", "publisher": "NYTimes", "title": "Judge Rebukes Apple and Orders It to Loosen Grip on App Store", "image": "https://images.financialmodelingprep.com/news/judge-rebukes-apple-and-orders-it-to-loosen-grip-20250430.jpg", "site": "nytimes.com", "text": "The ruling was a stinging defeat for Apple in a long-running antitrust case brought by Epic Games, the maker of Fortnite, on behalf of app developers.", "url": "https://www.nytimes.com/2025/04/30/technology/apple-epic-app-store-ruling.html", "publishedDateET": "2025-04-30T16:39:40-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 20:32:00", "publisher": "Market Watch", "title": "Judge blasts Apple for violating App Store ruling. But these analysts aren't concerned.", "image": "https://images.financialmodelingprep.com/news/judge-blasts-apple-for-violating-app-store-ruling-but-20250430.jpg", "site": "marketwatch.com", "text": "Apple Inc. “outright lied” and willfully ignored an antitrust ruling to open up its App Store, a federal judge said late Wednesday as she blocked Apple from collecting new fees on certain purchases.", "url": "https://www.marketwatch.com/story/judge-blasts-apple-for-violating-app-store-ruling-but-these-analysts-arent-concerned-f6a9ab32", "publishedDateET": "2025-04-30T16:32:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 20:12:00", "publisher": "VentureBeat", "title": "Epic Games touts victory in latest court ruling in Apple antitrust case", "image": "https://images.financialmodelingprep.com/news/epic-games-touts-victory-in-latest-court-ruling-in-apple-20250430.jpg", "site": "venturebeat.com", "text": "A federal district court judge found that Apple willfully violated a court order in Epic Games vs. Apple antitrust case.", "url": "https://venturebeat.com/games/epic-games-touts-victory-in-latest-court-ruling-in-apple-antitrust-case/", "publishedDateET": "2025-04-30T16:12:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 19:44:00", "publisher": "WSJ", "title": "Apple Violated Antitrust Ruling, Federal Judge Finds", "image": "https://images.financialmodelingprep.com/news/apple-violated-antitrust-ruling-federal-judge-finds-20250430.jpg", "site": "wsj.com", "text": "A federal judge hammered Apple for violating a ruling in an antitrust case that required the company to loosen certain restrictions it imposes on software-makers in its App Store.", "url": "https://www.wsj.com/tech/apple-violated-antitrust-ruling-federal-judge-finds-66b85957", "publishedDateET": "2025-04-30T15:44:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 18:56:27", "publisher": "CNBC", "title": "Court finds Apple, executive lied under oath in Epic Games trial", "image": "https://images.financialmodelingprep.com/news/court-finds-apple-executive-lied-under-oath-in-epic-games-20250430.jpg", "site": "cnbc.com", "text": "Apple willfully violated and ignored a 2021 decision that came out of the Epic Games case, Judge Yvonne Gonzalez Rogers said in a decision on Wednesday. Rogers added that she referred the matter to U.S. attorneys to investigate whether to pursue criminal contempt proceedings on both Roman and Apple.", "url": "https://www.cnbc.com/2025/04/30/court-finds-apple-executive-lied-under-oath.html", "publishedDateET": "2025-04-30T14:56:27-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 18:41:43", "publisher": "Reuters", "title": "US judge rules Apple violated order to reform App Store", "image": "https://images.financialmodelingprep.com/news/us-judge-rules-apple-violated-order-to-reform-app-20250430.jpg", "site": "reuters.com", "text": "Apple violated a U.S. court order that required the iPhone maker to allow greater competition for app downloads and payment methods in its lucrative App Store and will be referred to federal prosecutors, a federal judge in California ruled on Wednesday.", "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-judge-rules-apple-violated-order-reform-app-store-2025-04-30/", "publishedDateET": "2025-04-30T14:41:43-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 17:19:31", "publisher": "CNBC Television", "title": "We're not expecting a good result or outlook from Apple's earnings, says D.A. Davidson's Gil Luria", "image": "https://images.financialmodelingprep.com/news/were-not-expecting-a-good-result-or-outlook-from-20250430.jpg", "site": "youtube.com", "text": "Gil Luria, D.A. Davidson managing director, joins 'Closing Bell: Overtime' to discuss the look ahead for Apple.", "url": "https://www.youtube.com/watch?v=u2JhjuLWsJo", "publishedDateET": "2025-04-30T13:19:31-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 14:01:17", "publisher": "TechCrunch", "title": "Apple notifies new victims of spyware attacks across the world", "image": "https://images.financialmodelingprep.com/news/apple-notifies-new-victims-of-spyware-attacks-across-the-20250430.jpg", "site": "techcrunch.com", "text": "Apple sent notifications this week to several people who the company believes were targeted with government spyware, according to two of the alleged targets.", "url": "https://techcrunch.com/2025/04/30/apple-notifies-new-victims-of-spyware-attacks-across-the-world/", "publishedDateET": "2025-04-30T10:01:17-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 13:15:33", "publisher": "Zacks Investment Research", "title": "Apple ETFs in Focus Ahead of Fiscal Q2 Earnings", "image": "https://images.financialmodelingprep.com/news/apple-etfs-in-focus-ahead-of-fiscal-q2-earnings-20250430.jpg", "site": "zacks.com", "text": "Apple sees positive earnings revision activity, which is generally a precursor to an earnings beat.", "url": "https://www.zacks.com/stock/news/2459317/apple-etfs-in-focus-ahead-of-fiscal-q2-earnings?cid=CS-STOCKNEWSAPI-FT-etf_news_and_commentary-2459317", "publishedDateET": "2025-04-30T09:15:33-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 12:20:39", "publisher": "Zacks Investment Research", "title": "Will Strong Services Offset Weak iPhone Sales for AAPL's Q2 Earnings?", "image": "https://images.financialmodelingprep.com/news/will-strong-services-offset-weak-iphone-sales-for-aapls-20250430.jpg", "site": "zacks.com", "text": "Apple's second-quarter fiscal 2025 results are expected to reflect the negative impacts of stiff competition for iPhone, despite continuing Services growth.", "url": "https://www.zacks.com/stock/news/2459205/will-strong-services-offset-weak-iphone-sales-for-aapl-s-q2-earnings?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_preview-2459205", "publishedDateET": "2025-04-30T08:20:39-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 12:15:31", "publisher": "Zacks Investment Research", "title": "Apple & Amazon Earnings: What Can Investors Expect?", "image": "https://images.financialmodelingprep.com/news/apple-amazon-earnings-what-can-investors-expect-20250430.jpg", "site": "zacks.com", "text": "Beloved Apple and Amazon are gearing up to reveal their next set of quarterly results, helping headline the reporting docket for this week.", "url": "https://www.zacks.com/commentary/2458520/apple-amazon-earnings-what-can-investors-expect?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2458520", "publishedDateET": "2025-04-30T08:15:31-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 12:05:47", "publisher": "247 Wallst", "title": "Live Nasdaq Composite: Markets Stand Still on Tariff and Tech Tussle", "image": "https://images.financialmodelingprep.com/news/live-nasdaq-composite-markets-stand-still-on-tariff-and-20250430.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Has Ended Trade Deals 3:06 pm by Gerelyn Terzo Commerce Secretary Howard Lutnick reportedly revealed that the U.S. has secured one trade deal, keeping most of the details close to the vest except to say that the White House is awaiting a green light from some unnamed country. The Dow Jones Industrial Average rose as much as 300 points in response for a 0.84% gain, while the Nasdaq Composite and S&amp;P 500 are holding similar gains. Narrow Range 12:34 pm by Gerelyn Terzo The markets are managing slight gains across the Nasdaq Composite, S&amp;P 500 and Dow Jones Industrial Average despite the absence of greater details on any global trade deals. Of the S&amp;P 500, Baird investment strategist Ross Mayfield is cited by CNBC as saying, “I think [stocks are] probably trapped in a in a pretty tight range here,&#8221; pointing to a range of 5,100-5,700. “I think we can bounce around there for quite a while in kind of some volatile, choppy trading. Until we get some resolution on the trade front, I don’t think much else matters,&#8221; he added. Consumer Weakness 11:03 am by Gerelyn Terzo The stock market averages are currently all moving higher despite some weaker than anticipated economic data. The U.S. consumer has long been credited with upholding the economy throughout the one-two punch of inflation and higher interest rates. Now the tariffs could be the straw that broke the camel&#8217;s back, as consumer confidence shows signs of waning. The Consumer Confidence Index published by the Conference Board sank to a reading of 86 in April, a drop of nearly 8 points from the prior month and below economist estimates calling for 87.7. A separate index that reflects consumer sentiment over the next six months fell by a steep 12.5 points to a reading of 54.4, its worst level in over a decade. The Bureau of Labor Statistics revealed that March job postings dropped to their lowest level in about six months. Tariffs, Earnings and Tech 10:00 am by Gerelyn Terzo The markets continue to trade mixed this morning on tariff deal ambiguity as Q1 earnings results pour in. Stocks are weighing earnings results and a lack of certainty on the tariff deal front while tensions have emerged between Amazon (Nasdaq: AMZN) and the White House over tariff-related costs. Magnificent Seven stocks are mixed, with Amazon and Alphabet (Nasdaq: GOOGL) trading in the red while Nvidia (Nasdaq: NVDA) benefits from a Wall Street endorsement. Hims &amp; Hers HEalth (Nasdaq: HIMS) is soaring by 24% today on news of a deal to sell weight loss drug phenom Wegovy on its e-commerce platform. The markets are holding out for more tariff deal progress, digging in their heels and nearly standing still in the meantime. The three major stock market averages are moving fractionally in either direction, with the Nasdaq Composite posting slight declines alongside the S&amp;P 500 while the Dow Jones Industrial Average is eking out modest gains. Sectors of the economy are evenly split between red and green, with real estate moving higher and consumer discretionary stocks headed lower. Amazon (Nasdaq: AMZN) is getting some unwanted attention after the White House took aim at the tech giant, calling its reported plans to list tariff cost impacts on its site as a &#8220;hostile and political act.&#8221; Big 3 automaker General Motors (NYSE: GM) reported better-than-expected quarterly results while reassessing its full-year outlook, sending the stock lower by 1.5%. GM and the auto sector have targets on their backs at the height of the tariff wars, in response to which the former Dow component has suspended all share buyback programs. The White House has affirmed its plans to provide tariff relief to the auto sector. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Up 138.11 (+0.36%) Nasdaq Composite: Down 67.15 (-0.40%) S&amp;P 500: Down 10.23 (-0.19%) Earnings &amp; Analyst Calls Coca-Cola (NYSE: KO) surpassed Q1 expectations on the top and bottom lines and is keeping its full-year guidance intact amid expectations that it will be able to manage any tariff-related fallout, including rising aluminum costs. Rival company PepsiCo (NYSE: PEP) recently lowered its earnings forecast due to the tariff impact. Evercore ISI has reiterated its &#8220;outperform&#8221; rating on Apple (Nasdaq: AAPL) stock with a $250 price target, suggesting the company&#8217;s strategies should help it to offset any impact from the tariff frenzy. Piper Sandler has reiterated its &#8220;overweight&#8221; rating on Nvidia (Nasdaq: NVDA), saying that the China tariff uncertainties notwithstanding, the AI leader&#8217;s strong market relationships give the stock a place in the analyst firm&#8217;s top large cap pick universe. UBS has reiterated its &#8220;buy&#8221; rating on Amazon (Nasdaq: AMZN) but lowered the price target to $253 from $272, owing to what it described as &#8220;potential demand destruction.&#8221; The post Live Nasdaq Composite: Markets Stand Still on Tariff and Tech Tussle appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/04/29/live-nasdaq-composite-markets-stand-still-on-tariff-and-tech-tussle/", "publishedDateET": "2025-04-30T08:05:47-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 12:05:47", "publisher": "247 Wallst", "title": "Warren Buffett Sees Right Through Trump’s Tariffs", "image": "https://images.financialmodelingprep.com/news/warren-buffett-sees-right-through-trumps-tariffs-20250430.jpg", "site": "https://247wallst.com", "text": "24/7 Wall St. Key Points: Warren Buffett&#8217;s investment philosophy emphasizes long-term holdings in companies with strong competitive moats, such as Coca-Cola (NYSE: KO), American Express (NYSE: AXP), and Apple (NASDAQ: AAPL) Buffett prioritizes corporate reputation above short-term financial losses, reinforcing his long-term, trust-based approach to managing Berkshire Hathaway (NYSE: BRK.B). Berkshire Hathaway has outperformed the broader market in recent years, maintaining gains even during downturns, underscoring the resilience of Buffett&#8217;s strategy. Are you ahead, or behind on retirement? SmartAsset&#8217;s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don&#8217;t waste another minute; get started by clicking here.(Sponsor) Watch the Video https://videos.247wallst.com/247wallst.com/2025/04/3-Warren-Buffett-Sees-Right-Through-Trumps-Tariffs.mp4 Transcript: [00:00:04] Doug McIntyre: Yesterday I was on YouTube, which I shouldn&#8217;t be on, but I want it all the time. [00:00:10] Doug McIntyre: And, Charlie Munger was on there giving dishing out advice. Warren Buffett&#8217;s partner, who&#8217;s I think been probably dead a year. but everybody in the industry has a favorite Charlie Munger quote or Warren Buffett quote. what are some of the Buffett quotes that you love? [00:00:29] Lee Jackson: Well, one of the favorite, and we often, include this when we write on Buffett, is his favorite holding time for an S&amp;P 500 stock is forever. [00:00:41] Lee Jackson: And as you and I both know, that&#8217;s the case with names that he&#8217;s had like Coca-Cola. And somebody American Express that he&#8217;s had for 10, 15, 20 years. And I always thought that was a great quote. My, my favorite holding time is forever. And I think one of the most interesting quotes recently, and he kind of stayed out. [00:01:04] Lee Jackson: He says even though he kind of tends to vote Democrat, he stays outta the political fray for the most part. But he started talking about tariffs, and he was basically getting into the whole point of tariffs are basically attacked and they&#8217;re just attacks on goods. And the quote that I loved when he goes the tooth fairy isn&#8217;t gonna pay that tax. [00:01:29] Lee Jackson: And I&#8217;m like, okay, probably not. But, when you have a guy like that who&#8217;s so widely followed and so widely recognized, as likely the greatest investor of the last 50 or 60 years, he is gonna be a quotable guy. We&#8217;ve constantly written about him. And the interesting thing for our viewers and of course our 24 7 readers, is that even though the markets have come back some from the lows, Berkshire Hathaway has been up all year long. And even when the markets were down at bare lows, 20% lows, it was still up 9% for the year. So, yeah, I think the best holding time is forever for an S&amp;P 500 stock. [00:02:15] Doug McIntyre: Well, one of the reasons I love that quote is. It&#8217;s because he likes stocks with a moats. There&#8217;s, when he goes into one of these stocks, I think the first thing he looks at, other than obviously earnings, is how hard is it for somebody else to get into this business? Right? Do you want try to compete with Coke from scratch? [00:02:38] Doug McIntyre: Impossible, absolutely impossible. American from scratch. A big oil company from scratch. Impossible. He held, he still holds Apple, but I mean, he bought a whole bunch of it. You wanna try to compete with Apple from scratch. He loves these companies where he knows that the chances that somebody can come in and compete with directly with him is very low. [00:03:04] Doug McIntyre: I mean, he&#8217;s in the railroad business. It used to be public now, he just decided he is gonna take the whole thing private. But it&#8217;s the same philosophy. Do you wanna try to compete with, are you gonna build the tracks, buy the engines, hire the answer is no. So my favorite Buffett quote, and I won&#8217;t get this exactly right, is every two years he sends out the managers of all of his companies a letter, and he says, it&#8217;s okay if you lose money. [00:03:33] Doug McIntyre: We can afford to lose money. Obviously I don&#8217;t want you to lose it forever. but we can&#8217;t afford to lose a shred of reputation. He said, I absolutely money that&#8217;s fixable. But the day, and he said, I wanna make sure that a fair but unfriendly reporter can do a story about us on the front of the Wall Street Journal and our reputation will be intact. [00:03:59] Doug McIntyre: Yeah. That&#8217;s another thing Buffett understands is that, and one of the great examples is Johnson and Johnson (NYSE: JNJ), when there was that scare about Advil. Right. Okay. That was a long time ago, but you remember, Burke, who was the CEO then took every single bottle off every single shelf of cattle in the country. [00:04:22] Doug McIntyre: And you talk about reputation protection, and I mean, that&#8217;s one of Buffett&#8217;s philosophies is its reputation. [00:04:31] Lee Jackson: Well, and I think, are you sure you don&#8217;t mean the Tylenol scare? Was it Tylenol or Advil? Tylenol. It was Tylenol, and at first you&#8217;re right about Advil, they did pull that a few years back on concerns over liver toxicity. [00:04:47] Lee Jackson: But the one you remember is when J&amp;J, Tylenol&#8217;s owned now by Kenvue, which was the spinoff in 23 from J&amp;J. But when that all happened, and gosh, that&#8217;s been 30, 40 years ago. Yeah, it was in the eighties, I think. But you&#8217;re right, they took every single bottle of Tylenol and it was all taken off the market because people died. And, yeah, that&#8217;s the way you save your rep. [00:05:16] Lee Jackson: And not that Johnson and Johnson hasn&#8217;t had enough issues with the baby powder and the talcum powder and all that stuff. They&#8217;re fixing to have to, they&#8217;re trying to get that settled out. [00:05:26] Doug McIntyre: Yeah. Anyway, Buffett number one, hold my stocks forever. Number two, reputation, [00:05:34] Lee Jackson: And number three, tariffs are nothing more than a tax, and they&#8217;re not paid for by the tooth fairy. [00:05:40] Doug McIntyre: Yeah. And the tax thing is absolutely right. The post Warren Buffett Sees Right Through Trump&#8217;s Tariffs appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/04/29/warren-buffett-sees-right-through-trumps-tariffs/", "publishedDateET": "2025-04-30T08:05:47-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 11:35:30", "publisher": "Zacks Investment Research", "title": "Magnificent 7 Earnings: What to Expect (AMZN, AAPL, META and MSFT)", "image": "https://images.financialmodelingprep.com/news/magnificent-7-earnings-what-to-expect-amzn-aapl-meta-20250430.jpg", "site": "zacks.com", "text": "The tech giants are back in focus as earnings season kicks into high gear. Microsoft ( MSFT ), Meta Platforms ( META ), Apple ( AAPL ), and Amazon ( AMZN ), four pillars of the “Magnificent 7,” are set to report results this week, and the stakes couldn't be higher.", "url": "https://www.zacks.com/commentary/2459147/magnificent-7-earnings-what-to-expect-amzn-aapl-meta-and-msft?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2459147", "publishedDateET": "2025-04-30T07:35:30-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 10:39:00", "publisher": "Market Watch", "title": "As Apple reports earnings, here's why $200 is a key stock price to watch", "image": "https://images.financialmodelingprep.com/news/as-apple-reports-earnings-heres-why-200-is-a-20250430.jpg", "site": "marketwatch.com", "text": "Apple Inc. has been caught in the crossfire of a trade war, and heading into earnings, its stock now trades just above a key level.", "url": "https://www.marketwatch.com/story/as-apple-reports-earnings-heres-why-200-is-a-key-stock-price-to-watch-c58a859f", "publishedDateET": "2025-04-30T06:39:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 09:08:46", "publisher": "24/7 Wall Street", "title": "Here's the Only Magnificent 7 Stock I'd Buy Right Now", "image": "https://images.financialmodelingprep.com/news/heres-the-only-magnificent-7-stock-id-buy-right-20250430.jpg", "site": "247wallst.com", "text": "The Magnificent Seven trade has faltered so far this year. And while the cohort is in recovery mode, I think investors should insist on the better members of the cohort that even Jim Cramer thinks ought to be scrapped.", "url": "https://247wallst.com/investing/2025/04/30/heres-the-only-magnificent-7-stock-id-buy-right-now/", "publishedDateET": "2025-04-30T05:08:46-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 08:39:02", "publisher": "Benzinga", "title": "Qualcomm Stock Momentum Faces A Midweek Stress Test — Apple, Tariffs To Blame?", "image": "https://images.financialmodelingprep.com/news/qualcomm-stock-momentum-faces-a-midweek-stress-test-apple-tariffs-20250430.jpg", "site": "benzinga.com", "text": "Qualcomm Inc. QCOM will report its second-quarter earnings on Wednesday. As the company reports after market hours, Wall Street expects $2.81 in EPS and $10.65 billion in revenues.", "url": "https://www.benzinga.com/25/04/45098749/qualcomm-stock-momentum-faces-a-midweek-stress-test-apple-tariffs-to-blame", "publishedDateET": "2025-04-30T04:39:02-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 08:00:01", "publisher": "CNBC", "title": "Wall Street is anxious to hear Apple CEO Tim Cook's first public comments on tariffs", "image": "https://images.financialmodelingprep.com/news/wall-street-is-anxious-to-hear-apple-ceo-tim-20250430.jpg", "site": "cnbc.com", "text": "The most anticipated part of Apple's Thursday earnings will be CEO Tim Cook's comments on how the company is dealing with President Donald Trump's tariffs. Apple is perhaps the highest-profile example of a company that's gotten caught up in Trump's trade war.", "url": "https://www.cnbc.com/2025/04/30/wall-street-is-anticipating-tim-cooks-first-comments-on-tariffs.html", "publishedDateET": "2025-04-30T04:00:01-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 07:30:00", "publisher": "Accesswire", "title": "Levi & Korsinsky Reminds Shareholders of an Investigation into Apple Inc. (AAPL) Regarding Potential Securities Fraud Allegations", "image": "https://images.financialmodelingprep.com/news/levi-korsinsky-reminds-shareholders-of-an-investigation-into-apple-20250430.jpg", "site": "accessnewswire.com", "text": "NEW YORK, NY / ACCESS Newswire / April 30, 2025 / Levi & Korsinsky notifies investors that it has commenced an investigation of Apple Inc. (\"Apple Inc.\") (NASDAQ:AAPL) concerning possible violations of federal securities laws. Apple announced its upcoming release of the new iPhone 16 and 16 Plus models on June 10, 2024.", "url": "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/levi-and-korsinsky-reminds-shareholders-of-an-investigation-into-1021665", "publishedDateET": "2025-04-30T03:30:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 06:12:00", "publisher": "The Motley Fool", "title": "Prediction: 1 Stock That'll Be Worth More Than Apple a Year From Now", "image": "https://images.financialmodelingprep.com/news/prediction-1-stock-thatll-be-worth-more-than-apple-20250430.jpg", "site": "fool.com", "text": "Apple (AAPL 0.60%) is the largest company in the world with a market cap of $3.1 trillion, reaching this position thanks to robust demand for its consumer electronics products such as the iPhone, MacBooks, and iPads, among others.", "url": "https://www.fool.com/investing/2025/04/30/prediction-1-stock-thatll-be-worth-more-than-apple/", "publishedDateET": "2025-04-30T02:12:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-04-30 06:08:34", "publisher": "Reuters", "title": "Tarnished Magnificent 7 stocks rebound faces test with earnings", "image": "https://images.financialmodelingprep.com/news/tarnished-magnificent-7-stocks-rebound-faces-test-with-earnings-20250430.jpg", "site": "reuters.com", "text": "The U.S. technology and growth stocks known as the \"Magnificent Seven\" have regained their footing somewhat after a steep slide, but a few weeks of growing valuations and a dimming earnings edge could make it harder for them to push Wall Street higher.", "url": "https://www.reuters.com/business/autos-transportation/tarnished-magnificent-7-stocks-rebound-faces-test-with-earnings-2025-04-30/", "publishedDateET": "2025-04-30T02:08:34-04:00"}
