{"symbol": "AAPL", "publishedDate": "2022-04-27 19:03:37", "publisher": "CNN", "title": "Apple will now sell you parts to fix your own iPhone", "image": "https://images.financialmodelingprep.com/news/apple-will-now-sell-you-parts-to-fix-your-20220427.jpg", "site": "cnn.com", "text": "Apple has officially opened its self service repair store, which provides manuals and parts for users seeking do-it-yourself fixes for their iPhones.", "url": "https://www.cnn.com/2022/04/27/tech/apple-self-service-repair/index.html", "publishedDateET": "2022-04-27T15:03:37-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 18:19:07", "publisher": "Zacks Investment Research", "title": "Looking To Snap Downtrend, Can Amazon Deliver Results in Q1?", "image": "https://images.financialmodelingprep.com/news/looking-to-snap-downtrend-can-amazon-deliver-results-in-20220427.jpg", "site": "zacks.com", "text": "It's been a red year for tech. However, it's been an even tougher stretch for Amazon shares.", "url": "https://www.zacks.com/commentary/1909525/looking-to-snap-downtrend-can-amazon-deliver-results-in-q1", "publishedDateET": "2022-04-27T14:19:07-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 18:18:26", "publisher": "GuruFocus", "title": "5 Quality Stocks With High GF Scores and Momentum", "image": "https://images.financialmodelingprep.com/news/5-quality-stocks-with-high-gf-scores-and-momentum-20220427.jpg", "site": "gurufocus.com", "text": "In light of U.S. markets gyrating up and down during the final week of April, five high-quality stocks with high GF Scores and momentum ranks include Apple Inc. ( AAPL , Financial), Alphabet Inc. ( GOOGL , Financial)( GOOG , Financial), Amphenol Corp. ( APH , Financial), Fastenal Co. ( FAST , Financial) and Edwards Lifesciences Corp. ( EW , Financial) according to the All-in-One Screener, a Premium feature of GuruFocus.", "url": "https://www.gurufocus.com/news/1697622/5-quality-stocks-with-high-gf-scores-and-momentum", "publishedDateET": "2022-04-27T14:18:26-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 14:29:00", "publisher": "Reuters", "title": "Apple's main investor concern this quarter: demand", "image": "https://images.financialmodelingprep.com/news/apples-main-investor-concern-this-quarter-demand-20220427.jpg", "site": "reuters.com", "text": "Apple Inc investors have for years cheered investments to expand its supply chain to meet feverish global demand for iPhone and MacBooks. Now, the question is whether the company can sell everything it made.", "url": "https://www.reuters.com/technology/apples-main-investor-concern-this-quarter-demand-2022-04-27/", "publishedDateET": "2022-04-27T10:29:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 14:07:51", "publisher": "InvestorPlace", "title": "Tech Stocks Are Key to Win Big in the Bear Market", "image": "https://images.financialmodelingprep.com/news/tech-stocks-are-key-to-win-big-in-the-20220427.jpg", "site": "investorplace.com", "text": "Buying tech stocks as soon as they enter a bear market is key to win big. Over the past few decades, every time the Nasdaq reached that territory, it bounced back quickly and with vigor.", "url": "https://investorplace.com/hypergrowthinvesting/2022/04/tech-stocks-are-key-to-win-big-in-the-bear-market/", "publishedDateET": "2022-04-27T10:07:51-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 13:48:19", "publisher": "Zacks Investment Research", "title": "Can Continued Services Growth Aid Apple's (AAPL) Q2 Earnings?", "image": "https://images.financialmodelingprep.com/news/can-continued-services-growth-aid-apples-aapl-q2-earnings-20220427.jpg", "site": "zacks.com", "text": "Apple's (AAPL) second-quarter fiscal 2022 results are expected to reflect expanding Services business as well as solid Mac sales.", "url": "https://www.zacks.com/stock/news/1909357/can-continued-services-growth-aid-apple-s-aapl-q2-earnings", "publishedDateET": "2022-04-27T09:48:19-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 13:28:45", "publisher": "InvestorPlace", "title": "Should You Buy Apple Stock in Advance of the Company's Q2 Earnings?", "image": "https://images.financialmodelingprep.com/news/should-you-buy-apple-stock-in-advance-of-the-companys-20220427.jpg", "site": "investorplace.com", "text": "Apple reports its Q2 earnings on April 28. With AAPL stock down 13% this year, buy now in anticipation of another record quarter.", "url": "https://investorplace.com/2022/04/aapl-stock-should-you-buy-apple-ahead-of-q2-earnings/", "publishedDateET": "2022-04-27T09:28:45-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 12:48:48", "publisher": "Invezz", "title": "Famed Apple analyst: ‘worst is yet to come for tech stocks'", "image": "https://images.financialmodelingprep.com/news/famed-apple-analyst-worst-is-yet-to-come-for-20220427.jpg", "site": "invezz.com", "text": "The Nasdaq 100 index is down 20% for the year but a prominent Apple Inc (NASADQ: AAPL) analyst warns the worst is yet to come for the tech stocks. Ming-Chi Kuo's outlook on big cap tech In his recent tweet, Taiwan-based Ming-Chi Kuo said no on seems to care about big tech earnings anymore.", "url": "https://invezz.com/news/2022/04/27/famed-apple-analyst-worst-is-yet-to-come-for-tech-stocks/", "publishedDateET": "2022-04-27T08:48:48-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 11:01:14", "publisher": "InvestorPlace", "title": "Wait for Post-Earnings Weakness to Buy Apple", "image": "https://images.financialmodelingprep.com/news/wait-for-postearnings-weakness-to-buy-apple-20220427.jpg", "site": "investorplace.com", "text": "Apple reports earnings this afternoon, and several factors from the quarter could easily push down AAPL stock. The post Wait for Post-Earnings Weakness to Buy Apple appeared first on InvestorPlace.", "url": "https://investorplace.com/2022/04/wait-for-post-earnings-weakness-to-buy-apple/", "publishedDateET": "2022-04-27T07:01:14-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 10:03:00", "publisher": "Market Watch", "title": "Deep Dive: Warren Buffett and Berkshire Hathaway are once again outperforming the stock market. Apple is one big reason but these other 10 stocks also helped", "image": "https://images.financialmodelingprep.com/news/deep-dive-warren-buffett-and-berkshire-hathaway-are-once-20220427.jpg", "site": "marketwatch.com", "text": "During the long, tech-driven bull market, you may have seen more than one article suggesting Berkshire Hathaway CEO Warren Buffett's investing style was no longer valid.", "url": "https://www.marketwatch.com/story/warren-buffett-and-berkshire-hathaway-are-once-again-outperforming-the-stock-market-apple-is-one-big-reason-but-these-other-10-stocks-also-helped-11651068182", "publishedDateET": "2022-04-27T06:03:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 08:44:34", "publisher": "CNBC", "title": "Apple now lets you parts so you can fix your iPhone yourself", "image": "https://images.financialmodelingprep.com/news/apple-now-lets-you-parts-so-you-can-fix-20220427.jpg", "site": "cnbc.com", "text": "Apple's new Self Service Repair program will offer more than 200 parts and tools customers can use to repair certain iPhones.", "url": "https://www.cnbc.com/2022/04/27/apple-now-lets-you-buy-iphone-parts-so-you-can-fix-it-yourself.html", "publishedDateET": "2022-04-27T04:44:34-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 08:00:09", "publisher": "TechCrunch", "title": "Apple opens Self Service Repair to US iPhone users", "image": "https://images.financialmodelingprep.com/news/apple-opens-self-service-repair-to-us-iphone-users-20220427.jpeg", "site": "techcrunch.com", "text": "I've been covering Apple in various capacities for a long time now. Over the years, I don't know that I've seen an announcement from the company as unexpected and warmly received as Self Service Repair.", "url": "https://techcrunch.com/2022/04/27/apple-opens-self-service-repair-to-us-iphone-users/", "publishedDateET": "2022-04-27T04:00:09-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 08:00:00", "publisher": "Business Wire", "title": "Apple's Self Service Repair Now Available", "image": "https://images.financialmodelingprep.com/news/apples-self-service-repair-now-available-20220427.jpg", "site": "businesswire.com", "text": "CUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced Self Service Repair is now available, providing repair manuals and genuine Apple parts and tools through the Apple Self Service Repair Store. Self Service Repair is available in the US and will expand to additional countries — beginning in Europe — later this year. The new online store offers more than 200 individual parts and tools, enabling customers who are experienced with the complexities of repairing electronic devices to complete", "url": "https://www.businesswire.com/news/home/20220427005399/en/Apple%E2%80%99s-Self-Service-Repair-Now-Available/", "publishedDateET": "2022-04-27T04:00:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 08:00:00", "publisher": "Business Wire", "title": "Apple’s Self Service Repair Now Available", "image": "https://images.financialmodelingprep.com/news/apples-self-service-repair-now-available-20220427.png", "site": "businesswire.com", "text": "CUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced Self Service Repair is now available, providing repair manuals and genuine Apple parts and tools through the Apple Self Service Repair Store. Self Service Repair is available in the US and will expand to additional countries — beginning in Europe — later this year. The new online store offers more than 200 individual parts and tools, enabling customers who are experienced with the complexities of repairing electronic devices to complete repairs on the iPhone® 12 and iPhone 13 lineups and iPhone SE (3rd generation), such as the display, battery, and camera. Later this year the program will also include manuals, parts, and tools to perform repairs on Mac® computers with Apple silicon. To start the Self Service Repair process, a customer will first review the repair manual for the product they want to repair by visiting support.apple.com/self-service-repair. Then, they can visit the Apple Self Service Repair Store and order the necessary parts and tools. Every genuine Apple part is designed and engineered for each product, and goes through extensive testing to ensure the highest quality, safety, and reliability. The parts are the same ones — at the same price — as those available to Apple’s network of authorized repair providers. For certain repairs, customers will receive a credit when returning a replaced part for recycling. The Apple tools available to customers on the Self Service Repair Store are the same as used by Apple’s repair network. They are custom designed to help provide the best repairs for Apple products, and are engineered to withstand the rigors of high-volume, professional repair operations where safety and reliability are the utmost priority. The high-quality tools offered through Self Service Repair include torque drivers, repair trays, display and battery presses, and more. Apple will offer tool rental kits for $49, so that customers who do not want to purchase tools for a single repair still have access to these professional repair tools. The weeklong rental kits will ship to customers for free. Self Service Repair is part of Apple’s efforts to further expand access to repairs. For the vast majority of customers who do not have experience repairing electronic devices, visiting a professional repair provider with certified technicians who use genuine Apple parts is the safest and most reliable way to get a repair. Over the past three years, Apple has nearly doubled the number of service locations with access to genuine Apple parts, tools, and training, including more than 3,000 Independent Repair Providers. A global network of more than 5,000 Apple Authorized Service Providers supports more than 100,000 active technicians. As a result, in the US, eight out of 10 Apple customers are located within 20 minutes of an authorized service provider. Also today, Apple published a paper, “Expanding Access to Safe, Reliable, and Secure Service and Repair,” which details Apple’s approach to designing long-lasting products and increasing access to repairs. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. NOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or call Apple’s Media Helpline at (408) 974-2042. © 2022 Apple Inc. All rights reserved. Apple, iPhone, Mac, and the Apple logo are trademarks of Apple. Other company and product names may be trademarks of their respective owners.", "url": "https://www.businesswire.com/news/home/20220427005399/en/Apple%E2%80%99s-Self-Service-Repair-Now-Available", "publishedDateET": "2022-04-27T04:00:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 07:51:32", "publisher": "Seeking Alpha", "title": "Apple: Best Bet For Institutional Investors, Maybe Not So Now For Individual Investors", "image": "https://images.financialmodelingprep.com/news/apple-best-bet-for-institutional-investors-maybe-not-so-20220427.jpg", "site": "seekingalpha.com", "text": "Technology investments gravitate to diversity of product lines. They draw lots of media ink and pixels attracting attention to “new” ideas which Apple does very well. Information technology breeds endless demand for another profitable resource requiring equipment support less recognized by individual investors – data storage.", "url": "https://seekingalpha.com/article/4503918-apple-best-institutional-not-individual-investors", "publishedDateET": "2022-04-27T03:51:32-04:00"}
{"symbol": "AAPL", "publishedDate": "2022-04-27 06:40:00", "publisher": "The Motley Fool", "title": "1 Surprising Key to Apple's Stock Returns", "image": "https://images.financialmodelingprep.com/news/1-surprising-key-to-apples-stock-returns-20220427.jpg", "site": "fool.com", "text": "The upcoming earnings report should indicate if it will continue.", "url": "https://www.fool.com/investing/2022/04/27/1-surprising-key-to-apples-stock-returns/", "publishedDateET": "2022-04-27T02:40:00-04:00"}
