{"symbol": "AAPL", "publishedDate": "2025-08-02 01:19:42", "publisher": "Seeking Alpha", "title": "Dividend Champion, Contender, And Challenger Highlights: Week Of August 3", "image": "https://images.financialmodelingprep.com/news/dividend-champion-contender-and-challenger-highlights-week-of-august-20250802.jpg", "site": "seekingalpha.com", "text": "A weekly summary of dividend activity for Dividend Champions, Contenders, and Challengers. Companies which changed their dividends. Companies with upcoming ex-dividend dates.", "url": "https://seekingalpha.com/article/4808011-dividend-champion-contender-challenger-highlights-week-of-august-3", "publishedDateET": "2025-08-01T21:19:42-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 16:06:34", "publisher": "Schwab Network", "title": "A.I. the Big Story in Big Tech: MSFT, AAPL Earnings Paint Different Picture", "image": "https://images.financialmodelingprep.com/news/ai-the-big-story-in-big-tech-msft-aapl-earnings-20250801.jpg", "site": "youtube.com", "text": "Daniel Rubino (@WindowsCentral) dives into this week's big tech earnings and says Microsoft (MSFT) displayed a strong position for future A.I. growth. He says the breakout Azure numbers show \"confidence\" from the company's leadership as it attempts to gain market share against Amazon's AWS.", "url": "https://www.youtube.com/watch?v=bdbdbqdJaf0", "publishedDateET": "2025-08-01T12:06:34-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 16:02:15", "publisher": "CNBC Television", "title": "Apple's forecast and margins were strong despite pull-forward, says Morgan Stanley's Erik Woodring", "image": "https://images.financialmodelingprep.com/news/apples-forecast-and-margins-were-strong-despite-pullforward-says-morgan-20250801.jpg", "site": "youtube.com", "text": "Erik Woodring, Morgan Stanley head of US technology hardware research, joins 'Power Lunch' to discuss why Apple's stock is reacting the way it is, Tim Cook's potential acquisition prospects and much more.", "url": "https://www.youtube.com/watch?v=tbWqC2GxsD0", "publishedDateET": "2025-08-01T12:02:15-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 14:58:11", "publisher": "Bloomberg Technology", "title": "Apple Growth Rebounds as Tariffs Loom: T. Rowe Price", "image": "https://images.financialmodelingprep.com/news/apple-growth-rebounds-as-tariffs-loom-t-rowe-price-20250801.jpg", "site": "youtube.com", "text": "T. Rowe Price portfolio manager Tony Wang says investors are focusing on Apple's forward outlook, particularly its plans for foldables and the next iPhone cycle. Wang joins Caroline Hyde and Ed Ludlow on \"Bloomberg Tech.", "url": "https://www.youtube.com/watch?v=iNyion_ya6U", "publishedDateET": "2025-08-01T10:58:11-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 14:11:04", "publisher": "Zacks Investment Research", "title": "Apple Q3 Earnings Beat Estimates, Services Drive Top-Line Growth", "image": "https://images.financialmodelingprep.com/news/apple-q3-earnings-beat-estimates-services-drive-topline-growth-20250801.jpg", "site": "zacks.com", "text": "AAPL's third-quarter fiscal 2025 results benefit from strong services growth and an increase in iPhone and Mac sales.", "url": "https://www.zacks.com/stock/news/2650311/apple-q3-earnings-beat-estimates-services-drive-top-line-growth?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_article-2650311", "publishedDateET": "2025-08-01T10:11:04-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 14:00:36", "publisher": "Schwab Network", "title": "Meyers: \"Really Never\" a Bad Time to Buy AAPL", "image": "https://images.financialmodelingprep.com/news/meyers-really-never-a-bad-time-to-buy-aapl-20250801.jpg", "site": "youtube.com", "text": "Jamie Meyers and Tyler Herriage break down Apple (AAPL) earnings. Tyler calls it a “strong quarter” and thinks the chart could be setting up for a “contrarian play” as it lags the rest of the Mag 7.", "url": "https://www.youtube.com/watch?v=_9EE7ZTJ2Uw", "publishedDateET": "2025-08-01T10:00:36-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 13:48:42", "publisher": "CNBC Television", "title": "Apple ups spending in hunt for AI turnaround", "image": "https://images.financialmodelingprep.com/news/apple-ups-spending-in-hunt-for-ai-turnaround-20250801.jpg", "site": "youtube.com", "text": "CNBC's Steve Kovach joins 'Money Movers' to discuss Apple looking to significantly increase spending on AI and spending across the sector.", "url": "https://www.youtube.com/watch?v=eA0LV3zWfSQ", "publishedDateET": "2025-08-01T09:48:42-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 13:25:46", "publisher": "Investopedia", "title": "What Analysts Are Saying About Apple's AI Ambitions After Strong Quarterly Results", "image": "https://images.financialmodelingprep.com/news/what-analysts-are-saying-about-apples-ai-ambitions-after-20250801.jpg", "site": "investopedia.com", "text": "Apple (AAPL) CEO Tim Cook made it clear that Apple is growing its AI investments, both in infrastructure and personnel, and multiple analysts raised their price target following the iPhone maker's quarterly results.", "url": "https://www.investopedia.com/what-analysts-are-saying-about-apples-ai-ambitions-after-strong-quarterly-results-11783365", "publishedDateET": "2025-08-01T09:25:46-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 13:12:32", "publisher": "CNBC Television", "title": "Trade Tracker: Bill Baruch buys more Apple", "image": "https://images.financialmodelingprep.com/news/trade-tracker-bill-baruch-buys-more-apple-20250801.jpg", "site": "youtube.com", "text": "Bill Baruch, founder and president at Blue Line Capital, joins CNBC's “Halftime Report” to detail his latest Apple add.", "url": "https://www.youtube.com/watch?v=SUyt1lsm6Uk", "publishedDateET": "2025-08-01T09:12:32-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 12:43:42", "publisher": "CNBC Television", "title": "CEO Tim Cook: Apple \"significantly increasing\" AI spend", "image": "https://images.financialmodelingprep.com/news/ceo-tim-cook-apple-significantly-increasing-ai-spend-20250801.jpg", "site": "youtube.com", "text": "CNBC's Steve Kovach joins 'Money Movers' to discuss Apple looking to significantly increase spending on AI and spending across the sector.", "url": "https://www.youtube.com/watch?v=8Utu56r_pZo", "publishedDateET": "2025-08-01T08:43:42-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 12:35:37", "publisher": "The Motley Fool", "title": "Why Shares of Apple Are Falling Today", "image": "https://images.financialmodelingprep.com/news/why-shares-of-apple-are-falling-today-20250801.jpg", "site": "fool.com", "text": "Shares of the iconic consumer tech giant Apple (AAPL -2.53%) were trading nearly 2% lower at 12:05 p.m. ET today, after the company reported earnings results for its third quarter of fiscal year 2025.", "url": "https://www.fool.com/investing/2025/08/01/why-shares-of-apple-are-falling-today/", "publishedDateET": "2025-08-01T08:35:37-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 12:08:26", "publisher": "Business Insider", "title": "Apple saw an 'unusual buying pattern' among US shoppers this year. Tim Cook explains what happened.", "image": "https://images.financialmodelingprep.com/news/apple-saw-an-unusual-buying-pattern-among-us-shoppers-20250801.jpg", "site": "businessinsider.com", "text": "Consumers rushed to buy iPhones and Macs in April due to fears of tariff-induced price hikes. The panic buying drove strong iPhone sales and pushed Apple's Q3 revenue to $94 billion.", "url": "https://www.businessinsider.com/apple-ceo-tim-cook-iphone-mac-sales-unusual-buying-pattern-2025-8", "publishedDateET": "2025-08-01T08:08:26-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:54:47", "publisher": "Seeking Alpha", "title": "Apple Q3/25: Very Good Results, But I'm Still Cautious", "image": "https://images.financialmodelingprep.com/news/apple-q325-very-good-results-but-im-still-cautious-20250801.jpg", "site": "seekingalpha.com", "text": "Apple delivered strong Q3/25 results, but some of the iPhone growth was driven by one-off tariff-related demand. I am concerned about iPhone sales plateauing, significant tariff headwinds, regulatory threats to services, and Apple's lack of new successful product platforms. Apple is lagging in AI, and its recent updates offer diminishing value.", "url": "https://seekingalpha.com/article/4807633-apple-q325-very-good-results-but-im-still-cautious", "publishedDateET": "2025-08-01T07:54:47-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:47:49", "publisher": "CNBC Television", "title": "Apple has time in tech race, but the clock is ticking, says Janus Henderson's Richard Clode", "image": "https://images.financialmodelingprep.com/news/apple-has-time-in-tech-race-but-the-clock-20250801.jpg", "site": "youtube.com", "text": "Richard Clode, Janus Henderson Investors portfolio manager, joins 'Money Movers' to discuss the 'Big Tech' sector earnings, Apple's outlook and CapEx spending.", "url": "https://www.youtube.com/watch?v=Cp_WOSWrI20", "publishedDateET": "2025-08-01T07:47:49-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:46:42", "publisher": "Benzinga", "title": "Apple Stock Reports 'Surprisingly Strong' Quarter: Analysts Say iPhone, Services Offset Tariff Concerns", "image": "https://images.financialmodelingprep.com/news/apple-stock-reports-surprisingly-strong-quarter-analysts-say-iphone-20250801.jpg", "site": "benzinga.com", "text": "Could Apple Inc.‘s AAPL surprise quarter be a turning point in the tech race, or is the giant simply playing catch-up with its AI-savvy rivals? Apple analysts highlight a better than expected quarter from the tech giant with third quarter results beating estimates and showing strength for products and services.", "url": "https://www.benzinga.com/analyst-stock-ratings/analyst-color/25/08/46800037/apple-stock-reports-surprisingly-strong-quarter-analysts-say-iphone-services-offset-tariff-concerns", "publishedDateET": "2025-08-01T07:46:42-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:40:36", "publisher": "Seeking Alpha", "title": "Apple Q3: Double-Digit Growth In Services Continues, Time To 'Buy' (Upgrade)", "image": "https://images.financialmodelingprep.com/news/apple-q3-doubledigit-growth-in-services-continues-time-to-20250801.jpg", "site": "seekingalpha.com", "text": "I am upgrading Apple Inc. to a buy with a $240 fair value, as China risks fade and AI progress gains focus. AAPL Q3 FY25 results showed strong 9.6% revenue and 12.2% EPS growth, with robust iPhone and double-digit services growth. Apple's expanding services ecosystem and upcoming AI-driven Siri enhancements will be key growth drivers moving forward.", "url": "https://seekingalpha.com/article/4807625-apple-q3-double-digit-growth-in-services-continues-time-to-buy-upgrade", "publishedDateET": "2025-08-01T07:40:36-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:11:05", "publisher": "Seeking Alpha", "title": "Apple: Growth, Buybacks, AI-Driven Upside", "image": "https://images.financialmodelingprep.com/news/apple-growth-buybacks-aidriven-upside-20250801.jpg", "site": "seekingalpha.com", "text": "Apple Inc.'s Q3 results beat expectations, driven by record Services revenue, now making up 29% of total revenue, and China-driven iPhone sales. Strong earnings and aggressive share buybacks make Apple highly attractive for capital returns. Apple is likely going on an AI-driven spending spree and could acquire AI startups in order to develop and build out its own AI software services.", "url": "https://seekingalpha.com/article/4807601-apple-growth-buybacks-ai-driven-upside", "publishedDateET": "2025-08-01T07:11:05-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:03:13", "publisher": "247 Wallst", "title": "Live: Cloudflare (NET) Jumps 5% After Beat & Raise", "image": "https://images.financialmodelingprep.com/news/live-cloudflare-net-jumps-5-after-beat-raise-20250801.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Has Ended 80% of Major AI Companies are Cloudflare Customers 5:52 pm That&#8217;s something CEO Matthew Prince just noted on today&#8217;s conference call. First Analyst Quote... 5:26 pm &#8220;Congratulations on a really solid quarter. Definitely it looks like the engine is back to running full speed here.&#8221; The key theme around Cloudflare&#8217;s earnings is whether Wall Street believes a significant reacceleration is happening. Quotes like this are extremely bullish. More from CEO Matthew Prince 5:18 pm &#8220;Our dollar-based net retention was 114% in up 3% quarter-over-quarter. Our gross margin was 76.3%, in line with our long-term target range of 75% to 77%. We delivered an operating profit of $72.3 million, representing an operating margin of 14.1% and we generated strong free cash flow of $33.3 million during the quarter, again exceeding expectations. Cloudflare keeps innovating faster than ever and customers are voting with their wallets, you can see that in the momentum from our Q2 results. It&#8217;s not just interest, it&#8217;s real investments that drove record ACV bookings in the quarter.&#8221; Cloudflare&#039;s Earnings Call 5:08 pm &#8220;We had an excellent quarter. We crossed $2 billion in annual run rate revenue, achieving $512.3 million of revenue in the quarter. We started the year detailing our strategy to drive reaccelerating growth. Our Q2 results highlight that this formula is working and mark a key inflection point for the company, with revenue growing 28% year-over-year, up from 26.5% in the first quarter. We now have 3,712 customers paying us more than $100,000 per year, a 22% increase year-over-year. Revenue contribution from these large customers grew at 35% year-over-year, contributing to 71% of revenue during the quarter, up from 67% in the second quarter last year. &#8221; &#8211; Matthew Prince That&#8217;s the key idea &#8211; is Cloudflare at an inflection point? Our bet is that it is. If growth keeps scaling past 30%, even with a sky high valuation, its likely Cloudflare shares will soar in the years ahead. Conference Call Coming Soon 4:50 pm Cloudflare&#8217;s conference call is coming soon. We&#8217;ll post highlights. To receive them: simply leave this blog open and an update will post after we&#8217;ve been able to listen in. Here&#039;s What&#039;s Happening After Hours 4:43 pm Apple: Up 2.2% Amazon: Down 3.1% Cloudflare: Up 5.5% Roku: Up 2% Reddit: Up 20.5% Executive Quotes 4:35 pm &#8220;We kicked off 2025 with confidence, momentum, and strong results. In Q1, we landed the largest contract in Cloudflare’s history, a more than $100 million deal driven by our Workers developer platform, and signed the longest-term SASE contract to date.&#8221; Matthew Prince &#8220;We have the scale, the technology, and the team to capture the massive opportunity ahead of us—as evidenced by the size and the length of the deals we’re closing and the caliber of customers betting on Cloudflare.&#8221; Matthew Prince &#8220;In a constantly changing world, one thing’s for certain: innovation wins. From networking, to security, to AI, Cloudflare is the envy of the industry for innovation, and there&#8217;s no slowing down.&#8221; Matthew Prince Cloudflare Now Up 7% 4:27 pm We&#8217;ll see if commentary on Cloudflare&#8217;s earnings moves the stock more, but for now gains have settled in at around 7%. Beat and Raise 4:25 pm Next quarter Cloudflare posted guidance of $543.5 to $544.5M, that&#8217;s above expectations. More Details... 4:23 pm NET | Cloudflare Q2&#8217;25 Earnings Highlights: Adj. EPS: $0.21 []; UP +5% YoY Revenue: $512.3B []; UP +28% YoY Adj. Gross Margin: 76.3% []; DOWN -270 bps YoY Net Income: -$50.4M []; DOWN -234% YoY Free Cash Flow: $33.3M; DOWN -13% YoY Outlook: Revenue: $543.5 to $544.5M [] Cloudflare expects continued strong demand, driven by larger and longer-term contracts with key customers. The company is focused on innovation and expanding its product offerings to capture more market share. Q2 Segment Performance: Revenue from Core Services: $512.3M []; UP +28% YoY Other Key Q2 Metrics: Adj. Operating Income: $72.3M []; UP +27% YoY Adj. Operating Expenses: $450.9M []; UP +30% YoY Cash, Cash Equivalents, and Available-for-Sale Securities: $3,959.7M Effective Tax Rate: 6.7% (vs. 8.0% YoY) CEO Commentary: Matthew Prince: &#8220;We had an excellent second quarter, exceeding $2 billion in annualized revenue while also reaccelerating revenue growth to 28% year-over-year. We’re innovating faster than ever, and demand remains strong, as our largest customers grow their investments with Cloudflare at the highest levels we’ve seen since 2022. While we’ve continued to sign even bigger and longer deals, some of our most strategic wins have been centered around our work to help invent the new business model for content creators on the AI-driven Internet. Sitting in front of more than 20% of all websites—with more than half of our dynamic traffic flowing through APIs—Cloudflare is uniquely positioned to enable the agentic web of the future. We are firing on all cylinders, with the right technology, strategy, and team to accelerate the next phase of growth for Cloudflare and for the Internet at-large.” Strategic Updates: Cloudflare is focusing on expanding its product offerings and enhancing its technology to better serve its customers and capture new market opportunities. We Have Lift Off 4:18 pm Cloudflare shares are now up 6% The Headline Numbers 4:17 pm Revenue: $512.3M VS $501M Estimate EPS: $0.21 VS $0.18 Estimate Earnings Are Out - Shares up 3.5% upon initial release 4:15 pm Cloudflare earnings just dropped. Initially the stock dropped, and then immediately flipped positive. We&#8217;re going ot post live news and analysis. Here We Go 4:01 pm We&#8217;re watching for Cloudflare&#8217;s earnings &#8211; they should be out any minute. 20 Minutes to the Closing Bell 3:40 pm We&#8217;re just 20 minutes from the closing bell. Most stocks are in the red today with S&amp;P 500 down .2% and the Dow Jones dropping .54%. Yet, stocks closely aligned with the AI trade have held onto gains. Microsoft&#8217;s stunning Azure numbers yesterday have helped Cloudflare shares trade sharply positive. The company is up 3.5% in late trading. As we&#8217;ve noted throughout this blog, without a beat and raise, Cloudflare shares will likely be down tomorrow. Is NET Overheated? 1:37 pm Cloudflare closed at $200.85 on Tuesday — up more than 75% since May 1. That rally reflects bullish sentiment around its AI platform, SASE expansion, and large enterprise wins. But with valuation stretched, the market is now pricing in not just strong Q2 execution, but raised full-year guidance. Anything short of an outlook above $2.1B could lead to a fade — especially with tech volatility picking up. The setup demands strength on both topline and forward commentary. Another “beat and reiterate” might not be enough to get the stock ripping higher. How Cloudflare Stock Performed After Recent Earnings 12:26 pm Cloudflare has steadily delivered modest EPS beats, but stock reactions have varied — with the strongest gains following Q3 2024. Investors are highly tuned to forward guidance and AI-driven revenue opportunities. Quarter EPS Surprise 1-Day Move 7-Day Move 14-Day Move Q1 2025 +4.41% +1.2% +2.8% +4.5% Q4 2024 –2.10% –0.6% –1.3% –0.9% Q3 2024 +6.77% +3.5% +5.2% +6.1% Q2 2024 +1.25% –0.4% +0.9% +1.6% What Wall Street Expects When Cloudflare Reports Today 10:14 am Here&#8217;s Wall Street&#8217;s consensus expectations for Q2 earnings. Revenue: $501.6 million Adjusted EPS: $.18 Gross Margin: 77.8% Free Cash Flow: $29.9 million More importantly, Cloudflare will likely need to raise forward guidance if shares are going to rise tomorrow. In the third quarter, Wall Street expects: Revenue: $538.6 million Adjusted EPS: $.21 And the company could also raise 2025 growth targets. Currently, Cloudflare is projecting sales of $2.090 billion to $2.094 billion. Wall Street expectations are slightly above that range at $2.096 billion. If Cloudflare took revenue guidance for the year beyond $2.1 billion, that could be enough for shares to rise again tomorrow. Cloudflare (NYSE: NET) reports earnings after the bell today. The company&#8217;s shares have raced forward 78% this quarter. Bears will argue that Cloudflare&#8217;s valuation is stretched to the max. Cloudflare is expected to post revenue of $2.1 billion this year, but is now worth more than $70 billion. Bulls point to Cloudflare being an essential company for the growth of agentic AI. With inference needs rising, companies will look to Cloudflare as a solution to limit latency in the age of AI. Count me in on the bull side, I added shares of Cloudflare to the $500,000 AI Portfolio I manage for 24/7 Wall St. back in January. I&#8217;ll be updating this live blog with news and analysis the moment Cloudflare&#8217;s earnings go live. All you have to do is simply leave this page open and updates will automatically appear. With that, let&#8217;s look back at Cloudflare&#8217;s first quarter earnings. Here&#8217;s What Cloudflare Reported In the First Quarter Cloudflare last reported on May 8th. Shares jumped the next day and are up 61%. Let&#8217;s take a look back at what the company reported: NET | Cloudflare Q1&#8217;25 Earnings Highlights: Adj. EPS: $0.16 ; UP +0% YoY Revenue: $479.1B []; UP +27% YoY Adj. Gross Margin: 77.1% []; DOWN -240 bps YoY Net Income: -$38.5M []; DOWN -8% YoY Free Cash Flow: $52.9M; UP +48% YoY Q1&#8217;25 Outlook: Revenue: $500.0 to $501.0M [] Cloudflare expects continued growth driven by strong demand for its services, particularly in the SASE and developer platform segments. The company anticipates maintaining its momentum with new customer acquisitions and upselling to existing customers. Q1 Segment Performance: Revenue from Core Services: $479.1M []; UP +27% YoY Other Key Q1 Metrics: Adj. Operating Income: $56.0M []; UP +32% YoY Adj. Operating Expenses: $416.8M []; UP +20% YoY Cash, Cash Equivalents, and Available-for-Sale Securities: $1,914.9M; UP +2% YoY Effective Tax Rate: 4.6% (vs. 6.3% YoY) CEO Commentary: Matthew Prince: &#8220;We kicked off 2025 with confidence, momentum, and strong results. In Q1, we landed the largest contract in Cloudflare’s history, a more than $100 million deal driven by our Workers developer platform, and signed the longest-term SASE contract to date. We have the scale, the technology, and the team to capture the massive opportunity ahead of us—as evidenced by the size and the length of the deals we’re closing and the caliber of customers betting on Cloudflare. In a constantly changing world, one thing’s for certain: innovation wins. From networking, to security, to AI, Cloudflare is the envy of the industry for innovation, and there&#8217;s no slowing down.&#8221; Strategic Updates: Cloudflare continues to enhance its product offerings, focusing on innovation in networking, security, and AI technologies to maintain its competitive edge. The post Live: Cloudflare (NET) Jumps 5% After Beat &#038; Raise appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/31/live-is-cloudflare-net-the-next-ai-stock-to-top-earnings-expectations-2/", "publishedDateET": "2025-08-01T07:03:13-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 11:01:34", "publisher": "Zacks Investment Research", "title": "Take a Bite of Apple's Solid Q3 Earnings With These ETFs", "image": "https://images.financialmodelingprep.com/news/take-a-bite-of-apples-solid-q3-earnings-with-20250801.jpg", "site": "zacks.com", "text": "As AAPL pops on earnings, ETFs like GXPT, VGT, FTEC and others could see an upside given their Apple-heavy portfolios.", "url": "https://www.zacks.com/stock/news/2649303/take-a-bite-of-apple-s-solid-q3-earnings-with-these-etfs?cid=CS-STOCKNEWSAPI-FT-etf_news_and_commentary-2649303", "publishedDateET": "2025-08-01T07:01:34-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 10:33:18", "publisher": "Seeking Alpha", "title": "Apple Shows The Value Of A Fantastic Brand", "image": "https://images.financialmodelingprep.com/news/apple-shows-the-value-of-a-fantastic-brand-20250801.jpg", "site": "seekingalpha.com", "text": "Apple delivered 9% YoY net income growth, driven by strength across major markets and product segments, especially iPhone and Mac. The company remains disciplined on expenses, outperforming peers in operational efficiency despite being excluded from the AI bubble. Apple's robust balance sheet supports aggressive shareholder returns, including a $100 billion buyback and steady dividend, though valuation remains lofty.", "url": "https://seekingalpha.com/article/4807567-apple-shows-value-of-fantastic-brand", "publishedDateET": "2025-08-01T06:33:18-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 10:19:23", "publisher": "Benzinga", "title": "Nasdaq Dips Over 2%; Apple Earnings Top Views", "image": "https://images.financialmodelingprep.com/news/nasdaq-dips-over-2-apple-earnings-top-views-20250801.jpg", "site": "benzinga.com", "text": "U.S. stocks traded lower this morning, with the Nasdaq Composite dipping more than 2% on Friday.", "url": "https://www.benzinga.com/markets/market-summary/25/08/46795855/nasdaq-dips-over-2-apple-earnings-top-views", "publishedDateET": "2025-08-01T06:19:23-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 10:06:54", "publisher": "ETF Trends", "title": "Tariffs Don't Bite AAPL; AMZN Forecast Questions Its Prime After Earnings", "image": "https://images.financialmodelingprep.com/news/tariffs-dont-bite-aapl-amzn-forecast-questions-its-prime-20250801.jpg", "site": "etftrends.com", "text": "Following Meta and Microsoft, the earnings bonanza continued for the market's biggest players, with Apple and Amazon next on the docket. Both beat out Wall Street estimates, sloughing off any notion that tariffs could negatively impact their final Q2 results.", "url": "https://www.etftrends.com/leveraged-inverse-channel/tariffs-dont-bite-aapl-amzn-forecast-questions-prime-after-earnings/", "publishedDateET": "2025-08-01T06:06:54-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 10:03:22", "publisher": "Deadline", "title": "Cinemark CEO On Box Office Turnaround From ‘Minecraft' To ‘Superman' As Chain Posts Buoyant Q2; “Thrilled” With Apple's ‘F1' Success", "image": "https://images.financialmodelingprep.com/news/cinemark-ceo-on-box-office-turnaround-from-minecraft-to-20250801.jpg", "site": "deadline.com", "text": "Cinemark shares popped Friday as the nation's third largest theater chain saw sales and profit jump in a June quarter that “launched out of the gate” with A Minecraft Movie followed by “a steady stream of highly compelling new releases week after week” from Superman to The Fantastic Four: First Steps, igniting a surge of", "url": "https://deadline.com/2025/08/cinemark-earnings-box-office-turnaround-minecraft-superman-1236476327/", "publishedDateET": "2025-08-01T06:03:22-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 10:00:00", "publisher": "GlobeNewsWire", "title": "Pomerantz Law Firm Announces the Filing of a Class Action Against Apple Inc.and Certain Officers – AAPL", "image": "https://images.financialmodelingprep.com/news/pomerantz-law-firm-announces-the-filing-of-a-class-action-against-20250801.jpg", "site": "globenewswire.com", "text": "NEW YORK, Aug. 01, 2025 (GLOBE NEWSWIRE) -- Pomerantz LLP announces that a class action lawsuit has been filed against Apple Inc. (“Apple” or the “Company”) (NASDAQ: AAPL) and certain officers. The class action, filed in the United States District Court for the Northern District of California, and docketed under 25-cv-05197, is on behalf of a class consisting of all persons and entities other than Defendants that purchased or otherwise acquired Apple securities between June 10, 2024 and June 9, 2025, both dates inclusive (the “Class Period”), seeking to recover damages caused by Defendants' violations of the federal securities laws and to pursue remedies under Sections 10(b) and 20(a) of the Securities Exchange Act of 1934 and Rule 10b-5 promulgated thereunder, against the Company and certain of its top officials.", "url": "https://www.globenewswire.com/news-release/2025/08/01/3125874/1087/en/Pomerantz-Law-Firm-Announces-the-Filing-of-a-Class-Action-Against-Apple-Inc-and-Certain-Officers-AAPL.html", "publishedDateET": "2025-08-01T06:00:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 09:58:02", "publisher": "Schwab Network", "title": "AAPL iPhone Sales Lift Shares, AMZN Trips on Guidance Miss", "image": "https://images.financialmodelingprep.com/news/aapl-iphone-sales-lift-shares-amzn-trips-on-guidance-20250801.jpg", "site": "youtube.com", "text": "Apple (AAPL) posted record June quarter revenue as iPhone sales topped Wall Street estimates. Jenny Horne goes under the hood on the Mag 7 earnings report, highlighting a record-high services segment revenue number.", "url": "https://www.youtube.com/watch?v=Ak5Xf8Vylwk", "publishedDateET": "2025-08-01T05:58:02-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 09:27:04", "publisher": "MarketBeat", "title": "Apple Stock: Big Earnings, Small Move—Time to Buy?", "image": "https://images.financialmodelingprep.com/news/apple-stock-big-earnings-small-movetime-to-buy-20250801.jpg", "site": "marketbeat.com", "text": "Apple Inc. NASDAQ: AAPL delivered a blowout earnings report after the market closed on July 31. That's not showing up in the company's stock price.", "url": "https://www.marketbeat.com/originals/apple-stock-big-earnings-small-movetime-to-buy/", "publishedDateET": "2025-08-01T05:27:04-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 09:15:20", "publisher": "24/7 Wall Street", "title": "Apple China Still in Deep Trouble", "image": "https://images.financialmodelingprep.com/news/apple-china-still-in-deep-trouble-20250801.jpg", "site": "247wallst.com", "text": "Apple Inc. (NASDAQ: AAPL) earnings exceeded almost all expectations.", "url": "https://247wallst.com/technology-3/2025/08/01/apple-china-still-in-deep-trouble/", "publishedDateET": "2025-08-01T05:15:20-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 09:09:24", "publisher": "Seeking Alpha", "title": "Apple's Stunning Q3 Earnings: Warrants An Upgrade From Hold To Buy", "image": "https://images.financialmodelingprep.com/news/apples-stunning-q3-earnings-warrants-an-upgrade-from-hold-20250801.jpg", "site": "seekingalpha.com", "text": "Apple's Q3 revenue of $94B beat expectations, driven by strong demand even in a seasonally weak quarter. Guidance for the September quarter is optimistic, with mid- to high single-digit revenue growth and robust service revenue expansion. Gross margins forecast remain healthy at 46-47%.", "url": "https://seekingalpha.com/article/4807531-apple-stunning-q3-earnings-warrants-upgrade-from-hold-to-buy", "publishedDateET": "2025-08-01T05:09:24-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 08:58:06", "publisher": "Proactive Investors", "title": "Apple's quarterlies: A glass half-full event, broker says", "image": "https://images.financialmodelingprep.com/news/apples-quarterlies-a-glass-halffull-event-broker-says-20250801.jpg", "site": "proactiveinvestors.co.uk", "text": "Apple Inc's (NASDAQ:AAPL, ETR:APC) quarterlies dropped after hours and there's a lot for UK investors to chew on, especially those with exposure through ISAa and tech-heavy funds. First up, Wedbush's analysts call the quarter a “statement moment” for Apple.", "url": "https://www.proactiveinvestors.co.uk/companies/news/1075927", "publishedDateET": "2025-08-01T04:58:06-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 08:38:00", "publisher": "GlobeNewsWire", "title": "AAPL INVESTOR REMINDER: Apple Inc. Stock Drop Leads to Class Action – Investors with Losses Urged to Contact BFA Law by August 19 (NASDAQ:AAPL)", "image": "https://images.financialmodelingprep.com/news/aapl-investor-reminder-apple-inc-stock-drop-leads-to-class-20250801.jpg", "site": "globenewswire.com", "text": "NEW YORK, Aug. 01, 2025 (GLOBE NEWSWIRE) -- Leading securities law firm Bleichmar Fonti & Auld LLP announces that a lawsuit has been filed against Apple Inc. (NASDAQ: AAPL) and certain of the Company's senior executives for potential violations of the federal securities laws. If you invested in Apple, you are encouraged to obtain additional information by visiting: https://www.bfalaw.com/cases-investigations/apple-inc-class-action-lawsuit.", "url": "https://www.globenewswire.com/news-release/2025/08/01/3125788/0/en/AAPL-INVESTOR-REMINDER-Apple-Inc-Stock-Drop-Leads-to-Class-Action-Investors-with-Losses-Urged-to-Contact-BFA-Law-by-August-19-NASDAQ-AAPL.html", "publishedDateET": "2025-08-01T04:38:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 07:42:45", "publisher": "Finbold", "title": "Wall Street sets Apple and Amazon price targets for next 12 months", "image": "https://images.financialmodelingprep.com/news/wall-street-sets-apple-and-amazon-price-targets-for-20250801.jpg", "site": "finbold.com", "text": "Apple (NASDAQ: AAPL) and Amazon (NASDAQ: AMZN) delivered second-quarter results after the bell on Thursday, with both industry stalwarts beating expectations.", "url": "https://finbold.com/wall-street-sets-apple-and-amazon-price-targets-for-next-12-months/", "publishedDateET": "2025-08-01T03:42:45-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 07:07:45", "publisher": "CNBC Television", "title": "Can't ask for a whole lot more from Apple's quarter, says BofA's Wamsi Mohan", "image": "https://images.financialmodelingprep.com/news/cant-ask-for-a-whole-lot-more-from-apples-20250801.jpg", "site": "youtube.com", "text": "Wamsi Mohan, Bank of America Securities senior equity research analyst, joins 'Squawk Box' to break down Apple's quarterly earnings results.", "url": "https://www.youtube.com/watch?v=cy1tqbETIPs", "publishedDateET": "2025-08-01T03:07:45-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 06:53:06", "publisher": "Proactive Investors", "title": "Apple's momentum returns. Here' what UK investors need to know about the numbers", "image": "https://images.financialmodelingprep.com/news/apples-momentum-returns-here-what-uk-investors-need-to-20250801.jpg", "site": "proactiveinvestors.co.uk", "text": "Apple Inc (NASDAQ:AAPL, ETR:APC) shares nudged 1.5% higher after hours as the Silicon Valley giant delivered its best quarterly growth since 2021, outpacing expectations for both revenue and profit. The results, covering the three months to 29 June, mark a return to form for Apple after a stretch of slower growth, with iPhone demand rebounding sharply and a resurgence in China offsetting earlier concerns about market saturation and economic headwinds.", "url": "https://www.proactiveinvestors.co.uk/companies/news/1075917", "publishedDateET": "2025-08-01T02:53:06-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 06:34:00", "publisher": "Barrons", "title": "Stocks Are Still Vulnerable to a Tariff Shock. What Apple and Amazon Earnings Reveal.", "image": "https://images.financialmodelingprep.com/news/stocks-are-still-vulnerable-to-a-tariff-shock-what-apple-20250801.jpg", "site": "barrons.com", "text": "Trump sets a 10% baseline tariff, Apple's quarter boosted by iPhone sales, Figma stock more than triples in IPO, and more news to start your day.", "url": "https://www.barrons.com/articles/stocks-tariffs-apple-amazon-earnings-things-to-know-today-77aa5c48", "publishedDateET": "2025-08-01T02:34:00-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 04:48:27", "publisher": "TechXplore", "title": "Apple profit beats forecasts on strong iPhone sales", "image": "https://images.financialmodelingprep.com/news/apple-profit-beats-forecasts-on-strong-iphone-sales-20250801.jpg", "site": "techxplore.com", "text": "Apple on Thursday reported quarterly profit of $23.4 billion, topping forecasts despite concerns about the effect of US tariffs on its supply chain.", "url": "https://techxplore.com/news/2025-08-apple-profit-strong-iphone-sales.html", "publishedDateET": "2025-08-01T00:48:27-04:00"}
{"symbol": "AAPL", "publishedDate": "2025-08-01 04:04:00", "publisher": "The Motley Fool", "title": "Prediction: 2 Artificial Intelligence (AI) Stocks Will Be Worth More Than Apple by 2030 (Hint: Not Nvidia)", "image": "https://images.financialmodelingprep.com/news/prediction-2-artificial-intelligence-ai-stocks-will-be-worth-20250801.jpg", "site": "fool.com", "text": "Apple is currently the third largest public company, with a market value of $3.1 trillion. I expect two artificial intelligence stocks to surpass that figure within five years.", "url": "https://www.fool.com/investing/2025/08/01/2-ai-stocks-worth-more-than-apple-stock-not-nvidia/", "publishedDateET": "2025-08-01T00:04:00-04:00"}
