[
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-23 06:46:05",
    "publisher": "Zacks Investment Research",
    "title": "5 Must-Buy Corporate Giants Ahead of Q1 Earnings Next Week",
    "image": "https://images.financialmodelingprep.com/news/5-mustbuy-corporate-giants-ahead-of-q1-earnings-next-20210423.jpg",
    "site": "zacks.com",
    "text": "We have narrowed down our search to five corporate bigwigs slated to release first-quarter earnings results next week. These are: XOM, CVX, CAT, ICE and TXN.",
    "url": "https://www.zacks.com/stock/news/1440788/5-must-buy-corporate-giants-ahead-of-q1-earnings-next-week",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-23T06:46:05-04:00",
    "date_et": "2021-04-23"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-23 14:08:00",
    "publisher": "The Motley Fool",
    "title": "Brett Perlman on Blackouts and the Future of Texas Energy",
    "image": "https://images.financialmodelingprep.com/news/brett-perlman-on-blackouts-and-the-future-of-texas-20210423.jpg",
    "site": "fool.com",
    "text": "Lessons we can learn from the past that will help create a better future.",
    "url": "https://www.fool.com/investing/2021/04/23/brett-perlman-on-blackouts-and-the-future-of-texas/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-23T14:08:00-04:00",
    "date_et": "2021-04-23"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-24 08:51:55",
    "publisher": "Seeking Alpha",
    "title": "EVT: A Very Attractive 6.5%-Yielding CEF Trading At A Discount",
    "image": "https://images.financialmodelingprep.com/news/evt-a-very-attractive-65yielding-cef-trading-at-a-20210424.jpg",
    "site": "seekingalpha.com",
    "text": "EVT: A Very Attractive 6.5%-Yielding CEF Trading At A Discount",
    "url": "https://seekingalpha.com/article/4421061-evt-trading-discount",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-24T08:51:55-04:00",
    "date_et": "2021-04-24"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-25 07:00:00",
    "publisher": "Barron's",
    "title": "Giant Investor Bought EV Stocks Tesla and NIO. Here's What It Sold.",
    "image": "https://images.financialmodelingprep.com/news/giant-investor-bought-ev-stocks-tesla-and-nio-heres-20210425.jpg",
    "site": "barrons.com",
    "text": "Munich Re's asset manager bought more Tesla, NIO, and Microsoft stock in the first quarter, and sold nearly all its Exxon stock.",
    "url": "https://www.barrons.com/articles/giant-investor-bought-ev-stocks-tesla-nio-microsoft-sold-exxon-51619109898",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-25T07:00:00-04:00",
    "date_et": "2021-04-25"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 07:06:00",
    "publisher": "Reuters",
    "title": "Exxon retreated from oil trading in pandemic as rivals made fortunes",
    "image": "https://images.financialmodelingprep.com/news/exxon-retreated-from-oil-trading-in-pandemic-as-rivals-20210426.jpg",
    "site": "reuters.com",
    "text": "Exxon Mobil's effort to build an energy trading business to compete with those of European oil majors unraveled quickly last year as the firm slashed the unit's funding amid broader spending cuts, 10 people familiar with the matter told Reuters.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-trading-insight/exxon-retreated-from-oil-trading-in-pandemic-as-rivals-made-fortunes-idUSKBN2CD19J",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T07:06:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 09:01:28",
    "publisher": "Zacks Investment Research",
    "title": "Is a Beat in Store for ExxonMobil's (XOM) Q1 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/is-a-beat-in-store-for-exxonmobils-xom-q1-20210426.jpg",
    "site": "zacks.com",
    "text": "ExxonMobil (XOM) projects first-quarter operating results from oil and liquids businesses to improve $1.6 billion to $2 billion from the December quarter of 2020.",
    "url": "https://www.zacks.com/stock/news/1455835/is-a-beat-in-store-for-exxonmobils-xom-q1-earnings",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T09:01:28-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 09:15:00",
    "publisher": "Business Wire",
    "title": "Engine No. 1 Releases Investor Presentation Highlighting Need for Change at ExxonMobil",
    "image": "https://images.financialmodelingprep.com/news/engine-no-1-releases-investor-presentation-highlighting-need-for-20210426.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Engine No. 1, which has nominated four highly qualified, independent director candidates to the Exxon Mobil Corporation (NYSE: XOM) (“ExxonMobil” or the “Company”) Board of Directors (the “Board”), today released an in-depth presentation to ExxonMobil shareholders detailing the need for change at ExxonMobil to protect and enhance long-term shareholder value in a changing industry and world. Engine No. 1 encourages ExxonMobil shareholders to review the facts set f",
    "url": "https://www.businesswire.com/news/home/20210426005523/en/Engine-No.-1-Releases-Investor-Presentation-Highlighting-Need-for-Change-at-ExxonMobil/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T09:15:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 11:00:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil to Release First Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-to-release-first-quarter-2021-financial-results-20210426.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation (NYSE:XOM) will release first quarter 2021 financial results on Friday, April 30, 2021. A press release will be issued via Business Wire and available at 6:30 a.m. CT at www.exxonmobil.com. Darren Woods, chairman and chief executive officer, and Stephen Littleton, vice president of investor relations and secretary, will review the results during a live, listen-only conference call at 8:30 a.m. CT. The presentation can be accessed via webcast or by calling (888) 596-2592 (United States) or (786) 789-4790 (International). Please reference confirmation code 7945025 to join the call. An archive replay of the call and a copy of the presentation with accompanying supplemental financial data will be available at www.exxonmobil.com/ir.",
    "url": "https://www.businesswire.com/news/home/20210426005613/en/ExxonMobil-to-Release-First-Quarter-2021-Financial-Results",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T11:00:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 11:00:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil to Release First Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-to-release-first-quarter-2021-financial-results-20210426.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil to Release First Quarter 2021 Financial Results",
    "url": "https://www.businesswire.com/news/home/20210426005613/en/ExxonMobil-to-Release-First-Quarter-2021-Financial-Results/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T11:00:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-26 18:02:00",
    "publisher": "Reuters",
    "title": "CalPERS to back activist's four director nominees in Exxon board fight",
    "image": "https://images.financialmodelingprep.com/news/calpers-to-back-activists-four-director-nominees-in-exxon-20210426.jpg",
    "site": "reuters.com",
    "text": "The California Public Employees' Retirement System (CalPERS) said on Monday it plans to vote for Engine No. 1's four director nominees to Exxon Mobil Corp's board, becoming the second large pension fund after New York to throw support to the activist hedge fund in its proxy fight with the company.",
    "url": "https://www.reuters.com/business/energy/calpers-back-activists-four-director-nominees-exxon-board-fight-2021-04-26/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-26T18:02:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 06:46:04",
    "publisher": "Zacks Investment Research",
    "title": "Wall Street Soars in Biden's First 100 Days in Office: 5 Picks",
    "image": "https://images.financialmodelingprep.com/news/wall-street-soars-in-bidens-first-100-days-in-office-20210427.jpg",
    "site": "zacks.com",
    "text": "We have narrowed down our search to five U.S. corporate bigwigs (market capital > 20 billion) with a favorable Zacks Rank. These are: XOM, GS, BAC, LRCX and NUE.",
    "url": "https://www.zacks.com/stock/news/1460750/wall-street-soars-in-bidens-first-100-days-in-office-5-picks",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T06:46:04-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 08:00:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Presentation Details Strategy to Grow Shareholder Value, Protect Dividend and Transition to Lower-Carbon Future",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-presentation-details-strategy-to-grow-shareholder-value-protect-20210427.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil Presentation Details Strategy to Grow Shareholder Value, Protect Dividend and Transition to Lower-Carbon Future",
    "url": "https://www.businesswire.com/news/home/20210427005455/en/ExxonMobil-Presentation-Details-Strategy-to-Grow-Shareholder-Value-Protect-Dividend-and-Transition-to-Lower-Carbon-Future/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T08:00:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 08:00:00",
    "publisher": "Business Wire",
    "title": "Leading Pension Funds CalPERS, CalSTRS, and New York State Common Support Engine No. 1's Campaign to Reenergize ExxonMobil by Voting the WHITE Proxy Card “FOR ALL” of Engine No.",
    "image": "https://images.financialmodelingprep.com/news/leading-pension-funds-calpers-calstrs-and-new-york-state-20210427.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Engine No. 1, which has nominated four highly qualified, independent director candidates to the Exxon Mobil Corporation (NYSE: XOM) (“ExxonMobil” or the “Company”) Board of Directors (the “Board”), today issued the following statement in response to U.S. pension funds CalSTRS, CalPERS, and New York State Common supporting Engine No. 1's four highly qualified, independent director candidates. Engine No. 1 commented, “We are pleased CalSTRS, CalPERS and New York St",
    "url": "https://www.businesswire.com/news/home/20210427005386/en/Leading-Pension-Funds-CalPERS-CalSTRS-and-New-York-State-Common-Support-Engine-No.-1%E2%80%99s-Campaign-to-Reenergize-ExxonMobil-by-Voting-the-WHITE-Proxy-Card-%E2%80%9CFOR-ALL%E2%80%9D-of-Engine-No.-1%E2%80%99s-Director-Candidates/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T08:00:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 08:00:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Presentation Details Strategy to Grow Shareholder Value, Protect Dividend and Transition to Lower-Carbon Future",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-presentation-details-strategy-to-grow-shareholder-value-protect-dividend-20210427.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil today released a detailed investor presentation reiterating the company’s strategy to capitalize on its industry-leading resources to drive earnings and cash flow growth, maintain a strong dividend, reduce debt and invest in lower-emission technologies. The presentation, as well as additional information related to ExxonMobil’s May 26, 2021 annual meeting of shareholders, can be found at www.XOMDrivingValue.com. “ExxonMobil has laid a solid foundation for success,” said Darren Woods, chairman and chief executive officer. “Our board and management have developed and are executing a strategy which has positioned us for future outperformance relative to peers, including paying a reliable and growing dividend. We are uniquely placed to help society meet its net zero ambitions, while capturing enormous future opportunities and delivering value for shareholders for many decades to come.” ExxonMobil’s presentation outlines how it is investing in lower-carbon technologies to expand business opportunities over the longer term, while driving structural improvements in existing businesses with a disciplined, value-driven approach. The presentation highlights the new ExxonMobil Low Carbon Solutions business, which is working to commercialize technologies to reduce emissions in hard-to-decarbonize sectors, such as power generation, commercial transportation and heavy industry. The technologies include carbon capture and storage (CCS), which will be the initial focus of Low Carbon Solutions, as well as hydrogen, and advanced biofuels. Demand for these lower-emission technologies could create multi-trillion dollar markets by 2040. ExxonMobil is the global leader in CCS, and has captured approximately 40 percent of all anthropogenic CO2 ever captured, the equivalent to planting approximately 2 billion trees. ExxonMobil recently announced a multi-industry CCS concept that has the potential to significantly decarbonize heavy industries located near the Houston ship channel; early projections indicate that, with the appropriate enablers, it could remove approximately 100 million metric tons of CO2 per year by 2040. The lower-carbon business opportunities leverage decades of ExxonMobil experience in deploying technology at scale, and competitive advantages demonstrated in its existing businesses. In addition, the company’s 2025 emission-reduction plans are projected to be consistent with the goals of the Paris Agreement and a 2-degree pathway. The company also details how it is investing in one of the most attractive, high-return portfolios in the industry to increase cash flow while maintaining existing production levels needed to responsibly meet society’s continued demand for oil and gas and high-value chemical products. ExxonMobil’s plans are built to capture opportunities in a wide range of long-term energy-demand scenarios, consistent with those of the UN’s Intergovernmental Panel on Climate Change and the authoritative International Energy Agency, that show a continued use of fossil fuels well into the future. The company’s current plan assumes flat production volumes while still generating excess cash at $50 per barrel Brent. Noting significant improvements to its portfolio since 2017, and the fact that the company continues to benefit from long-cycle actions approved by its board, ExxonMobil highlighted that total shareholder return (TSR) has outperformed the peer average over the past six-month, one-year, two-year and three-year periods, and had a 52 percent TSR over the past year. The company also outperformed the peer average on long-term return on capital employed (ROCE) and dividend growth per share over the last five years. About ExxonMobil ExxonMobil, one of the largest publicly traded international energy companies, uses technology and innovation to help meet the world’s growing energy needs. ExxonMobil holds an industry-leading inventory of resources, is one of the largest refiners and marketers of petroleum products, and its chemical company is one of the largest in the world. To learn more, visit exxonmobil.com and the Energy Factor. Follow us on Twitter and LinkedIn. Cautionary Statement Outlooks; projections; goals; estimates; descriptions of strategic plans and objectives; plans to reduce future emissions intensity and the expected resulting absolute emissions reductions; emission profiles of future developments; carbon capture results and the impact of operational and technology efforts; energy market evolution; product mix and sales growth; and other statements of future events or conditions in this letter are forward-looking statements. Actual future results could differ materially due to a number of factors. These include continuity in our board of directors and the oversight of our strategies by the board; global and regional changes in the demand, supply, prices, differentials or other market conditions affecting oil, gas, petroleum, petrochemicals and feedstocks; company actions to protect the health and safety of employees, vendors, customers, and communities; the ability to access short- and long-term debt markets on a timely and affordable basis; the severity, length and ultimate impact of COVID-19 and government responses on people and economies; global population and economic growth; changes in law, taxes or regulation, including environmental regulations, taxes, political sanctions and international treaties; the timely granting or freeze, suspension or revocation of government permits; the impact of fiscal and commercial terms and the outcome of commercial negotiations; feasibility and timing for regulatory approval of potential investments or divestments; the actions of competitors and preferences of customers; the capture of efficiencies within and between business lines; unexpected technological developments; general economic conditions, including the occurrence and duration of economic recessions; unforeseen technical or operating difficulties; the ability to bring new technologies to commercial scale on a cost-competitive basis, including large-scale hydraulic fracturing projects and carbon capture projects; and other factors discussed here, in Item 1A. Risk Factors in our Form 10-K for the year ended December 31, 2020 and under the heading \"Factors Affecting Future Results\" on the Investors page of our website at www.exxonmobil.com under the heading News & Resources. Important Additional Information Regarding Proxy Solicitation Exxon Mobil Corporation (“ExxonMobil”) has filed a definitive proxy statement and form of associated BLUE proxy card with the U.S. Securities and Exchange Commission (the “SEC”) in connection with the solicitation of proxies for ExxonMobil’s 2021 Annual Meeting (the “Proxy Statement”). ExxonMobil, its directors and certain of its executive officers will be participants in the solicitation of proxies from shareholders in respect of the 2021 Annual Meeting. Information regarding the names of ExxonMobil’s directors and executive officers and their respective interests in ExxonMobil by security holdings or otherwise is set forth in the Proxy Statement. To the extent holdings of such participants in ExxonMobil’s securities are not reported, or have changed since the amounts described, in the Proxy Statement, such changes have been reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Change in Ownership on Form 4 filed with the SEC. Details concerning the nominees of ExxonMobil’s Board of Directors for election at the 2021 Annual Meeting are included in the Proxy Statement. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SHAREHOLDERS OF THE COMPANY ARE URGED TO READ ALL RELEVANT DOCUMENTS FILED WITH OR FURNISHED TO THE SEC, INCLUDING THE COMPANY’S DEFINITIVE PROXY STATEMENT AND ANY SUPPLEMENTS THERETO AND ACCOMPANYING BLUE PROXY CARD, BECAUSE THEY CONTAIN IMPORTANT INFORMATION. Investors and shareholders can obtain a copy of the Proxy Statement and other relevant documents filed by ExxonMobil free of charge from the SEC’s website, www.sec.gov. ExxonMobil’s shareholders can also obtain, without charge, a copy of the Proxy Statement and other relevant filed documents by directing a request by mail to ExxonMobil Shareholder Services at 5959 Las Colinas Boulevard, Irving, Texas, 75039-2298 or at shareholderrelations@exxonmobil.com or from the investor relations section of ExxonMobil’s website, www.exxonmobil.com/investor.",
    "url": "https://www.businesswire.com/news/home/20210427005455/en/ExxonMobil-Presentation-Details-Strategy-to-Grow-Shareholder-Value-Protect-Dividend-and-Transition-to-Lower-Carbon-Future",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T08:00:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 08:26:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Announces Discovery at Uaru-2 Offshore Guyana",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-announces-discovery-at-uaru2-offshore-guyana-20210427.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil Announces Discovery at Uaru-2 Offshore Guyana",
    "url": "https://www.businesswire.com/news/home/20210427005460/en/ExxonMobil-Announces-Discovery-at-Uaru-2-Offshore-Guyana/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T08:26:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 08:26:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Announces Discovery at Uaru-2 Offshore Guyana",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-announces-discovery-at-uaru2-offshore-guyana-20210427.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil said today it made an oil discovery at the Uaru-2 well in the Stabroek Block offshore Guyana. Uaru-2 will add to the previously announced gross discovered recoverable resource estimate for the block, which is currently estimated to be approximately 9 billion oil-equivalent barrels. Drilling at Uaru-2 encountered approximately 120 feet (36.7 meters) of high quality oil bearing reservoirs including newly identified intervals below the original Uaru-1 discovery. The well was drilled in 5,659 feet (1,725 meters) of water and is located approximately 6.8 miles (11 kilometers) south of the Uaru-1 well. “The Uaru-2 discovery enhances our work to optimally sequence development opportunities in the Stabroek Block,” said Mike Cousins, senior vice president of exploration and new ventures at ExxonMobil. “Progressing our industry-leading investments and well-executed exploration plans are vital in order to continue to develop Guyana’s offshore resources that unlock additional value for the people of Guyana and all stakeholders.” In January 2020, ExxonMobil announced that Uaru-1 was the 16th discovery in the Stabroek Block. The well encountered approximately 94 feet (29 meters) of high-quality oil-bearing sandstone reservoir and was drilled in 6,342 feet (1,933 meters) of water. In March 2021, ExxonMobil secured a sixth drillship, the Noble Sam Croft, for exploration and evaluation drilling activities offshore Guyana. A fourth project, Yellowtail, has been identified within the block with anticipated start up in late 2025 pending government approvals and project sanctioning. This project will develop the Yellowtail and Redtail fields, which are located about 19 miles (30 kilometers) southeast of the Liza developments. ExxonMobil anticipates at least six projects online by 2027 and sees potential for up to 10 FPSOs to develop its current recoverable resource balance. The start-up of Liza Phase 2 remains on target for 2022, as the Liza Unity FPSO prepares for sail away from Singapore to Guyana later this year. The Unity FPSO has a production capacity of 220,000 barrels of oil per day at peak rates. The hull for the Prosperity FPSO vessel, the third project at the Payara Field, is complete, and topsides construction activities have commenced in Singapore with a startup target of 2024. These new projects continue to drive investment in the Guyanese economy. More than 2,300 Guyanese are now supporting project activities on and offshore, which reflects a more than 20 percent increase since the end of 2019. ExxonMobil and its key contractors have spent approximately US$388 million with more than 800 local companies since 2015. The Stabroek Block is 6.6 million acres (26,800 square kilometers). ExxonMobil affiliate Esso Exploration and Production Guyana Limited is operator and holds 45 percent interest in the Stabroek Block. Hess Guyana Exploration Ltd. holds 30 percent interest and CNOOC Petroleum Guyana Limited, a wholly-owned subsidiary of CNOOC Limited, holds 25 percent interest. About ExxonMobil ExxonMobil, one of the largest publicly traded international energy companies, uses technology and innovation to help meet the world’s growing energy needs. ExxonMobil holds an industry-leading inventory of resources, is one of the largest refiners and marketers of petroleum products, and its chemical company is one of the largest in the world. To learn more, visit exxonmobil.com and the Energy Factor. Follow us on Twitter and LinkedIn. Cautionary Statement Statements of future events or conditions in this release are forward-looking statements. Actual future results, including project plans, schedules, capacities, production rates, timing, and resource recoveries could differ materially due to: changes in market conditions affecting the oil and gas industry or long-term oil and gas price levels; political or regulatory developments including obtaining necessary regulatory permits; restrictions in trade, travel or broader government responses to first or subsequent waves of COVID-19; reservoir performance; the outcome of future exploration and development efforts; technical or operating factors; the outcome of commercial negotiations; unexpected technological breakthroughs or challenges; and other factors cited under the caption “Factors Affecting Future Results” on the Investors page of our website at exxonmobil.com and under Item 1A. Risk Factors in our annual report on Form 10-K. References to “recoverable resource” include quantities of oil and gas that are not yet classified as proved reserves under SEC rules but that are expected to be ultimately recoverable.",
    "url": "https://www.businesswire.com/news/home/20210427005460/en/ExxonMobil-Announces-Discovery-at-Uaru-2-Offshore-Guyana",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T08:26:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-27 11:38:40",
    "publisher": "Investor's Business Daily",
    "title": "Top Shale Producer To Return To Profit As Oil Prices Rebound, But Outlook Uncertain Again",
    "image": "https://images.financialmodelingprep.com/news/top-shale-producer-to-return-to-profit-as-oil-20210427.jpg",
    "site": "investors.com",
    "text": "Continental Resources will report Q1 earnings Wednesday as the recovery in oil prices should bring back profits after four straight quarters of losses. The post Top Shale Producer To Return To Profit As Oil Prices Rebound, But Outlook Uncertain Again appeared first on Investor's Business Daily.",
    "url": "https://www.investors.com/news/oil-prices-rebound-amid-continental-resources-earnings-q1-2021-opec-output/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-27T11:38:40-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-28 07:10:00",
    "publisher": "Forbes",
    "title": "Meeting Biden's Cliamte Goals Requires Giving Exxon A Seat At The Table",
    "image": "https://images.financialmodelingprep.com/news/meeting-bidens-cliamte-goals-requires-giving-exxon-a-seat-20210428.jpg",
    "site": "forbes.com",
    "text": "Last week, Biden called for a net-zero US Economy by 2050 while ExxonMobil proposed a massive carbon capture project in Houston. These announcements highlight the difficult road ahead as the entities most responsible for fossil-fuel extraction look to secure their place in a low-carbon future.",
    "url": "https://www.forbes.com/sites/brentanalexander/2021/04/28/meeting-bidens-cliamte-goals-requires-giving-exxon-a-seat-at-the-table/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-28T07:10:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-28 09:17:37",
    "publisher": "Zacks Investment Research",
    "title": "Will ExxonMobil's (XOM) Upstream Business Aid Q1 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/will-exxonmobils-xom-upstream-business-aid-q1-earnings-20210428.jpg",
    "site": "zacks.com",
    "text": "Since ExxonMobil (XOM) has significant exposure to upstream business, the considerable improvement in oil price is likely to have aided the company's Q1 earnings.",
    "url": "https://www.zacks.com/stock/news/1466807/will-exxonmobils-xom-upstream-business-aid-q1-earnings",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-28T09:17:37-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-28 16:49:00",
    "publisher": "Business Wire",
    "title": "Exxon Mobil Corporation Declares Second Quarter Dividend",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-declares-second-quarter-dividend-20210428.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--The Board of Directors of Exxon Mobil Corporation (NYSE:XOM) today declared a cash dividend of $0.87 per share on the Common Stock, payable on June 10, 2021 to shareholders of record of Common Stock at the close of business on May 13, 2021. This second quarter dividend is at the same level as the dividend paid in the first quarter of 2021. Through its dividends, the corporation has shared its success with its shareholders for more than 100 years. Important Additional Information Regarding Proxy Solicitation Exxon Mobil Corporation (“ExxonMobil”) has filed a definitive proxy statement and form of associated BLUE proxy card with the U.S. Securities and Exchange Commission (the “SEC”) in connection with the solicitation of proxies for ExxonMobil’s 2021 Annual Meeting (the “Proxy Statement”). ExxonMobil, its directors and certain of its executive officers will be participants in the solicitation of proxies from shareholders in respect of the 2021 Annual Meeting. Information regarding the names of ExxonMobil’s directors and executive officers and their respective interests in ExxonMobil by security holdings or otherwise is set forth in the Proxy Statement. To the extent holdings of such participants in ExxonMobil’s securities are not reported, or have changed since the amounts described, in the Proxy Statement, such changes have been reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Change in Ownership on Form 4 filed with the SEC. Details concerning the nominees of ExxonMobil’s Board of Directors for election at the 2021 Annual Meeting are included in the Proxy Statement. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SHAREHOLDERS OF THE COMPANY ARE URGED TO READ ALL RELEVANT DOCUMENTS FILED WITH OR FURNISHED TO THE SEC, INCLUDING THE COMPANY’S DEFINITIVE PROXY STATEMENT AND ANY SUPPLEMENTS THERETO AND ACCOMPANYING BLUE PROXY CARD, BECAUSE THEY CONTAIN IMPORTANT INFORMATION. Investors and shareholders can obtain a copy of the Proxy Statement and other relevant documents filed by ExxonMobil free of charge from the SEC’s website, www.sec.gov. ExxonMobil’s shareholders can also obtain, without charge, a copy of the Proxy Statement and other relevant filed documents by directing a request by mail to ExxonMobil Shareholder Services at 5959 Las Colinas Boulevard, Irving, Texas, 75039-2298 or at shareholderrelations@exxonmobil.com or from the investor relations section of ExxonMobil’s website, www.exxonmobil.com/investor.",
    "url": "https://www.businesswire.com/news/home/20210428006127/en/Exxon-Mobil-Corporation-Declares-Second-Quarter-Dividend",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-28T16:49:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-28 16:49:00",
    "publisher": "Business Wire",
    "title": "Exxon Mobil Corporation Declares Second Quarter Dividend",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-declares-second-quarter-dividend-20210428.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation Declares Second Quarter Dividend",
    "url": "https://www.businesswire.com/news/home/20210428006127/en/Exxon-Mobil-Corporation-Declares-Second-Quarter-Dividend/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-28T16:49:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 01:31:02",
    "publisher": "Zacks Investment Research",
    "title": "The Tech Sector Money Machine",
    "image": "https://images.financialmodelingprep.com/news/the-tech-sector-money-machine-20210429.jpg",
    "site": "zacks.com",
    "text": "The Tech Sector Money Machine",
    "url": "https://www.zacks.com/commentary/1469519/the-tech-sector-money-machine",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T01:31:02-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 01:31:04",
    "publisher": "Zacks Investment Research",
    "title": "The Tech Sector Money Machine",
    "image": "https://images.financialmodelingprep.com/news/the-tech-sector-money-machine-20210429.jpg",
    "site": "zacks.com",
    "text": "The Tech Sector Money Machine",
    "url": "https://www.zacks.com/commentary/1469573/the-tech-sector-money-machine",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T01:31:04-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 11:16:14",
    "publisher": "Zacks Investment Research",
    "title": "Why Earnings Season Could Be Great for Exxon Mobil Corp (XOM)",
    "image": "https://images.financialmodelingprep.com/news/why-earnings-season-could-be-great-for-exxon-mobil-corp-20210429.jpg",
    "site": "zacks.com",
    "text": "Exxon Mobil Corp (XOM) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season.",
    "url": "https://www.zacks.com/stock/news/1473469/why-earnings-season-could-be-great-for-exxon-mobil-corp-xom",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T11:16:14-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 13:45:30",
    "publisher": "Investopedia",
    "title": "Exxon Earnings: What to Look For",
    "image": "https://images.financialmodelingprep.com/news/exxon-earnings-what-to-look-for-20210429.jpg",
    "site": "investopedia.com",
    "text": "Exxon (XOM) reports Q1 earnings before market open on April 30. Can it boost its upstream business to turn a profit amid higher oil prices?",
    "url": "https://www.investopedia.com/exxon-q1-2021-earnings-report-preview-5181128",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T13:45:30-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 14:08:02",
    "publisher": "Market Watch",
    "title": "Exxon Mobil's stock rises toward 5th-straight gain ahead of earnings report",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobils-stock-rises-toward-5thstraight-gain-ahead-of-earnings-20210429.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Exxon Mobil Corp. rose 0.6% in afternoon trading, putting them on track for their fifth-straight gain, ahead of the oil giant's first-quarter report due out the next morning. Exxon Mobil is expected to report before Friday's open net income that rises above $2.5 billion, adjusted earnings per share that climbs to 60 cents and revenue that edged up to $56.38 billion, according to FactSet.",
    "url": "https://www.marketwatch.com/story/exxon-mobils-stock-rises-toward-5th-straight-gain-ahead-of-earnings-report-2021-04-29",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T14:08:02-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 17:19:04",
    "publisher": "Forbes",
    "title": "ExxonMobil's Investor Magical Mystery Tour (Waiting To Take You Away!)",
    "image": "https://images.financialmodelingprep.com/news/exxonmobils-investor-magical-mystery-tour-waiting-to-take-you-20210429.jpg",
    "site": "forbes.com",
    "text": "By ignoring the economic realities of climate change, ExxonMobil has been on a path of value destruction for 10 years. This problem can be solved.",
    "url": "https://www.forbes.com/sites/bobeccles/2021/04/29/exxonmobils-investor-magical-mystery-tour-waiting-to-take-you-away/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T17:19:04-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 17:43:23",
    "publisher": "Benzinga",
    "title": "Chevron, Exxon To Report Earnings On Friday: Here's What To Expect",
    "image": "https://images.financialmodelingprep.com/news/chevron-exxon-to-report-earnings-on-friday-heres-what-20210429.jpeg",
    "site": "benzinga.com",
    "text": "This week has been one of the biggest earnings weeks of the year, with goliaths such as Apple, Facebook and Google reporting. On Friday, there are still a few notable companies to report earnings.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20861575/chevron-exxon-to-report-earnings-on-friday-heres-what-to-expect",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T17:43:23-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-29 18:47:52",
    "publisher": "Zacks Investment Research",
    "title": "The Biden Vision",
    "image": "https://images.financialmodelingprep.com/news/the-biden-vision-20210429.jpg",
    "site": "zacks.com",
    "text": "The Biden Vision",
    "url": "https://www.zacks.com/commentary/1474831/the-biden-vision",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-29T18:47:52-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 07:29:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Earns $2.7 Billion in First Quarter 2021",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-earns-27-billion-in-first-quarter-2021-20210430.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil Earns $2.7 Billion in First Quarter 2021",
    "url": "https://www.businesswire.com/news/home/20210430005293/en/ExxonMobil-Earns-2.7-Billion-in-First-Quarter-2021/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T07:29:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 07:29:00",
    "publisher": "Business Wire",
    "title": "ExxonMobil Earns $2.7 Billion in First Quarter 2021",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-earns-27-billion-in-first-quarter-2021-20210430.jpg",
    "site": "businesswire.com",
    "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation (NYSE:XOM): First Quarter First Quarter Fourth Quarter 2021 2020 2020 Results Summary (Dollars in millions, except per share data) Earnings/(Loss) (U.S. GAAP) 2,730 (610) (20,070) Earnings/(Loss) Per Common Share Assuming Dilution 0.64 (0.14) (4.70) Identified Items Per Common Share Assuming Dilution (0.01) (0.67) (4.73) Earnings/(Loss) Excluding Identified Items Per Common Share Assuming Dilution 0.65 0.53 0.03 Capital and Exploration Expenditures 3,133 7,143 4,771 Exxon Mobil Corporation today announced estimated first quarter 2021 earnings of $2.7 billion, or $0.64 per share assuming dilution, compared with a loss of $610 million in the first quarter of 2020. Results included unfavorable identified items of $31 million, or $0.01 per share assuming dilution. First quarter capital and exploration expenditures were $3.1 billion, $4 billion lower than the first quarter of 2020. Oil-equivalent production was 3.8 million barrels per day, up 3 percent from the fourth quarter of 2020. Excluding entitlement effects, government mandates and divestments, oil-equivalent production was up 2 percent. “The strong first quarter results reflect the benefits of higher commodity prices and our focus on structural cost reductions, while prioritizing investments in assets with a low cost of supply,” said Darren Woods, chairman and chief executive officer. “Cash flow from operating activities during the quarter fully covered the dividend and capital investments, and we strengthened the balance sheet by reducing debt. We also made progress on our energy transition strategy by launching our new ExxonMobil Low Carbon Solutions business, which is initially working to develop innovative, large-scale carbon capture and storage (CCS) concepts, including the evaluation and advancement of more than 20 new opportunities, such as a multi-industry hub to reduce emissions from hard-to-decarbonize industries near the Houston Ship Channel. As the global leader in carbon capture, we are seeing growing public and private sector support for CCS as a critical enabling technology to reduce emissions and help meet society's net-zero ambitions.” During severe winter weather in Texas in February, ExxonMobil cogeneration facilities generated 400 megawatts of electricity, helping to power about 200,000 homes. The severe weather event reduced first quarter earnings by nearly $600 million across all businesses from decreased production and lower sales volumes, repair costs, and the net impact of energy purchases and sales. All affected facilities have resumed normal operations. First Quarter 2021 Results and Business Highlights Upstream Average realizations for crude oil increased 42 percent from the fourth quarter. Natural gas realizations rose by 33 percent in the quarter. Total production volumes increased 98,000 oil-equivalent barrels per day from the fourth quarter. Excluding entitlement effects, government mandates and divestments, liquids volumes were down 3 percent including impacts from higher maintenance and the winter storm. Natural gas volumes increased 12 percent driven by higher seasonal demand in Europe. During the quarter, production volumes in the Permian averaged 394,000 oil-equivalent barrels per day, an increase of 12 percent from the prior year. The focus remains on continuing to grow positive free cash flow by lowering overall development costs and increasing recovery through efficiency gains and technology applications. Downstream Industry fuels margins improved from the fourth quarter, but remained below 10-year-lows driven by market oversupply and high product inventory levels. Lubricants delivered strong performance, underpinned by lower costs and improved margins. Despite winter storm disruptions, overall refining throughput was essentially flat with the fourth quarter as the company managed refinery operations in line with fuel demand and integrated chemical manufacturing needs. Chemical Industry margins improved further in the quarter reflecting continued strong demand, global shipping constraints, and ongoing supply disruptions, particularly in North America, where the polyethylene and polypropylene markets were affected by severe winter weather in Texas. Strong first quarter Chemical earnings performance of $1.4 billion was supported by robust base operations capturing high margins and continued delivery of cost efficiencies. ExxonMobil announced it is pursuing three new advanced recycling initiatives in the U.S. and Europe that further advance our commitment to sustainability and capture value from plastic waste at scale. The company plans to begin marketing certified circular plastics products later this year. Strengthening the Portfolio ExxonMobil signed an agreement valued at more than $1 billion for the sale of most of its non-operated upstream assets in the United Kingdom central and northern North Sea. The sale price, subject to closing adjustments, has potential additional upside of up to $300 million based on contingent payments associated with future commodity price increases. The transaction is expected to close near mid-year 2021, subject to regulatory and third-party approvals. The company is progressing plans to convert both its Altona, Australia refinery, and Slagen refinery in Norway to fuel import terminals, ensuring ongoing, reliable fuel supply for their respective local markets. Final decisions were made following local consultation processes with employees and their representatives as part of extensive reviews of the long-term economic viability of both facilities. Capital Allocation and Structural Cost Improvement The company's long-term capital allocation priorities remain investing in advantaged projects to drive cash flow, strengthening the balance sheet and maintaining a reliable dividend. ExxonMobil’s 2021 capital program remains at $16 billion to $19 billion. If market conditions continue above the company's planning basis, additional cash will be used to accelerate deleveraging. In addition to $3 billion in structural cost reductions already achieved in 2020, the company is on pace to achieve $3 billion of further structural efficiencies through 2023 for a total of $6 billion relative to 2019. Efforts to identify additional structural savings resulting from the reorganizations completed in 2019 are continuing. Reducing Emissions and Advancing Low Carbon Solutions The company announced the creation of ExxonMobil Low Carbon Solutions, a new business to commercialize its extensive low-carbon technology portfolio, with an initial focus on carbon capture and storage (CCS), the process of sequestering industrial emissions and safely storing them permanently underground. CCS is considered one of the critical technologies required to achieve society’s net-zero ambitions and the climate goals outlined in the Paris Agreement. In April, ExxonMobil introduced the innovative concept of a multi-industry CCS hub along the Houston Ship Channel and surrounding industrial areas to capture CO2 emissions from area industry, including petrochemical, manufacturing and power generation facilities. The concept would require large-scale collaboration and policy advancements among governments, private industry, and local communities. ExxonMobil became the first company to file an application with the U.S. Environmental Protection Agency (EPA) to use new aerial technologies to detect methane emissions at oil and natural gas sites. ExxonMobil and Porsche are testing advanced biofuels and renewable, lower-carbon eFuels, as part of a new agreement to find pathways toward potential future consumer adoption of fuels that could significantly reduce emissions. Ongoing Board Refreshment During the quarter, ExxonMobil announced the elections of Michael Angelakis, Jeffrey Ubben, and Wan Zulkiflee to its board of directors. With the addition of the new members, the ExxonMobil board increased to 13 directors, 12 of whom are independent. The company has added six new independent directors since 2017 with specific experience in the areas of climate science, asset and risk management, capital allocation, energy and business transition, investor perspectives, and additional energy industry experience. Results and Volume Summary Millions of Dollars 1Q 1Q (unless noted) 2021 2020 Change Comments Upstream U.S. 363 (704) +1,067 Winter storm impact more than offset by higher prices and reduced expenses; prior quarter unfavorable identified items (impairment +315, inventory valuation +45) Non-U.S. 2,191 1,240 +951 Higher prices and reduced expenses, partly offset by lower volumes and unfavorable foreign exchange; prior quarter unfavorable identified items (inventory valuation +218, impairment +41) Total 2,554 536 +2,018 Winter storm -240, prices +1,690, volume -320, expenses +430, identified items +620, other -160 Production (koebd) 3,787 4,046 -259 Liquids -222 kbd: government mandates, lower entitlements, and winter storm impact (-25) Gas -223 mcfd: decline, higher downtime/maintenance, winter storm impact (-105), and Groningen production limit, partly offset by higher demand and project growth Downstream U.S. (113) (101) -12 Winter storm impact and lower margins driven by weaker industry refining conditions, partly offset by reduced expenses and favorable other impacts; prior quarter unfavorable identified items (+411, mainly inventory valuation) Non-U.S. (277) (510) +233 Lower margins including net unfavorable mark to market impact on unsettled derivatives, net unfavorable one-time items, and unfavorable foreign exchange, partly offset by reduced expenses; prior quarter unfavorable identified items (inventory valuation +1,196, impairments +335) Total (390) (611) +221 Winter storm -130, margins -1,880, expenses +410, identified items +1,940, forex/other -120 Petroleum Product Sales (kbd) 4,881 5,287 -406 Chemical U.S. 715 288 +427 Winter storm impact more than offset by higher margins, stronger demand, and reduced expenses; prior quarter unfavorable identified item (+90, impairment) Non-U.S. 700 (144) +844 Higher margins, stronger demand, reduced expenses, and favorable foreign exchange; prior quarter unfavorable identified items (+232, mainly inventory valuation) Total 1,415 144 +1,271 Winter storm -230, margins +740, demand +130, expenses +240, identified items +320, forex/other +70 Prime Product Sales (kt) 6,446 6,237 +209 Corporate and financing (849) (679) -170 Higher retirement-related expenses Results and Volume Summary Millions of Dollars 1Q 4Q (unless noted) 2021 2020 Change Comments Upstream U.S. 363 (16,803) +17,166 Higher prices and reduced expenses, partly offset by winter storm impact and lower volumes; prior quarter unfavorable identified item (impairment +16,777) Non-U.S. 2,191 (1,729) +3,920 Higher prices and seasonal gas volumes; prior quarter unfavorable identified items (impairment +2,203, tax item +297) Total 2,554 (18,532) +21,086 Winter storm -240, prices +2,070, volume -80, expenses +170, identified items +19,280, other -110 Production (koebd) 3,787 3,689 +98 Liquids -67 kbd: lower entitlements, winter storm impact (-25), and increased downtime/maintenance, partly offset by reduced government mandates Gas +988 mcfd: higher seasonal demand, reduced downtime/maintenance, and net growth, partly offset by winter storm impact (-105) Downstream U.S. (113) (514) +401 Higher margins on improved industry refining conditions, reduced expenses, and prior quarter unfavorable LIFO inventory impact (+78), partly offset by winter storm impact, lower manufacturing volumes, and net unfavorable one-time items Non-U.S. (277) (697) +420 Reduced expenses and higher margins driven by more favorable industry refining conditions, offset by prior quarter favorable LIFO inventory impact (-207), unfavorable foreign exchange, terminal conversion costs, and lower demand; prior quarter unfavorable identified items (impairment +258, tax item +262) Total (390) (1,211) +821 Winter storm -130, margins +490, demand -40, expenses +380, manufacturing -40, identified items +520, LIFO/forex -210, other -150 Petroleum Product Sales (kbd) 4,881 4,833 +48 Chemical U.S. 715 461 +254 Winter storm more than offset by stronger margins, demand, and reduced expenses Non-U.S. 700 230 +470 Higher margins, reduced expenses, and prior quarter unfavorable LIFO inventory impact (+84) and other charges Total 1,415 691 +724 Winter storm -230, margins +500, demand +100, expenses +150, identified items +20, LIFO/other +180 Prime Product Sales (kt) 6,446 6,643 -197 Corporate and financing (849) (1,018) +169 Absence of identified items (mainly severance +330), partly offset by net unfavorable tax impacts and retirement-related expenses Cash Flow from Operations and Asset Sales excluding Working Capital Millions of Dollars 1Q 2021 Comments Net income (loss) including noncontrolling interests 2,796 Including $66 million noncontrolling interests Depreciation and depletion 5,004 Changes in operational working capital 1,953 Higher net payables and inventory draw Other (489) Cash Flow from Operating 9,264 Activities (U.S. GAAP) Asset sales 307 Including U.K. upstream divestment deposit and U.S. upstream asset sales Cash Flow from Operations 9,571 and Asset Sales Changes in operational working capital (1,953) Cash Flow from Operations 7,618 and Asset Sales excluding Working Capital ExxonMobil will discuss financial and operating results and other matters during a webcast at 8:30 a.m. Central Time on April 30, 2021. To listen to the event or access an archived replay, please visit www.exxonmobil.com. Cautionary Statement Outlooks, projections, goals, targets, descriptions of strategic plans and objectives, and other statements of future events or conditions in this release are forward-looking statements. Actual future results, including financial and operating performance; planned capital and cash operating expense reductions and ability to meet or exceed announced reduction objectives; plans to reduce future emissions intensity and the expected resulting absolute emission reductions; progressing carbon capture projects and results; total capital expenditures and mix; cash flow, dividend and shareholder returns; business and project plans, timing, costs and capacities; resource recoveries and production rates; and accounting and financial reporting effects resulting from market developments and ExxonMobil’s responsive actions, could differ materially due to a number of factors. These include the continuity of our board of directors and their strategic oversight; global or regional changes in the supply and demand for oil, natural gas, petrochemicals, and feedstocks and other market conditions that impact prices and differentials; the impact of company actions to protect the health and safety of employees, vendors, customers, and communities; actions of competitors and commercial counterparties; the ability to access short- and long-term debt markets on a timely and affordable basis; the severity, length and ultimate impact of COVID-19 and government responses on people and economies; reservoir performance; the outcome of exploration projects and timely completion of development and construction projects; changes in law, taxes, or regulation including environmental regulations, and timely granting of governmental permits; government policies and support for low carbon technologies like carbon capture; war, trade agreements and patterns, shipping blockades or harassment, and other political or security disturbances; opportunities for and regulatory approval of potential investments or divestments; the actions of competitors; the capture of efficiencies within and between business lines and the ability to maintain near-term cost reductions as ongoing efficiencies while maintaining future competitive positioning; unforeseen technical or operating difficulties; the development and competitiveness of alternative energy and emission reduction technologies; the results of research programs; the ability to bring new technologies to commercial scale on a cost-competitive basis; general economic conditions including the occurrence and duration of economic recessions; and other factors discussed under Item 1A. Risk Factors of ExxonMobil’s 2020 Form 10-K. Frequently Used Terms and Non-GAAP Measures This press release includes cash flow from operations and asset sales. Because of the regular nature of our asset management and divestment program, we believe it is useful for investors to consider proceeds associated with the sales of subsidiaries, property, plant and equipment, and sales and returns of investments together with cash provided by operating activities when evaluating cash available for investment in the business and financing activities. A reconciliation to net cash provided by operating activities for first quarter 2021 is shown on page 6 and for 2021 and 2020 periods in Attachment V. This press release also includes cash flow from operations and asset sales excluding working capital. We believe it is useful for investors to consider these numbers in comparing the underlying performance of our business across periods when there are significant period-to-period differences in the amount of changes in working capital. A reconciliation to net cash provided by operating activities for first quarter 2021 is shown on page 6 and for 2021 and 2020 periods in Attachment V. This press release also includes earnings/(loss) excluding identified items, which are earnings/(loss) excluding individually significant non-operational events with an absolute corporate total earnings impact of at least $250 million in a given quarter. The earnings/(loss) impact of an identified item for an individual segment may be less than $250 million when the item impacts several periods or several segments. We believe it is useful for investors to consider these figures in comparing the underlying performance of our business across periods when one, or both, periods include identified items. A reconciliation to earnings is shown for 2021 and 2020 periods in Attachments II-a and II-b. Corresponding per share amounts are shown on page 1 and in Attachment II-a, including a reconciliation to earnings/(loss) per common share – assuming dilution (U.S. GAAP). This press release also includes total taxes including sales-based taxes. This is a broader indicator of the total tax burden on the corporation’s products and earnings, including certain sales and value-added taxes imposed on and concurrent with revenue-producing transactions with customers and collected on behalf of governmental authorities (“sales-based taxes”). It combines “Income taxes” and “Total other taxes and duties” with sales‑based taxes, which are reported net in the income statement. We believe it is useful for the corporation and its investors to understand the total tax burden imposed on the corporation’s products and earnings. A reconciliation to total taxes is shown as part of the Estimated Key Financial and Operating Data in Attachment I. References to the resource base and other quantities of oil, natural gas or condensate may include estimated amounts that are not yet classified as “proved reserves” under SEC definitions, but which are expected to be ultimately recoverable. The term “project” as used in this release can refer to a variety of different activities and does not necessarily have the same meaning as in any government payment transparency reports. Further information on ExxonMobil’s frequently used financial and operating measures and other terms including \"Cash operating expenses\", “Cash flow from operations and asset sales”, and “Total taxes including sales-based taxes” is contained under the heading “Frequently Used Terms” available through the “Investors” section of our website at www.exxonmobil.com. Reference to Earnings References to corporate earnings mean net income attributable to ExxonMobil (U.S. GAAP) from the consolidated income statement. Unless otherwise indicated, references to earnings, Upstream, Downstream, Chemical and Corporate and financing segment earnings, and earnings per share are ExxonMobil’s share after excluding amounts attributable to noncontrolling interests. Exxon Mobil Corporation has numerous affiliates, many with names that include ExxonMobil, Exxon, Mobil, Esso, and XTO. For convenience and simplicity, those terms and terms such as corporation, company, our, we, and its are sometimes used as abbreviated references to specific affiliates or affiliate groups. Similarly, ExxonMobil has business relationships with thousands of customers, suppliers, governments, and others. For convenience and simplicity, words such as venture, joint venture, partnership, co-venturer, and partner are used to indicate business and other relationships involving common activities and interests, and those words may not indicate precise legal relationships. Important Additional Information Regarding Proxy Solicitation Exxon Mobil Corporation (“ExxonMobil”) has filed a definitive proxy statement and form of associated BLUE proxy card with the U.S. Securities and Exchange Commission (the “SEC”) in connection with the solicitation of proxies for ExxonMobil’s 2021 Annual Meeting (the “Proxy Statement”). ExxonMobil, its directors and certain of its executive officers will be participants in the solicitation of proxies from shareholders in respect of the 2021 Annual Meeting. Information regarding the names of ExxonMobil’s directors and executive officers and their respective interests in ExxonMobil by security holdings or otherwise is set forth in the Proxy Statement. To the extent holdings of such participants in ExxonMobil’s securities are not reported, or have changed since the amounts described, in the Proxy Statement, such changes have been reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Change in Ownership on Form 4 filed with the SEC. Details concerning the nominees of ExxonMobil’s Board of Directors for election at the 2021 Annual Meeting are included in the Proxy Statement. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SHAREHOLDERS OF THE COMPANY ARE URGED TO READ ALL RELEVANT DOCUMENTS FILED WITH OR FURNISHED TO THE SEC, INCLUDING THE COMPANY’S DEFINITIVE PROXY STATEMENT AND ANY SUPPLEMENTS THERETO AND ACCOMPANYING BLUE PROXY CARD, BECAUSE THEY CONTAIN IMPORTANT INFORMATION. Investors and shareholders can obtain a copy of the Proxy Statement and other relevant documents filed by ExxonMobil free of charge from the SEC’s website, www.sec.gov. ExxonMobil’s shareholders can also obtain, without charge, a copy of the Proxy Statement and other relevant filed documents by directing a request by mail to ExxonMobil Shareholder Services at 5959 Las Colinas Boulevard, Irving, Texas, 75039-2298 or at shareholderrelations@exxonmobil.com or from the investor relations section of ExxonMobil’s website, www.exxonmobil.com/investor. Estimated Key Financial and Operating Data Attachment I Exxon Mobil Corporation First Quarter 2021 (millions of dollars, unless noted) First First Fourth Quarter Quarter Quarter 2021 2020 2020 Earnings (Loss) / Earnings (Loss) Per Share Total revenues and other income 59,147 56,158 46,540 Total costs and other deductions 55,555 56,416 73,153 Income (loss) before income taxes 3,592 (258) (26,613) Income taxes 796 512 (6,010) Net income (loss) including noncontrolling interests 2,796 (770) (20,603) Net income (loss) attributable to noncontrolling interests 66 (160) (533) Net income (loss) attributable to ExxonMobil (U.S. GAAP) 2,730 (610) (20,070) Earnings (loss) per common share (dollars) 0.64 (0.14) (4.70) Earnings (loss) per common share - assuming dilution (dollars) 0.64 (0.14) (4.70) Exploration expenses, including dry holes 164 288 595 Other Financial Data Dividends on common stock Total 3,720 3,719 3,715 Per common share (dollars) 0.87 0.87 0.87 Millions of common shares outstanding At period end 4,234 4,228 4,233 Average - assuming dilution 4,272 4,270 4,272 ExxonMobil share of equity at period end 156,974 182,079 157,150 ExxonMobil share of capital employed at period end 222,610 244,026 227,137 Income taxes 796 512 (6,010) Total other taxes and duties 7,283 7,497 7,344 Total taxes 8,079 8,009 1,334 Sales-based taxes 4,662 4,485 4,364 Total taxes including sales-based taxes 12,741 12,494 5,698 ExxonMobil share of income taxes of equity companies 600 460 285 Attachment II-a Exxon Mobil Corporation First Quarter 2021 First First Fourth $ Millions Quarter Quarter Quarter 2021 2020 2020 Earnings/(Loss) (U.S. GAAP) 2,730 (610) (20,070) Identified Items Included in Earnings/(Loss) Noncash inventory valuation - lower of cost or market — (2,096) — Impairments — (787) (19,273) Tax — — (581) Other items (severance - global workforce review) (31) — (326) Corporate total (31) (2,883) (20,180) Earnings Excluding Identified Items 2,761 2,273 110 $ Per Common Share1 Earnings/(Loss) Per Common Share Assuming Dilution (U.S. GAAP) 0.64 (0.14) (4.70) Identified Items Included in Earnings/(Loss) Per Common Share Assuming Dilution Noncash inventory valuation - lower of cost or market — (0.49) — Impairments — (0.18) (4.51) Tax — — (0.14) Other items (severance - global workforce review) (0.01) — (0.08) Corporate total (0.01) (0.67) (4.73) Earnings Excluding Identified Items Per Common Share Assuming Dilution 0.65 0.53 0.03 ¹ Computed using the average number of shares outstanding during each period. Attachment II-b Exxon Mobil Corporation First Quarter 2021 (millions of dollars) First First Fourth Quarter Quarter Quarter 2021 2020 2020 Earnings/(Loss) (U.S. GAAP) Upstream United States 363 (704) (16,803) Non-U.S. 2,191 1,240 (1,729) Downstream United States (113) (101) (514) Non-U.S. (277) (510) (697) Chemical United States 715 288 461 Non-U.S. 700 (144) 230 Corporate and financing (849) (679) (1,018) Net income (loss) attributable to ExxonMobil 2,730 (610) (20,070) Identified Items Included in Earnings/(Loss) U.S. Upstream Impairments — (315) (16,777) Other items (Inventory valuation) — (45) — Non-U.S. Upstream Impairments — (41) (2,203) Tax Items — — (297) Other Items (Inventory valuation) — (218) — U.S. Downstream Other Items (Inventory valuation, Impairment) — (411) — Non-U.S. Downstream Impairments — (335) (258) Tax Items — — (262) Other Items (Inventory valuation) — (1,196) — U.S. Chemical Impairment — (90) — Non-U.S. Chemical Tax Items — — (22) Other Items (Inventory valuation, Impairment) — (232) — Corporate and financing Other Items (Severance - global workforce review, Impairment) (31) — (361) Corporate total (31) (2,883) (20,180) Earnings/(Loss) Excluding Identified Items Upstream United States 363 (344) (26) Non-U.S. 2,191 1,499 771 Downstream United States (113) 310 (514) Non-U.S. (277) 1,021 (177) Chemical United States 715 378 461 Non-U.S. 700 88 252 Corporate and financing (818) (679) (657) Corporate total 2,761 2,273 110 Attachment III Exxon Mobil Corporation First Quarter 2021 First First Fourth Quarter Quarter Quarter 2021 2020 2020 Net production of crude oil, natural gas liquids, bitumen and synthetic oil, thousand barrels per day (kbd) United States 665 699 719 Canada / Other Americas 575 558 619 Europe 35 30 32 Africa 253 360 258 Asia 691 795 658 Australia / Oceania 39 38 39 Worldwide 2,258 2,480 2,325 Natural gas production available for sale, million cubic feet per day (mcfd) United States 2,767 2,825 2,686 Canada / Other Americas 216 317 253 Europe 1,403 1,293 848 Africa 24 7 12 Asia 3,599 3,710 3,225 Australia / Oceania 1,164 1,244 1,161 Worldwide 9,173 9,396 8,185 Oil-equivalent production (koebd)1 3,787 4,046 3,689 ¹ Natural gas converted to an oil-equivalent basis at 6 million cubic feet per 1 thousand barrels. Attachment IV Exxon Mobil Corporation First Quarter 2021 First First Fourth Quarter Quarter Quarter 2021 2020 2020 Refinery throughput (kbd) United States 1,532 1,558 1,594 Canada 364 383 359 Europe 1,153 1,295 1,130 Asia Pacific 545 637 522 Other 157 187 150 Worldwide 3,751 4,060 3,755 Petroleum product sales (kbd) United States 2,077 2,231 2,128 Canada 409 456 415 Europe 1,272 1,403 1,227 Asia Pacific 665 708 645 Other 458 489 418 Worldwide 4,881 5,287 4,833 Gasolines, naphthas 1,996 2,122 2,039 Heating oils, kerosene, diesel 1,692 1,867 1,739 Aviation fuels 183 383 172 Heavy fuels 257 256 237 Specialty products 753 659 646 Worldwide 4,881 5,287 4,833 Chemical prime product sales, thousand metric tons (kt) United States 2,190 2,195 2,467 Non-U.S. 4,256 4,042 4,176 Worldwide 6,446 6,237 6,643 Attachment V Exxon Mobil Corporation First Quarter 2021 (millions of dollars) First First Fourth Quarter Quarter Quarter 2021 2020 2020 Capital and Exploration Expenditures Upstream United States 810 2,798 1,122 Non-U.S. 1,547 2,328 1,812 Total 2,357 5,126 2,934 Downstream United States 271 747 488 Non-U.S. 199 487 674 Total 470 1,234 1,162 Chemical United States 208 597 435 Non-U.S. 98 185 240 Total 306 782 675 Other — 1 — Worldwide 3,133 7,143 4,771 Cash Flow from Operations and Asset Sales excluding Working Capital Net cash provided by operating activities (U.S. GAAP) 9,264 6,274 4,005 Proceeds associated with asset sales 307 86 770 Cash flow from operations and asset sales 9,571 6,360 4,775 Changes in operational working capital (1,953) 942 114 Cash flow from operations and asset sales 7,618 7,302 4,889 excluding working capital Attachment VI Exxon Mobil Corporation Earnings/(Loss) $ Millions $ Per Common Share1 2017 First Quarter 4,010 0.95 Second Quarter 3,350 0.78 Third Quarter 3,970 0.93 Fourth Quarter 8,380 1.97 Year 19,710 4.63 2018 First Quarter 4,650 1.09 Second Quarter 3,950 0.92 Third Quarter 6,240 1.46 Fourth Quarter 6,000 1.41 Year 20,840 4.88 2019 First Quarter 2,350 0.55 Second Quarter 3,130 0.73 Third Quarter 3,170 0.75 Fourth Quarter 5,690 1.33 Year 14,340 3.36 2020 First Quarter (610) (0.14) Second Quarter (1,080) (0.26) Third Quarter (680) (0.15) Fourth Quarter (20,070) (4.70) Year (22,440) (5.25) 2021 First Quarter 2,730 0.64 1 Computed using the average number of shares outstanding during each period.",
    "url": "https://www.businesswire.com/news/home/20210430005293/en/ExxonMobil-Earns-2.7-Billion-in-First-Quarter-2021",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T07:29:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 07:34:00",
    "publisher": "Reuters",
    "title": "Exxon posts first profit in five quarters on higher oil prices",
    "image": "https://images.financialmodelingprep.com/news/exxon-posts-first-profit-in-five-quarters-on-higher-20210430.jpg",
    "site": "reuters.com",
    "text": "Top U.S. oil producer Exxon Mobil Corp on Friday posted its first profit in five quarters, as higher oil and gas prices offset costs from a deep freeze in February.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-results/exxon-posts-first-profit-in-five-quarters-on-higher-oil-prices-idUSKBN2CH1EZ",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T07:34:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 07:43:47",
    "publisher": "Market Watch",
    "title": "Exxon Mobil beats profit and revenue expectation as commodities prices rise and costs fall; stock pulls back",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-beats-profit-and-revenue-expectation-as-commodities-20210430.jpg",
    "site": "marketwatch.com",
    "text": "Exxon Mobil Corp. reported Friday a first-quarter adjusted profit and revenue that rose above expectations, boosted by higher commodity prices and actions to cut costs. The oil and gas giant's stock slipped 0.5% in premarket trading, putting it on track to snap a five-day win streak in which it climbed 6.6%.",
    "url": "https://www.marketwatch.com/story/exxon-mobil-beats-profit-and-revenue-expectation-as-commodities-prices-rise-and-costs-fall-stock-pulls-back-2021-04-30",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T07:43:47-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 08:01:28",
    "publisher": "Benzinga",
    "title": "Recap: Exxon Mobil Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/recap-exxon-mobil-q1-earnings-20210430.jpg",
    "site": "benzinga.com",
    "text": "Shares of Exxon Mobil (NYSE:XOM) decreased 0.7% in pre-market trading after the company reported Q1 results. Quarterly Results Earnings per share rose 22.64% year over year to $0.65, which beat the estimate of $0.59.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20886123/recap-exxon-mobil-q1-earnings",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T08:01:28-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 08:02:06",
    "publisher": "CNBC",
    "title": "Exxon posts a profit, snapping four-quarter loss streak",
    "image": "https://images.financialmodelingprep.com/news/exxon-posts-a-profit-snapping-fourquarter-loss-streak-20210430.jpeg",
    "site": "cnbc.com",
    "text": "Exxon posted a profit during the first quarter as oil prices recover.",
    "url": "https://www.cnbc.com/2021/04/30/exxon-xom-earnings-q1-2021.html",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T08:02:06-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 09:10:31",
    "publisher": "Investopedia",
    "title": "Exxon Q1 2021 Earnings Report Recap",
    "image": "https://images.financialmodelingprep.com/news/exxon-q1-2021-earnings-report-recap-20210430.jpg",
    "site": "investopedia.com",
    "text": "Exxon's (XOM) Q1 earnings narrowly beat expectations as revenue surpassed estimates by a large margin. Upstream segment net income missed forecasts.",
    "url": "https://www.investopedia.com/exxon-q1-fy2021-earnings-report-recap-5181403",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T09:10:31-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 09:39:40",
    "publisher": "Invezz",
    "title": "3 key takeaways from Exxon Mobil's Q1 earnings report",
    "image": "https://images.financialmodelingprep.com/news/3-key-takeaways-from-exxon-mobils-q1-earnings-report-20210430.jpg",
    "site": "invezz.com",
    "text": "Exxon Mobil Corp. (NYSE: XOM) reported its financial results for the fiscal first quarter on Friday that beat Wall Street estimates. The company attributed its hawkish performance to cut costs and higher commodity prices.",
    "url": "https://invezz.com/news/2021/04/30/3-key-takeaways-from-exxon-mobils-q1-earnings-report/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T09:39:40-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 09:46:32",
    "publisher": "Zacks Investment Research",
    "title": "Exxon Mobil (XOM) Surpasses Q1 Earnings and Revenue Estimates",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-surpasses-q1-earnings-and-revenue-estimates-20210430.jpg",
    "site": "zacks.com",
    "text": "Exxon (XOM) delivered earnings and revenue surprises of 10.17% and 7.24%, respectively, for the quarter ended March 2021. Do the numbers hold clues to what lies ahead for the stock?",
    "url": "https://www.zacks.com/stock/news/1478402/exxon-mobil-xom-surpasses-q1-earnings-and-revenue-estimates",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T09:46:32-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 10:31:03",
    "publisher": "Zacks Investment Research",
    "title": "Consumer Spending Increased in March",
    "image": "https://images.financialmodelingprep.com/news/consumer-spending-increased-in-march-20210430.jpg",
    "site": "zacks.com",
    "text": "Consumer Spending Increased in March",
    "url": "https://www.zacks.com/stock/news/1479110/consumer-spending-increased-in-march",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T10:31:03-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 12:01:28",
    "publisher": "Zacks Investment Research",
    "title": "ExxonMobil (XOM) Q1 Earnings and Revenues Beat Estimates",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-xom-q1-earnings-and-revenues-beat-estimates-20210430.jpg",
    "site": "zacks.com",
    "text": "Higher chemical margins and improved realized commodity prices aid ExxonMobil's (XOM) Q1 earnings.",
    "url": "https://www.zacks.com/stock/news/1479343/exxonmobil-xom-q1-earnings-and-revenues-beat-estimates",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T12:01:28-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 12:36:55",
    "publisher": "Benzinga",
    "title": "Where Exxon Mobil Stands With Analysts",
    "image": "https://images.financialmodelingprep.com/news/where-exxon-mobil-stands-with-analysts-20210430.jpg",
    "site": "benzinga.com",
    "text": "Exxon Mobil (NYSE:XOM) has observed the following analyst ratings within the last quarter:   Last 30 Days 1 Month Ago 2 Months Ago 3 Months Ago Bullish 0 0 0 0 Somewhat Bullish 0 0 2 0 Indifferent 0 1 2 2 Somewhat Bearish 0 0 0 0 Bearish 0 0 0 0 9 analysts offering 12-month price targets in the last 3 months for Exxon Mobil evaluate the company at an average price target of $60.22 with a high of $71.00 and a low of $55.00.",
    "url": "https://www.benzinga.com/analyst-ratings/21/04/20893039/where-exxon-mobil-stands-with-analysts",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T12:36:55-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 12:55:00",
    "publisher": "The Motley Fool",
    "title": "Can This Rebounding Sector Lead the Stock Market Higher?",
    "image": "https://images.financialmodelingprep.com/news/can-this-rebounding-sector-lead-the-stock-market-higher-20210430.jpg",
    "site": "fool.com",
    "text": "Earnings season is reflecting a big bounce for this industry, but some wonder how much more upward momentum it could have.",
    "url": "https://www.fool.com/investing/2021/04/30/can-this-rebounding-sector-lead-the-stock-market-h/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T12:55:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 13:29:07",
    "publisher": "Seeking Alpha",
    "title": "Exxon Mobil Corporation (XOM) CEO Darren Woods on Q1 2021 Results - Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-xom-ceo-darren-woods-on-q1-20210430.jpg",
    "site": "seekingalpha.com",
    "text": "Exxon Mobil Corporation (XOM) CEO Darren Woods on Q1 2021 Results - Earnings Call Transcript",
    "url": "https://seekingalpha.com/article/4422992-exxon-mobil-corporation-xom-ceo-darren-woods-on-q1-2021-results-earnings-call-transcript",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T13:29:07-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 14:06:00",
    "publisher": "Reuters",
    "title": "Exxon CEO says advancing U.S. carbon capture project with rivals, government",
    "image": "https://images.financialmodelingprep.com/news/exxon-ceo-says-advancing-us-carbon-capture-project-with-rivals-20210430.jpg",
    "site": "reuters.com",
    "text": "Exxon Mobil Corp is advancing a carbon capture and storage project along the U.S. Gulf of Mexico through talks with rivals and government officials, Chief Executive Darren Woods said in an interview on Friday.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-carbon-capture-ceo/exxon-ceo-says-advancing-u-s-carbon-capture-project-with-rivals-government-idUSKBN2CH2EB",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T14:06:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 17:29:30",
    "publisher": "InvestorPlace",
    "title": "4 Top Stock Trades for Monday: XOM, CVX, ROKU, NIO",
    "image": "https://images.financialmodelingprep.com/news/4-top-stock-trades-for-monday-xom-cvx-roku-20210430.jpg",
    "site": "investorplace.com",
    "text": "Exxon Mobil, Chevron, Roku and Nio were our top stock trades for Monday. Now, let's look at a handful of charts for next week and next month.",
    "url": "https://investorplace.com/2021/04/4-top-stock-trades-for-monday-xom-cvx-roku-nio/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T17:29:30-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-04-30 20:28:46",
    "publisher": "The Motley Fool",
    "title": "ExxonMobil Beats Convincingly on Q1 Revenue, Earnings",
    "image": "https://images.financialmodelingprep.com/news/exxonmobil-beats-convincingly-on-q1-revenue-earnings-20210430.jpg",
    "site": "fool.com",
    "text": "The better-than-expected performance should add to the cautious optimism enveloping the energy sector these days.",
    "url": "https://www.fool.com/investing/2021/04/30/exxon-mobil-beats-convincingly-on-q1-revenue-earni/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-04-30T20:28:46-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-01 10:00:00",
    "publisher": "Seeking Alpha",
    "title": "5 Undervalued Income Stocks That Offer Stability In Uncertain Times",
    "image": "https://images.financialmodelingprep.com/news/5-undervalued-income-stocks-that-offer-stability-in-uncertain-20210501.jpg",
    "site": "seekingalpha.com",
    "text": "Markets have been running to new all-time highs, but there are some risk factors that investors should keep in mind. Moving to cash isn't a great choice, due to rising inflationary pressures.",
    "url": "https://seekingalpha.com/article/4423140-5-undervalued-income-stocks-offer-stability-in-uncertain-times",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-01T10:00:00-04:00",
    "date_et": "2021-05-01"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-02 12:01:19",
    "publisher": "Seeking Alpha",
    "title": "Exxon Mobil: Buy This 6.1% Yielding Energy Champ Today",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-buy-this-61-yielding-energy-champ-today-20210502.jpg",
    "site": "seekingalpha.com",
    "text": "The reopening of the US economy and recovering crude prices could fuel XOM's free cash flow. Exxon Mobil Corporation just posted its first profit in more than a year.",
    "url": "https://seekingalpha.com/article/4423581-exxon-mobil-stock-xom-buy-this-6-percent-yielding-energy-champ-today",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-02T12:01:19-04:00",
    "date_et": "2021-05-02"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-03 09:34:48",
    "publisher": "Benzinga",
    "title": "Where Exxon Mobil Stands With Analysts",
    "image": "https://images.financialmodelingprep.com/news/where-exxon-mobil-stands-with-analysts-20210503.jpg",
    "site": "benzinga.com",
    "text": "Within the last quarter, Exxon Mobil (NYSE:XOM) has observed the following analyst ratings: Last 30 Days 1 Month Ago 2 Months Ago 3 Months Ago Bullish 0 0 0 0 Somewhat Bullish 0 0 2 0 Indifferent 0 1 2 2 Somewhat Bearish 0 0 0 0 Bearish 0 0 0 0 9 analysts offering 12-month price targets in the last 3 months for Exxon Mobil evaluate the company at an average price target of $60.22 with a high of $71.00 and a low of $55.00.",
    "url": "https://www.benzinga.com/analyst-ratings/21/05/20915015/where-exxon-mobil-stands-with-analysts",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-03T09:34:48-04:00",
    "date_et": "2021-05-03"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-03 10:31:32",
    "publisher": "Zacks Investment Research",
    "title": "4 Stocks From the Oil & Gas Drilling Industry to Watch Out For",
    "image": "https://images.financialmodelingprep.com/news/4-stocks-from-the-oil-gas-drilling-industry-to-20210503.jpg",
    "site": "zacks.com",
    "text": "4 Stocks From the Oil & Gas Drilling Industry to Watch Out For",
    "url": "https://www.zacks.com/commentary/1493016/4-stocks-from-the-oil-gas-drilling-industry-to-watch-out-for",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-03T10:31:32-04:00",
    "date_et": "2021-05-03"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-03 14:48:17",
    "publisher": "GuruFocus",
    "title": "Warren Buffett: Top Stocks by Market Cap Different Today Compared to 1989",
    "image": "https://images.financialmodelingprep.com/news/warren-buffett-top-stocks-by-market-cap-different-today-20210503.jpg",
    "site": "gurufocus.com",
    "text": "Berkshire Hathaway Inc. ( , Financial)\">BRK.A)( BRK.B , Financial) CEO Warren Buffett (Trades, Portfolio) said during the insurance conglomerate's annual shareholder meeting on Saturday that the top-20 stocks by market cap today are significantly different than the top-20 stocks by market cap in 1989.",
    "url": "https://www.gurufocus.com/news/1414087/warren-buffett-top-stocks-by-market-cap-different-today-compared-to-1989",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-03T14:48:17-04:00",
    "date_et": "2021-05-03"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-03 16:38:00",
    "publisher": "The Motley Fool",
    "title": "3 Stocks I'm Never Selling",
    "image": "https://images.financialmodelingprep.com/news/3-stocks-im-never-selling-20210503.jpg",
    "site": "fool.com",
    "text": "These three stocks are under lock and key because I expect big things from them in the future.",
    "url": "https://www.fool.com/investing/2021/05/03/3-stocks-im-never-selling/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-03T16:38:00-04:00",
    "date_et": "2021-05-03"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-04 07:16:00",
    "publisher": "Reuters",
    "title": "Climate activists urge BlackRock, Vanguard to vote against Exxon directors",
    "image": "https://images.financialmodelingprep.com/news/climate-activists-urge-blackrock-vanguard-to-vote-against-exxon-20210504.jpg",
    "site": "reuters.com",
    "text": "Climate activists are prodding Exxon Mobil Corp's top shareholders to vote against the reelection of two directors, a move that could boost a hedge fund's proxy fight to seat four candidates on the oil giant's board.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-proxy-shareholders/climate-activists-urge-blackrock-vanguard-to-vote-against-exxon-directors-idUSKBN2CL0XO",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-04T07:16:00-04:00",
    "date_et": "2021-05-04"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-04 11:47:07",
    "publisher": "Seeking Alpha",
    "title": "Exxon Mobil's Death Turns Out To Be Greatly Exaggerated",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobils-death-turns-out-to-be-greatly-exaggerated-20210504.jpg",
    "site": "seekingalpha.com",
    "text": "During 2020, consensus was that Exxon Mobil was in trouble and needed to cut its dividend. It did not, with management sticking to its guns on capital allocation priorities.",
    "url": "https://seekingalpha.com/article/4424022-exxon-mobils-death-turns-out-to-be-greatly-exaggerated",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-04T11:47:07-04:00",
    "date_et": "2021-05-04"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-04 12:02:02",
    "publisher": "Zacks Investment Research",
    "title": "Has Exxon Mobil (XOM) Outpaced Other Oils-Energy Stocks This Year?",
    "image": "https://images.financialmodelingprep.com/news/has-exxon-mobil-xom-outpaced-other-oilsenergy-stocks-this-20210504.jpg",
    "site": "zacks.com",
    "text": "Is (XOM) Outperforming Other Oils-Energy Stocks This Year?",
    "url": "https://www.zacks.com/stock/news/1499375/has-exxon-mobil-xom-outpaced-other-oils-energy-stocks-this-year",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-04T12:02:02-04:00",
    "date_et": "2021-05-04"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-04 15:15:21",
    "publisher": "GuruFocus",
    "title": "Exxon Mobil Starts 2021 Off on the Right Foot",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-starts-2021-off-on-the-right-foot-20210504.jpg",
    "site": "gurufocus.com",
    "text": "Exxon Mobil Corp. ( XOM , Financial) reported better-than-expected first-quarter earnings on April 30, extending the streak of earnings surprises to three quarters. The company benefited from higher oil prices and cost-cutting measures, reporting adjusted earnings per share of 65 cents, which was above the FactSet consensus estimate of 60 cents per share.",
    "url": "https://www.gurufocus.com/news/1415541/exxon-mobil-starts-2021-off-on-the-right-foot-",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-04T15:15:21-04:00",
    "date_et": "2021-05-04"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-05 15:32:00",
    "publisher": "Reuters",
    "title": "Exxon expects $200 million in charges this year for job cuts",
    "image": "https://images.financialmodelingprep.com/news/exxon-expects-200-million-in-charges-this-year-for-20210505.jpg",
    "site": "reuters.com",
    "text": "Exxon Mobil Corp on Wednesday said it estimates $200 million in charges this year related to job cuts, according to a regulatory filing.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-job-cuts/exxon-expects-200-million-in-charges-this-year-for-job-cuts-idUSKBN2CM26A",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-05T15:32:00-04:00",
    "date_et": "2021-05-05"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-07 08:18:00",
    "publisher": "The Motley Fool",
    "title": "My Top Oil Stock to Buy Right Now",
    "image": "https://images.financialmodelingprep.com/news/my-top-oil-stock-to-buy-right-now-20210507.jpg",
    "site": "fool.com",
    "text": "Strong oil prices bode well for the company, but they aren't the main reason to buy this top pipeline stock.",
    "url": "https://www.fool.com/investing/2021/05/07/my-top-oil-stock-to-buy-right-now/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-07T08:18:00-04:00",
    "date_et": "2021-05-07"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-07 13:34:00",
    "publisher": "Reuters",
    "title": "Union offered Exxon six-year deal with no raise first year - sources",
    "image": "https://images.financialmodelingprep.com/news/union-offered-exxon-sixyear-deal-with-no-raise-first-20210507.jpg",
    "site": "reuters.com",
    "text": "United Steelworkers union negotiators bargaining for a new contract at an Exxon Mobil Texas refinery offered a six-year deal with no pay raise in the first year, people familiar with the talks said, shortly before 650 workers were locked out of their jobs.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-refinery-labor-beaumont/union-offered-exxon-six-year-deal-with-no-raise-first-year-sources-idUSKBN2CO1TI",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-07T13:34:00-04:00",
    "date_et": "2021-05-07"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-10 12:13:00",
    "publisher": "Reuters",
    "title": "Exclusive: Iraq formally asks to buy $350 million Exxon oilfield share",
    "image": "https://images.financialmodelingprep.com/news/exclusive-iraq-formally-asks-to-buy-350-million-exxon-20210510.jpg",
    "site": "reuters.com",
    "text": "Iraq has formally asked to buy U.S. energy giant ExxonMobil's share in one of Iraq's biggest oilfields, West Qurna 1, the head of the state-run oil operating company said on Monday.",
    "url": "https://www.reuters.com/article/us-iraq-oil-exclusive/exclusive-iraq-formally-asks-to-buy-350-million-exxon-oilfield-share-idUSKBN2CR1SD",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-10T12:13:00-04:00",
    "date_et": "2021-05-10"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-10 12:46:31",
    "publisher": "Zacks Investment Research",
    "title": "TOT or XOM: Which Is the Better Value Stock Right Now?",
    "image": "https://images.financialmodelingprep.com/news/tot-or-xom-which-is-the-better-value-stock-20210510.jpg",
    "site": "zacks.com",
    "text": "TOT vs. XOM: Which Stock Is the Better Value Option?",
    "url": "https://www.zacks.com/stock/news/1530545/tot-or-xom-which-is-the-better-value-stock-right-now",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-10T12:46:31-04:00",
    "date_et": "2021-05-10"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-10 18:47:26",
    "publisher": "Zacks Investment Research",
    "title": "Exxon Mobil (XOM) Gains As Market Dips: What You Should Know",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-gains-as-market-dips-what-you-20210510.jpg",
    "site": "zacks.com",
    "text": "In the latest trading session, Exxon Mobil (XOM) closed at $62.58, marking a +0.24% move from the previous day.",
    "url": "https://www.zacks.com/stock/news/1531925/exxon-mobil-xom-gains-as-market-dips-what-you-should-know",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-10T18:47:26-04:00",
    "date_et": "2021-05-10"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-11 07:31:43",
    "publisher": "24/7 Wall Street",
    "title": "Will Oil Explode Higher After the Columbia Pipeline Cyberattack? Buy 4 Integrated Energy Giants Now.",
    "image": "https://images.financialmodelingprep.com/news/will-oil-explode-higher-after-the-columbia-pipeline-cyberattack-20210511.jpg",
    "site": "247wallst.com",
    "text": "In one of the biggest and most incredible cybersecurity failures in recent history, the Columbia Pipeline, which is literally the jugular for much of the energy transportation in the United States, was hacked and many are alleging the culprit was the work of a Russian-speaking ransomware group called DarkSide.",
    "url": "https://247wallst.com/energy-business/2021/05/11/will-oil-explode-higher-after-the-columbia-pipeline-cyberattack-buy-4-integrated-energy-giants-now/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-11T07:31:43-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-11 08:10:00",
    "publisher": "Reuters",
    "title": "Investor Legal & General backs activist in Exxon proxy battle",
    "image": "https://images.financialmodelingprep.com/news/investor-legal-general-backs-activist-in-exxon-proxy-battle-20210511.jpg",
    "site": "reuters.com",
    "text": "Britain's biggest asset manager, Legal & General, on Tuesday said it will vote for an activist hedge fund's board slate at Exxon Mobil's shareholder meeting later this month, fueling a pitched fight over the oil major's future.",
    "url": "https://www.reuters.com/article/us-exxon-mobil-lgim-proxy/investor-legal-general-backs-activist-in-exxon-proxy-battle-idUSKBN2CS1FE",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-11T08:10:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-11 16:36:56",
    "publisher": "Seeking Alpha",
    "title": "Billionaires Love 50 Stocks: 32 Pay Dividends",
    "image": "https://images.financialmodelingprep.com/news/billionaires-love-50-stocks-32-pay-dividends-20210511.jpg",
    "site": "seekingalpha.com",
    "text": "Kiplinger Investing publishes opportune stock and fund lists for investors online. This updated billionaires stock list by Dan Burrows, first published 12/8/20, was updated with YCharts data 5/7/21.",
    "url": "https://seekingalpha.com/article/4427548-billionaires-love-50-stocks-32-pay-dividends",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-11T16:36:56-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-12 07:34:02",
    "publisher": "24/7 Wall Street",
    "title": "5 Stocks to Move to Now to Avoid the Potentially Massive Correction",
    "image": "https://images.financialmodelingprep.com/news/5-stocks-to-move-to-now-to-avoid-the-20210512.jpg",
    "site": "247wallst.com",
    "text": "Those who have worked in the financial arena for decades saw the potential for some big trouble this year in January when a massive spike in retail trading sent shares of video game retailer GameStop into the stratosphere in an incredible parabolic move caused by the massive short position that had been built on the company's stock.",
    "url": "https://247wallst.com/investing/2021/05/12/5-stocks-to-move-to-now-to-avoid-the-potentially-massive-correction/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-12T07:34:02-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-12 08:26:37",
    "publisher": "Seeking Alpha",
    "title": "3 Dividend Champions Still Yielding 4.5%",
    "image": "https://images.financialmodelingprep.com/news/3-dividend-champions-still-yielding-45-20210512.jpg",
    "site": "seekingalpha.com",
    "text": "3 Dividend Champions Still Yielding 4.5%",
    "url": "https://seekingalpha.com/article/4427750-ibm-weyco-exxon-3-dividend-champions-still-yielding-4_5-percent",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-12T08:26:37-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-12 14:18:45",
    "publisher": "InvestorPlace",
    "title": "7 Oil Stocks to Buy Now for Profits From Pent-Up Demand",
    "image": "https://images.financialmodelingprep.com/news/7-oil-stocks-to-buy-now-for-profits-from-20210512.jpg",
    "site": "investorplace.com",
    "text": "While oil stocks are still risky due to concerns about the sector specifically and the economy generally, if you believe in the coronavirus recovery, these are names to bet on. The post 7 Oil Stocks to Buy Now for Profits From Pent-Up Demand appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/05/7-oil-stocks-to-buy-now-for-profits-from-pent-up-demand/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-12T14:18:45-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-13 08:25:00",
    "publisher": "Seeking Alpha",
    "title": "Why I Stopped Buying Rental Properties To Buy REITs Instead - Part 2",
    "image": "https://images.financialmodelingprep.com/news/why-i-stopped-buying-rental-properties-to-buy-reits-20210513.jpg",
    "site": "seekingalpha.com",
    "text": "Why I Stopped Buying Rental Properties To Buy REITs Instead - Part 2",
    "url": "https://seekingalpha.com/article/4426533-why-i-stopped-buying-rental-properties-to-buy-reits-instead-minus-minus-part-2",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-13T08:25:00-04:00",
    "date_et": "2021-05-13"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-13 15:07:35",
    "publisher": "CNN",
    "title": "Exxon uses Big Tobacco's playbook to downplay the climate crisis, Harvard study finds",
    "image": "https://images.financialmodelingprep.com/news/exxon-uses-big-tobaccos-playbook-to-downplay-the-climate-crisis-20210513.jpg",
    "site": "cnn.com",
    "text": "For decades, ExxonMobil has deployed Big Tobacco-like propaganda to downplay the gravity of the climate crisis, shift blame onto consumers and protect its own interests, according to a Harvard University study published Thursday.",
    "url": "https://www.cnn.com/2021/05/13/business/exxon-climate-change-harvard/index.html",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-13T15:07:35-04:00",
    "date_et": "2021-05-13"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-14 12:09:00",
    "publisher": "Business Wire",
    "title": "Leading Proxy Advisory Firm ISS Recommends ExxonMobil Shareholders Vote Engine No. 1's WHITE Proxy Card “FOR” Engine No.",
    "image": "https://images.financialmodelingprep.com/news/leading-proxy-advisory-firm-iss-recommends-exxonmobil-shareholders-vote-20210514.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Engine No. 1, which has nominated four highly qualified, independent director candidates to the Exxon Mobil Corporation (NYSE: XOM) (“ExxonMobil” or the “Company”) Board of Directors (the “Board”), today announced that Institutional Shareholder Services Inc. (“ISS”), the nation's leading independent proxy advisory firm, recommends that ExxonMobil shareholders vote the WHITE proxy card “FOR” the election of Engine No. 1's highly qualified, independent director nom",
    "url": "https://www.businesswire.com/news/home/20210514005431/en/Leading-Proxy-Advisory-Firm-ISS-Recommends-ExxonMobil-Shareholders-Vote-Engine-No.-1%E2%80%99s-WHITE-Proxy-Card-%E2%80%9CFOR%E2%80%9D-Engine-No.-1-Nominees/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-14T12:09:00-04:00",
    "date_et": "2021-05-14"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-14 12:34:00",
    "publisher": "Barron's",
    "title": "Exxon Mobil Board Could Be Headed for a Shake-Up",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-board-could-be-headed-for-a-shakeup-20210514.jpg",
    "site": "barrons.com",
    "text": "Three candidates submitted by activist investor Engine No. 1 have the backing of proxy advisor Institutional Shareholder Services.",
    "url": "https://www.barrons.com/articles/exxon-mobil-board-could-be-headed-for-a-shake-up-51621010062",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-14T12:34:00-04:00",
    "date_et": "2021-05-14"
  },
  {
    "symbol": "XOM",
    "publishedDate": "2021-05-14 14:11:02",
    "publisher": "Invezz",
    "title": "Exxon Mobil CEO ‘disagrees' with board recommendations of activist investor",
    "image": "https://images.financialmodelingprep.com/news/exxon-mobil-ceo-disagrees-with-board-recommendations-of-activist-20210514.jpg",
    "site": "invezz.com",
    "text": "Exxon Mobil's (NYSE: XOM) investor meeting is on May 26 and the company has been facing increasing pressure from activist investor Engine No. 1 to shake up its board since December of last year.",
    "url": "https://invezz.com/news/2021/05/14/exxon-mobil-ceo-disagrees-with-board-recommendations-of-activist-investor/",
    "ticker": "XOM",
    "event_date": "2021-04-30",
    "window_start": "2021-04-23",
    "window_end": "2021-05-14",
    "publishedDateET": "2021-05-14T14:11:02-04:00",
    "date_et": "2021-05-14"
  }
]