{"symbol": "COST", "publishedDate": "2023-05-18 08:12:11", "publisher": "InvestorPlace", "title": "Surprise! These 7 Retail Stocks Are Ready for Their Comeback.", "image": "https://images.financialmodelingprep.com/news/surprise-these-7-retail-stocks-are-ready-for-their-20230518.jpg", "site": "investorplace.com", "text": "Retail stocks haven't been lighting the world on fire lately. The SPDR S&P Retail Exchange-Traded Fund (NYSEARCA: XRT ) that tracks the sector is flat on the year (down 0.30% since January).", "url": "https://investorplace.com/2023/05/retail-stocks-to-buy-2/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-18T08:12:11-04:00", "date_et": "2023-05-18"}
{"symbol": "COST", "publishedDate": "2023-05-18 17:11:12", "publisher": "Proactive Investors", "title": "Costco 3Q earnings eyed amid rising institutional interest", "image": "https://images.financialmodelingprep.com/news/costco-3q-earnings-eyed-amid-rising-institutional-interest-20230518.jpg", "site": "proactiveinvestors.com", "text": "Costco Wholesale Corporation (NASDAQ:COST) will hand down its results for the third quarter of fiscal 2023 after the closing bell on Thursday, May 25. Investors will be paying close attention to Costco's results given that the stock has recently received attention from hedge funds and other institutional investors, according to reports.", "url": "https://www.proactiveinvestors.com/companies/news/1015490?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-18T17:11:12-04:00", "date_et": "2023-05-18"}
{"symbol": "COST", "publishedDate": "2023-05-19 11:28:41", "publisher": "Zacks Investment Research", "title": "Here's Why Costco (COST) Stock Warrants Your Attention", "image": "https://images.financialmodelingprep.com/news/heres-why-costco-cost-stock-warrants-your-attention-20230519.jpg", "site": "zacks.com", "text": "A customer-centric approach, strategic pricing, merchandise initiatives and an emphasis on memberships help Costco (COST) post consistent sales growth.", "url": "https://www.zacks.com/stock/news/2097389/here-s-why-costco-cost-stock-warrants-your-attention", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-19T11:28:41-04:00", "date_et": "2023-05-19"}
{"symbol": "COST", "publishedDate": "2023-05-21 15:00:00", "publisher": "Barron's", "title": "Costco, JPMorgan, Ford, and More This Week", "image": "https://images.financialmodelingprep.com/news/costco-jpmorgan-ford-and-more-this-week-20230521.jpg", "site": "barrons.com", "text": "Earnings reports from Zoom Video, Lowe's, Snowflake, Best Buy, Costco, and Ulta. Plus, minutes from the Federal Reserve's May meeting and core PCE inflation data.", "url": "https://www.barrons.com/articles/costco-jpmorgan-snowflake-ford-zoom-and-more-stocks-to-watch-this-week-7baef0d3", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-21T15:00:00-04:00", "date_et": "2023-05-21"}
{"symbol": "COST", "publishedDate": "2023-05-22 08:30:00", "publisher": "The Motley Fool", "title": "Is a Recession Coming? 2 Top Dividend Stocks to Buy Now", "image": "https://images.financialmodelingprep.com/news/is-a-recession-coming-2-top-dividend-stocks-to-20230522.jpg", "site": "fool.com", "text": "Costco members shop even more when the economy is pressured so as to benefit from its low prices. TJX's sales tend to increase when people are saving money because it offers off-price merchandise.", "url": "https://www.fool.com/investing/2023/05/22/is-a-recession-coming-2-top-dividend-stocks-to-buy/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-22T08:30:00-04:00", "date_et": "2023-05-22"}
{"symbol": "COST", "publishedDate": "2023-05-22 12:05:24", "publisher": "Zacks Investment Research", "title": "Costco (COST) Q3 Earnings Coming Up: Factors to Consider", "image": "https://images.financialmodelingprep.com/news/costco-cost-q3-earnings-coming-up-factors-to-consider-20230522.jpg", "site": "zacks.com", "text": "Costco's (COST) third-quarter results are likely to reflect better price management, decent membership trends and the increasing penetration of the e-commerce business.", "url": "https://www.zacks.com/stock/news/2098029/costco-cost-q3-earnings-coming-up-factors-to-consider", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-22T12:05:24-04:00", "date_et": "2023-05-22"}
{"symbol": "COST", "publishedDate": "2023-05-22 17:50:00", "publisher": "Investor's Business Daily", "title": "Inventory Management, Consumer Spending Central In Big Week For Retail Earnings", "image": "https://images.financialmodelingprep.com/news/inventory-management-consumer-spending-central-in-big-week-for-20230522.jpg", "site": "investors.com", "text": "Analysts will closely watch inventory levels as retail earnings in this week. Ulta, Dick's Sporting Goods, BJ's Wholesale, more report.", "url": "https://www.investors.com/news/inventory-management-consumer-spending-central-in-big-week-for-retail-earnings/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-22T17:50:00-04:00", "date_et": "2023-05-22"}
{"symbol": "COST", "publishedDate": "2023-05-23 09:38:06", "publisher": "Zacks Investment Research", "title": "Why Costco (COST) Might Surprise This Earnings Season", "image": "https://images.financialmodelingprep.com/news/why-costco-cost-might-surprise-this-earnings-season-20230523.jpg", "site": "zacks.com", "text": "Costco (COST) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season.", "url": "https://www.zacks.com/stock/news/2098409/why-costco-cost-might-surprise-this-earnings-season", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T09:38:06-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 11:15:04", "publisher": "MarketBeat", "title": "BJ's Pulse On Retail Beats Expectations", "image": "https://images.financialmodelingprep.com/news/bjs-pulse-on-retail-beats-expectations-20230523.jpg", "site": "marketbeat.com", "text": "BJ's Wholesale Club NYSE: BJ reported its first quarter 2023 earnings results on Tuesday morning when the broader stock market index was trading lower by a quarter of a percentage point. Investor concerns for a debt-ceiling crisis, which have caused the decline for the indexes, have taken BJ stock hostage as well, despite posting some satisfying results which would call for nothing more than a rally.", "url": "https://www.marketbeat.com/originals/bjs-pulse-on-retail-beats-expectations/?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T11:15:04-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 16:15:00", "publisher": "Business Wire", "title": "Ooma Reports Fiscal First Quarter 2024 Financial Results", "image": "https://images.financialmodelingprep.com/news/ooma-reports-fiscal-first-quarter-2024-financial-results-20230523.jpg", "site": "businesswire.com", "text": "SUNNYVALE, Calif.--(BUSINESS WIRE)--Ooma, Inc. (NYSE: OOMA), a smart communications platform for businesses and consumers, today released financial results for the fiscal first quarter ended April 30, 2023. Fiscal First Quarter 2024 Financial Highlights: Revenue: Total revenue was $56.9 million, up 13% year-over-year. Subscription and services revenue increased to $53.0 million from $46.7 million in the first quarter of fiscal 2023, and was 93% of total revenue, primarily driven by the growth of Ooma Business and the acquisition of OnSIP. Net Income/Loss: GAAP net loss was $0.3 million, or $0.01 per basic and diluted share, compared to GAAP net loss of $0.8 million, or $0.03 per basic and diluted share, in the first quarter of fiscal 2023. Non-GAAP net income was $4.0 million, or $0.16 per diluted share, compared to non-GAAP net income of $3.0 million, or $0.12 per diluted share in the prior year period. Adjusted EBITDA: Adjusted EBITDA was $4.8 million, compared to $3.9 million in the first quarter of fiscal 2023. For more information about non-GAAP net income and Adjusted EBITDA, see the section below titled \"Non-GAAP Financial Measures\" and the reconciliation provided in this release. “Ooma achieved a solid start to its fiscal 2024 with Q1 revenue increasing to $56.9 million and non-GAAP net income of $4.0 million,” said Eric Stang, chief executive officer of Ooma. “Q1 revenue growth of 13%, year-over-year, was driven by 27% year-over-year growth in business services revenue, which now makes up 56% of total services revenue. As planned, we made progress in Q1 introducing new Office Pro+ features, growing our user base in Europe, expanding our vertical markets and partnerships, and broadening the capabilities and customer adoption of our AirDial POTS replacement solution. Looking forward, we intend to continue to invest in our key strategic initiatives and the development of new partnerships to drive profitable growth.” Business Outlook: For the second quarter of fiscal 2024, Ooma expects: Total revenue in the range of $57.4 million to $57.9 million. GAAP net loss in the range of $0.6 million to $0.9 million and GAAP net loss per share in the range of $0.02 to $0.04. Non-GAAP net income in the range of $3.5 million to $3.8 million and non-GAAP net income per share in the range of $0.13 to $0.15. For the full fiscal year 2024, Ooma expects: Total revenue in the range of $235.5 million to $238.5 million. GAAP net loss in the range of $0.9 million to $2.9 million, and GAAP net loss per share in the range of $0.04 to $0.12. Non-GAAP net income in the range of $14.5 million to $16.5 million, and non-GAAP net income per share in the range of $0.55 to $0.63. The following is a reconciliation of GAAP net loss to non-GAAP net income and GAAP basic and diluted net loss per share to non-GAAP diluted net income per share guidance for the second fiscal quarter ending July 31, 2023 and the fiscal year ending January 31, 2024 (in millions, except per share data): ($0.6)-($0.9) ($0.9)-($2.9) 3.7 14.6 0.7 2.8 $3.5-$3.8 $14.5-$16.5 ($0.02)-($0.04) ($0.04)-($0.12) 0.14 0.56 0.03 0.11 $0.13-$0.15 $0.55-$0.63 25.2 25.6 26.0 26.3 Conference Call Information: Ooma will host a conference call and live webcast for analysts and investors today at 5:00 p.m. Eastern time. The news release with the financial results will be accessible from the company's website prior to the conference call. Parties in the United States and Canada can access the call by dialing +1 (888) 550-5744, using conference ID 4726540. International parties can access the call by dialing +1 (646) 960-0223, using conference ID 4726540. The webcast will be accessible on the Events and Presentations page of Ooma’s investor relations website, https://investors.ooma.com, for a period of at least one year. A telephonic replay of the conference call will be available from approximately two hours after the call is completed or about 8:00 p.m. Eastern time on May 23, 2023 until 11:59 p.m. Eastern time Tuesday, May 30, 2023. To access the replay, parties in the United States and Canada should call +1 (800) 770-2030. International parties should call +1 (647) 362-9199. Non-GAAP Financial Measures In addition to disclosing financial measures prepared in accordance with U.S. generally accepted accounting principles (“GAAP”), this press release and the accompanying tables contain certain non-GAAP financial measures, including: non-GAAP net income, non-GAAP net income per share, non-GAAP gross profit and gross margin, non-GAAP operating income, and Adjusted EBITDA. Adjusted EBITDA represents the net income before interest and other income, income tax provision, depreciation and amortization of capital expenditures, amortization of intangible assets, and stock-based compensation expense and related taxes. Other non-GAAP financial measures exclude stock-based compensation expense and related taxes, and amortization of intangible assets. Non-GAAP weighted-average diluted shares include the effect of potentially dilutive securities from the company’s stock-based benefit plans. These non-GAAP financial measures are presented to provide investors with additional information regarding our financial results and core business operations. Ooma considers these non-GAAP financial measures to be useful measures of the operating performance of the company, because they contain adjustments for unusual events or factors that do not directly affect what management considers to be Ooma's core operating performance and are used by the company's management for that purpose. Management also believes that these non-GAAP financial measures allow for a better evaluation of the company's performance by facilitating a meaningful comparison of the company's core operating results in a given period to those in prior and future periods. In addition, investors often use similar measures to evaluate the operating performance of a company. Non-GAAP financial measures are presented for supplemental informational purposes only to aid an understanding of the company's operating results. The non-GAAP financial measures should not be considered a substitute for financial information presented in accordance with GAAP and may be different from non-GAAP financial measures presented by other companies. A limitation of the non-GAAP financial measures presented is that the adjustments relate to items that the company generally expects to continue to recognize. The adjustment of these items should not be construed as an inference that the adjusted gains or expenses are unusual, infrequent or non-recurring. Therefore, both GAAP financial measures of Ooma's financial performance and the respective non-GAAP measures should be considered together. Please see the reconciliation of non-GAAP financial measures to the most directly comparable GAAP measure in the tables below. Disclosure Information Ooma uses the investor relations section on its website as a means of complying with its disclosure obligations under Regulation FD. Accordingly, investors should monitor Ooma's investor relations website in addition to following Ooma's press releases, Securities and Exchange Commission (“SEC”) filings, and public conference calls and webcasts. Legal Notice Regarding Forward-Looking Statements This press release contains forward-looking statements under the Private Securities Litigation Reform Act of 1995. In particular, the financial projections under “Business Outlook” and the statements contained in the quotations of our Chief Executive Officer with respect to expectations regarding the Company’s growth initiatives may constitute forward-looking statements. Forward-looking statements can be identified by the fact that they do not relate strictly to historical facts and generally contain words such as \"believes”, \"expects”, \"may”, \"will”, \"should”, \"seeks”, \"approximately”, \"intends”, \"plans”, \"estimates”, \"anticipates”, and other expressions that are predictions of or indicate future events. Although the forward-looking statements contained in this press release are based upon information available at the time the statements are made and reflect management's good faith beliefs, forward-looking statements inherently involve known and unknown risks, uncertainties and other factors, which may cause the actual results, performance or achievements to differ materially from anticipated future results. Important factors that could cause actual results to differ materially from expectations include, among others: our inability to attract new customers on a cost-effective basis; our inability to retain customers; our inability to realize expected returns from our investments made in connection with our international expansion efforts and development of new product features; failure to realize AirDial opportunities; intense competition; loss of key retailers and reseller partnerships; our reliance on vendors to manufacture the on-premise appliances and end-point devices we sell; our reliance on third parties for our network connectivity and co-location facilities; our reliance on third parties for some of our software development, quality assurance and operations; our reliance on third parties to provide the majority of our customer service and support representatives; and interruptions to our service. You should not place undue reliance on these forward-looking statements, which speak only as of the date hereof. We do not undertake to update or revise any forward-looking statements after they are made, whether as a result of new information, future events, or otherwise, except as required by applicable law. The forward-looking statements contained in this press release are also subject to other risks and uncertainties, including those more fully described in our filings which we make with the SEC from time to time, including the risk factors contained in our Annual Report on Form 10-K for the year ended January 31, 2023, filed with the SEC on April 7, 2023. The forward-looking statements in this press release are based on information available to Ooma as of the date hereof, and Ooma disclaims any obligation to update any forward-looking statements, except as required by law. About Ooma, Inc. Ooma (NYSE: OOMA) creates powerful connected experiences for businesses and consumers, delivered from its smart cloud-based SaaS platform. For businesses of all sizes, Ooma provides advanced voice and collaboration features including messaging, intelligent virtual attendants, and video conferencing to help them run more efficiently. For consumers, Ooma’s residential phone service provides PureVoice HD voice quality, advanced functionality and integration with mobile devices. Learn more at www.ooma.com or www.ooma.ca in Canada. April 30, January 31, 2023 2023 $ 27,390 $ 24,137 987 2,723 8,734 7,131 25,320 26,246 13,620 14,368 76,051 74,605 8,448 7,996 16,887 12,702 9,722 10,463 8,655 8,655 17,972 16,584 $ 137,735 $ 131,005 $ 18,872 $ 13,462 20,600 26,726 16,630 17,216 56,102 57,404 13,987 10,426 23 31 70,112 67,861 5 5 200,398 195,605 (11 ) (23 ) (132,769 ) (132,443 ) 67,623 63,144 $ 137,735 $ 131,005 OOMA, INC. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited, amounts in thousands, except share and per share data) $ 53,049 $ 46,723 3,803 3,614 56,852 50,337 14,725 13,209 6,175 5,176 20,900 18,385 35,952 31,952 17,990 16,151 11,953 10,498 6,617 6,062 36,560 32,711 (608 ) (759 ) 415 33 (193 ) (726 ) (133 ) (40 ) $ (326 ) $ (766 ) $ (0.01 ) $ (0.03 ) 25,178,008 24,116,144 OOMA, INC. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited, amounts in thousands) $ (326 ) $ (766 ) 3,500 3,336 1,063 850 741 326 647 717 (2 ) 15 (1,603 ) 1,688 965 (493 ) (755 ) (2,681 ) (2,352 ) (1,950 ) (594 ) (223 ) 1,284 819 1,750 4,800 — (3,380 ) (1,374 ) (1,459 ) 300 — 676 (39 ) 1,724 1,554 (431 ) (348 ) 1,293 1,206 3,253 1,986 24,137 19,667 $ 27,390 $ 21,653 OOMA, INC. Reconciliation of Non-GAAP Financial Measures (Unaudited, amounts in thousands, except percentages, shares and per share data) $ 56,852 $ 50,337 $ 35,952 $ 31,952 260 248 110 73 $ 36,322 $ 32,273 63 % 63 % 64 % 64 % $ (608 ) $ (759 ) 3,595 3,440 741 326 $ 3,728 $ 3,007 $ (326 ) $ (766 ) 3,595 3,440 741 326 $ 4,010 $ 3,000 $ (0.01 ) $ (0.03 ) 0.14 0.14 0.03 0.01 $ 0.16 $ 0.12 $ 0.16 $ 0.12 25,178,008 24,116,144 25,665,906 24,909,140 $ (326 ) $ (766 ) (415 ) (33 ) 133 40 1,063 850 741 326 3,595 3,440 $ 4,791 $ 3,857", "url": "http://www.businesswire.com/news/home/20230523005999/en/Ooma-Reports-Fiscal-First-Quarter-2024-Financial-Results", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T16:15:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 16:31:00", "publisher": "Business Wire", "title": "Corporacion America Airports Reports First Quarter 2023 Results", "image": "https://images.financialmodelingprep.com/news/corporacion-america-airports-reports-first-quarter-2023-results-20230523.jpg", "site": "businesswire.com", "text": "LUXEMBOURG--(BUSINESS WIRE)--Corporación América Airports S.A. (NYSE: CAAP), (“CAAP” or the “Company”) one of the leading private airport operators in the world, reported today its unaudited, consolidated results for the three-month period ended March 31, 2023 (first quarter 2023). Financial results are expressed in millions of U.S. dollars and are prepared in accordance with International Financial Reporting Standards (IFRS) as issued by the International Accounting Standards Board (“IASB”). Commencing 3Q18, the Company began reporting results of its Argentinean subsidiaries applying Hyperinflation Accounting, in accordance with IFRS rule IAS 29 (“IAS 29”), as detailed in Section “Hyperinflation Accounting in Argentina” on page 23. First Quarter 2023 Highlights Consolidated Revenues of $382.1 million, a 48.0% year over year (YoY) increase, or 6.0% above 1Q19. Excluding the impact of IFRS rule IAS 29, revenues increased 49.4% YoY to $386.6 million, reflecting increases of $68.3 million in Aeronautical Revenues, $37.1 million in Commercial Revenues, and $20.3 million in Construction Service Revenue. Revenues ex-IAS 29 were 103.0% of pre-pandemic levels. Delivered YoY increases across key operating metrics: 37.3% in passenger traffic to 18.5 million, reaching 89.9% of 1Q19 levels. 5.2% in cargo volume to 85.2 thousand tons, to 81.0% of 1Q19 levels. 27.8% in aircraft movements, to 93.9% of 1Q19 levels. 37.3% in passenger traffic to 18.5 million, reaching 89.9% of 1Q19 levels. 5.2% in cargo volume to 85.2 thousand tons, to 81.0% of 1Q19 levels. 27.8% in aircraft movements, to 93.9% of 1Q19 levels. Operating Income of $102.0 million, up from $51.8 million in 1Q22, mainly reflecting the YoY recovery in passenger traffic. Adjusted EBITDA on an “As Reported” basis increased to $140.6 million, from $89.2 million in the year-ago period, with Adjusted EBITDA margin ex-IFRIC12 expanding to 40.2% from 36.3%. Compared to 1Q19, Adjusted EBITDA increased 20.2%, with Adjusted EBITDA margin ex-IFRIC12 expanding 1.5 percentage points. Strong cash position with Cash & cash equivalents totaling $401.1 million. Net debt to LTM Adjusted EBITDA improved to 2.1x, from 2.4x as of December 31, 2022. CEO Message Commenting on the results for the quarter Mr. Martín Eurnekian, CEO of Corporación América Airports, noted: “We are pleased with the strong start to the year, continuing the recovery trend from 2022 and delivering record-high Adjusted EBITDA of $140.6 million, surpassing 1Q19 levels by 20%. This good performance was driven by positive Adjusted EBITDA across all countries of operations, supported by the success of our commercial initiatives, solid aeronautical revenues along with cost controls. Notably, this was achieved with total passenger traffic at 90% of pre-pandemic levels. We are on track with our capex commitments in Argentina which is part of the extension agreement previously announced. Importantly, last month we achieved a key milestone with the opening of our new state-of-the-art departure terminal at Ezeiza Airport, in Argentina. We are particularly pleased to be operating the most modern airport in Latin America. We are making progress in other countries as well. In Armenia, we remain in discussions with the government with respect to a new capex plan to increase capacity to serve, with a high quality of service, the growing demand we are experiencing. In Italy, the approval process for the new master plan at Florence Airport remains on track, which will allow us to unlock unattended demand. Expanding our airport network is also an important growth opportunity for us and a key pillar of our value-creation strategy. To that end, the negotiations with Nigerian authorities in connection with the concession agreements for Abuja and Kano airports are moving ahead, as expected. Furthermore, as we seek other markets in which to expand our network, we are currently analyzing two additional attractive airport concession investment opportunities in other countries. Although the macro environment remains volatile, passenger traffic in April has further increased, reaching 95% of 2019 levels and we expect travel demand to continue expanding throughout the year. As we look to the future, with an investment plan in place and a solid financial position, we are well prepared to deliver long-term value creation to our shareholders.” Operating & Financial Highlights (In millions of U.S. dollars, unless otherwise noted) 1Q23 as reported 1Q22 as reported % Var as reported IAS 29 1Q23 1Q23 ex IAS 29 1Q22 ex IAS 29 % Var ex IAS 29 Passenger Traffic (Million Passengers) (1) 18.5 13.5 37.3% 18.5 13.5 37.3% Revenue 382.1 258.1 48.0% -4.6 386.6 258.7 49.4% Aeronautical Revenues 185.6 119.4 55.5% -1.8 187.4 119.0 57.4% Non-Aeronautical Revenues 196.5 138.8 41.6% -2.8 199.2 139.7 42.6% Revenue excluding construction service 348.5 244.5 42.6% -2.5 351.0 243.4 44.2% Operating Income / (Loss) 102.0 51.8 96.8% -17.6 119.6 67.2 78.0% Operating Margin 26.7% 20.1% 662 0.0% 30.9% 26.0% 497 Net (Loss) / Income Attributable to Owners of the Parent 31.7 25.9 22.1% 25.1 6.5 -5.8 -212.3% EPS (US$) 0.20 0.16 22.1% 0.16 0.04 -0.04 -212.2% Adjusted EBITDA 140.6 89.2 57.6% -0.6 141.2 88.7 59.2% Adjusted EBITDA Margin 36.8% 34.6% 223 - 36.5% 34.3% 223 Adjusted EBITDA Margin excluding Construction Service 40.2% 36.3% 388 - 40.1% 36.3% 383 Net Debt to LTM Adjusted EBITDA 2.1x 5.1x - - - - - Net Debt to LTM Adjusted EBITDA excl. impairment on intangible assets (2) 2.1x 5.1x - - - - - Starting November 2019, the Company has reclassified its passenger traffic figures for Brasilia Airport between international, domestic and transit retroactively since June 2018 to return to the count methodology utilized until May 2018. Notwithstanding, total traffic figures remain unchanged. LTM Adjusted EBITDA excluding impairments of intangible assets. To obtain the full text of this earnings release and the earnings presentation, please click on the following link: http://investors.corporacionamericaairports.com/Results-Center 1Q23 EARNINGS CONFERENCE CALL When: 10:00 a.m. Eastern Time, May 24, 2023 Who: Mr. Martín Eurnekian, Chief Executive Officer Mr. Jorge Arruda, Chief Financial Officer Mr. Patricio Iñaki Esnaola, Head of Investor Relations Dial-in: 1-404-975-4839 (U.S. Local); 1-833-470-1428 (U.S. Toll-Free); +44-208-068-2558 (UK). Participant access code: 437579 Webcast: CAAP 1Q23 Earnings Conference Call Replay: 1-929-458-6194 (U.S. Local); 1-866-813-9403 (U.S., Toll Free); +44-204-525-0658 (Intern.). Replay access code: 934859 Use of Non-IFRS Financial Measures This announcement includes certain references to Adjusted EBITDA, Adjusted EBITDA Margin, Adjusted EBITDA excluding Construction Service and Adjusted EBITDA Margin excluding Construction service, as well as Net Debt: Adjusted EBITDA is defined as income for the period before financial income, financial loss, income tax expense, depreciation and amortization. Adjusted EBITDA Margin is calculated by dividing Adjusted EBITDA by total revenues. Adjusted EBITDA excluding Construction Service (“Adjusted EBITDA ex-IFRIC”) is defined as income for the period before construction services revenue and cost, financial income, financial loss, income tax expense, depreciation and amortization. Adjusted EBITDA Margin excluding Construction Service (“Adjusted EBITDA Margin ex-IFRIC12”) excludes the effect of IFRIC12 with respect to the construction or improvements to assets under the concession and is calculated by dividing Adjusted EBITDA excluding Construction Service revenue and cost, by total revenues less Construction service revenue. Adjusted EBITDA, Adjusted EBITDA Margin, Adjusted EBITDA excluding Construction Service and Adjusted EBITDA Margin excluding Construction Service are not measures recognized under IFRS and should not be considered as an alternative to, or more meaningful than, consolidated net income for the year as determined in accordance with IFRS or as indicators of our operating performance from continuing operations. Accordingly, readers are cautioned not to place undue reliance on this information and should note that these measures as calculated by the Company, may differ materially from similarly titled measures reported by other companies. We believe that the presentation of Adjusted EBITDA and Adjusted EBITDA excluding Construction Service enhances an investor’s understanding of our performance and are useful for investors to assess our operating performance by excluding certain items that we believe are not representative of our core business. In addition, Adjusted EBITDA and Adjusted EBITDA excluding Construction Service are useful because they allow us to more effectively evaluate our operating performance and compare the results of our operations from period to period without regard to our financing methods, capital structure or income taxes and construction services (when applicable). Net debt is calculated by deducting “Cash and cash equivalents” from total financial debt. Figures ex-IAS 29 result from dividing nominal Argentine pesos for the Argentine Segment, by the average foreign exchange rate of the Argentine Peso against the US dollar in the period. Percentage variations ex-IAS 29 figures compare results as presented in the prior year quarter before IAS 29 came into effect, against ex-IAS 29 results for this quarter as described above. For comparison purposes, the impact of adopting IAS 29 in Aeropuertos Argentina 2000, the Company’s largest subsidiary in Argentina, is presented separately in each of the applicable sections of this earnings release, in a column denominated “IAS 29”. The impact from “Hyperinflation Accounting in Argentina” is described in more detail page 23 of this report. Definitions and Concepts Commercial Revenues: CAAP derives commercial revenue principally from fees resulting from warehouse usage (which includes cargo storage, stowage and warehouse services and related international cargo services), services and retail stores, duty free shops, car parking facilities, catering, hangar services, food and beverage services, retail stores, including royalties collected from retailers’ revenue, and rent of space, advertising, fuel, airport counters, VIP lounges and fees collected from other miscellaneous sources, such as telecommunications, car rentals and passenger services. Construction Service revenue and cost: Investments related to improvements and upgrades to be performed in connection with concession agreements are treated under the intangible asset model established by IFRIC12. As a result, all expenditures associated with investments required by the concession agreements are treated as revenue generating activities given that they ultimately provide future benefits, and subsequent improvements and upgrades made to the concession are recognized as intangible assets based on the principles of IFRIC12. The revenue and expense are recognized as profit or loss when the expenditures are performed. The cost for such additions and improvements to concession assets is based on actual costs incurred by CAAP in the execution of the additions or improvements, considering the investment requirements in the concession agreements. Through bidding processes, the Company contracts third parties to carry out such construction or improvement services. The amount of revenues for these services is equal to the amount of costs incurred plus a reasonable margin, which is estimated at an average of 3.0% to 5.0%. About Corporación América Airports Corporación América Airports acquires, develops and operates airport concessions. The Company is a leading private airport operator in the world, currently operating 53 airports in 6 countries across Latin America and Europe (Argentina, Brazil, Uruguay, Ecuador, Armenia and Italy). In 2022, Corporación América Airports served 65.6 million passengers, 83.7% above the 35.7 million passengers served in 2021 and 22.1% below the 84.2 million served in 2019. The Company is listed on the New York Stock Exchange where it trades under the ticker “CAAP”. For more information, visit http://investors.corporacionamericaairports.com Forward Looking Statements Statements relating to our future plans, projections, events or prospects are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include all statements that are not historical facts and can be identified by terms such as “believes,” “continue,” “could,” “potential,” “remain,” “will,” “would” or similar expressions and the negatives of those terms. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Many factors could cause our actual activities or results to differ materially from the activities and results anticipated in forward-looking statements, including, but not limited to: the Covid-19 impact, delays or unexpected casualties related to construction under our investment plan and master plans, our ability to generate or obtain the requisite capital to fully develop and operate our airports, general economic, political, demographic and business conditions in the geographic markets we serve, decreases in passenger traffic, changes in the fees we may charge under our concession agreements, inflation, depreciation and devaluation of the AR$, EUR, BRL, UYU or the AMD against the U.S. dollar, the early termination, revocation or failure to renew or extend any of our concession agreements, the right of the Argentine Government to buy out the AA2000 Concession Agreement, changes in our investment commitments or our ability to meet our obligations thereunder, existing and future governmental regulations, natural disaster-related losses which may not be fully insurable, terrorism in the international markets we serve, epidemics, pandemics and other public health crises and changes in interest rates or foreign exchange rates. The Company encourages you to review the ‘Cautionary Statement’ and the ‘Risk Factor’ sections of our annual report on Form 20-F for the year ended December 31, 2019 and any of CAAP’s other applicable filings with the Securities and Exchange Commission for additional information concerning factors that could cause those differences.", "url": "http://www.businesswire.com/news/home/20230523005873/en/Corporacion-America-Airports-Reports-First-Quarter-2023-Results", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T16:31:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 16:55:32", "publisher": "Investopedia", "title": "Rising Memberships Could Help Costco Offset a Spending Slowdown", "image": "https://images.financialmodelingprep.com/news/rising-memberships-could-help-costco-offset-a-spending-slowdown-20230523.jpg", "site": "investopedia.com", "text": "Costco (COST) will likely report solid earnings growth as rising memberships and sustained customer loyalty could help the wholesaler offset weakness in discretionary spending and ecommerce.", "url": "https://www.investopedia.com/costco-q3-earnings-preview-7501872", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T16:55:32-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 17:00:00", "publisher": "Business Wire", "title": "Fastly to Present at Upcoming Investor Conferences", "image": "https://images.financialmodelingprep.com/news/fastly-to-present-at-upcoming-investor-conferences-20230523.png", "site": "businesswire.com", "text": "SAN FRANCISCO--(BUSINESS WIRE)--Fastly, Inc. (NYSE: FSLY), one of the world’s fastest global edge cloud platforms, today announced that management will be participating in fireside chats at the following investor conferences: William Blair 43rd Annual Growth Stock Conference in Chicago on June 6th at 5:00 p.m. ET Presenters: Ron Kisling, Chief Financial Officer and Vernon Essi, Vice President of Investor Relations BofA Securities 2023 Global Technology Conference in San Francisco on June 8th at 2:20 p.m. ET Presenters: Ron Kisling, Chief Financial Officer and Vernon Essi, Vice President of Investor Relations Webcasts of these presentations will be available on Fastly’s Investor Relations website at https://investors.fastly.com. About Fastly Fastly’s powerful and programmable edge cloud platform helps the world’s top brands deliver the fastest online experiences possible, while improving site performance, enhancing security, and empowering innovation at global scale. With world-class support that achieves 95%+ average annual customer satisfaction ratings, Fastly’s beloved suite of edge compute, delivery, and security offerings has been recognized as a leader by industry analysts such as IDC, Forrester and Gartner. Compared to legacy providers, Fastly’s powerful and modern network architecture is one of the fastest on the planet, empowering developers to deliver secure websites and apps at global scale with rapid time-to-market and industry-leading cost savings. Thousands of the world’s most prominent organizations trust Fastly to help them upgrade the internet experience, including Reddit, Pinterest, Stripe, Neiman Marcus, The New York Times, Epic Games, and GitHub. Learn more about Fastly at https://www.fastly.com/, and follow us @fastly. Source: Fastly, Inc.", "url": "http://www.businesswire.com/news/home/20230523005938/en/Fastly-to-Present-at-Upcoming-Investor-Conferences", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T17:00:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 17:30:00", "publisher": "Business Wire", "title": "BrainChip and CVEDIA Team to Advance State-of-the-Art Edge AI and Neuromorphic Computing", "image": "https://images.financialmodelingprep.com/news/brainchip-and-cvedia-team-to-advance-stateoftheart-edge-ai-20230523.jpg", "site": "businesswire.com", "text": "LAGUNA HILLS, Calif.--(BUSINESS WIRE)--BrainChip Holdings Ltd (ASX: BRN, OTCQX: BRCHF, ADR: BCHPY), the world’s first commercial producer of ultra-low power, fully digital, event-based, neuromorphic AI IP, and CVEDIA, a leading provider of AI-based video analytics solutions, have entered into a partnership to advance the state-of-the-art in Edge AI and neuromorphic computing. The focus of the partnership will be on the integration of the CVEDIA-RT platform for video analytics running on BrainChip’s Akida™ neuromorphic IP. The CVEDIA-RT platform enables rapid creation and development for video analytics for security and surveillance, transportation, ITS, and retail applications. By combining the two technologies, the companies can create and train AI models that are optimized for event-based processing and inference at the edge without relying on cloud connectivity or high-power consumption. This addresses some of the most challenging problems in edge AI, such as perception, cognition, security and privacy. “We’re excited to partner with BrainChip to bring the benefits of CVEDIA-RT’s analytics to Akida enabled Edge AI devices enabling developers to scale much faster without needing the cloud,” said Arjan Wijnveen, CEO of CVEDIA. “Analyzing and tuning the complete solution at the edge, on the target platform that optimizes the applications and accelerates time to market, propels value added devices and services in AIoT.” “From object detection to analytics to inference, CVEDIA-RT is a powerful application that simplifies deploying vision AI on hardware,” said Rob Telson, BrainChip Vice President of Ecosystem and Partnerships. “With CVEDIA, we progress on our mission to expand the deployment of AI solutions by enabling developers to rapidly and cost-effectively build and tune to new use cases.” About BrainChip Holdings Ltd (ASX: BRN, OTCQX: BRCHF, ADR: BCHPY) BrainChip is the worldwide leader in edge AI on-chip processing and learning. The company’s first-to-market, fully digital, event-based AI processor, AkidaTM, uses neuromorphic principles to mimic the human brain, analyzing only essential sensor inputs at the point of acquisition, processing data with unparalleled efficiency, precision, and economy of energy. Akida uniquely enables edge learning local to the chip, independent of the cloud, dramatically reducing latency while improving privacy and data security. Akida Neural processor IP, which can be integrated into SoCs on any process technology, has shown substantial benefits on today’s workloads and networks, and offers a platform for developers to create, tune and run their models using standard AI workflows like Tensorflow/Keras. In enabling effective edge compute to be universally deployable across real world applications such as connected cars, consumer electronics, and industrial IoT, BrainChip is proving that on-chip AI, close to the sensor, is the future, for its customers’ products, as well as the planet. Explore the benefits of Essential AI at www.brainchip.com. Follow BrainChip on Twitter: https://www.twitter.com/BrainChip_inc Follow BrainChip on LinkedIn: https://www.linkedin.com/company/7792006 About CVEDIA CVEDIA is the first computer vision solutions company to pioneer the use of synthetic data to eliminate both data and deployment bottlenecks in developing and deploying computer vision software. CVEDIA-RT is our AI software stack that comes pre-installed with dozens of video analytics and computer vision solutions. Easy to configure and customize to a variety of use-cases, even if you're not a data scientist or developer, CVEDIA turns video into actionable data in easy to use system integrator-ready applications that are optimized to run on edge devices. For more information visit https://www.cvedia.com/", "url": "http://www.businesswire.com/news/home/20230523006061/en/BrainChip-and-CVEDIA-Team-to-Advance-State-of-the-Art-Edge-AI-and-Neuromorphic-Computing", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T17:30:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 18:01:00", "publisher": "Business Wire", "title": "Medical Properties Trust Announces Prospect Recapitalization Transactions", "image": "https://images.financialmodelingprep.com/news/medical-properties-trust-announces-prospect-recapitalization-transactions-20230523.jpg", "site": "businesswire.com", "text": "BIRMINGHAM, Ala.--(BUSINESS WIRE)--Medical Properties Trust, Inc. (the “Company” or “MPT”) (NYSE: MPW) today announced that affiliates of Prospect Medical Holdings (“Prospect”) have completed $375 million in new financings from third-party lenders, the proceeds of which will be used to provide Prospect’s hospital operations with liquidity and capitalize its managed care business for continued growth and value creation in a vibrant market for such businesses. Prospect’s $250 million asset-backed revolving credit facility has been repaid in full and as a result, the unencumbered borrowing base of government and commercial insurance accounts receivable will provide first lien security for the previously announced MPT delayed draw term loan of up to $75 million. Prospect is expected to be substantially free of material debt or lease obligations outside of those to MPT and this new third-party financing. MPT continues to have strong conviction in the embedded value of the Prospect platform and has structured its master leases and security agreements to provide collateral value in addition to its real estate interests, including interests in the equity of Prospect's managed care business. As of the end of the first quarter of 2023, MPT holds $1.6 billion in total assets related to Prospect that are expected to be reconstituted as follows: An approximately $513 million investment in six leased California hospitals, subject to a master lease scheduled to resume partial rent payments in September and full rent payments at an 8.44% cash yield in March of 2024; A $457 million investment in MPT’s Connecticut real estate which, as previously announced, Yale New Haven Health is expected to acquire in a transaction that is expected to close during 2023’s third quarter. MPT’s investment is expected to be fully recovered through cash proceeds of $355 million at closing and equity interests in Prospect’s managed care business valued at $103 million; A first lien mortgage loan of $150 million and equity interests in the managed care business valued at $100 million, resulting from the transfer to Prospect of Pennsylvania real estate with a book value of $250 million; Loans aggregating approximately $264 million and accrued rent and interest of approximately $56 million, along with the previously announced $50 million convertible loan to the managed care entities are expected to be recovered through equity interests in the managed care business. The new loan agreements among Prospect, MPT and third-party lenders have terms of approximately three years. During this period, Prospect intends to further build the value of its managed care business and continue operational and financial improvements of its hospital operating business. About Prospect Medical Prospect Medical is a group of health care organizations that have led the transformation of health care for over 25 years. Prospect Medical creates value by accepting the insurance risk from health plans and aligning with providers via unique financial compensation models and by deploying multiple evidence-based medical management services. The result is high-quality, cost-effective care for its membership. The assets and operations are scalable and exportable to new markets. Prospect’s assets include: Prospect Medical Group: Large family of Independent Physician Associations (\"IPAs\") with over 6,500 independent physicians' profitably managing approximately 500 thousand lives in the largest 5 Counties in California with new markets in Arizona and Texas. Prospect Health Plan: An insurance company able to accept all of the insurance risk for any type of HMO insurance (Commercial, Medicaid, Medicare, Dual-eligible); and Prospect Medical Systems: A full-service management services organization (\"MSO\") with expertise in data-driven medical management and delivering high quality of care to members. About Medical Properties Trust, Inc. Medical Properties Trust, Inc. is a self-advised real estate investment trust formed in 2003 to acquire and develop net-leased hospital facilities. From its inception in Birmingham, Alabama, the Company has grown to become one of the world’s largest owners of hospital real estate with 443 facilities and approximately 45,000 licensed beds in ten countries and across four continents. MPT’s financing model facilitates acquisitions and recapitalizations and allows operators of hospitals to unlock the value of their real estate assets to fund facility improvements, technology upgrades and other investments in operations. For more information, please visit the Company’s website at www.medicalpropertiestrust.com. This press release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements can generally be identified by the use of forward-looking words such as “may”, “will”, “would”, “could”, “expect”, “intend”, “plan”, “estimate”, “target”, “anticipate”, “believe”, “objectives”, “outlook”, “guidance” or other similar words, and include statements regarding our strategies, objectives, future expansion and development activities, and expected financial performance. Forward-looking statements involve known and unknown risks and uncertainties that may cause our actual results or future events to differ materially from those expressed in or underlying such forward-looking statements, including, but not limited to: (i) the economic, political and social impact of, and uncertainty relating to, potential impact from health crises (like COVID-19); (ii) the ability of our tenants, operators and borrowers to satisfy their obligations under their respective contractual arrangements with us, especially as a result of the adverse economic impact of the COVID-19 pandemic, and government regulation of hospitals and healthcare providers in connection with same (as further detailed in our Current Report on Form 8-K filed with the SEC on April 8, 2020); (iii) our expectations regarding annual guidance for net income and NFFO per share; (iv) our success in implementing our business strategy and our ability to identify, underwrite, finance, consummate and integrate acquisitions and investments; (v) the nature and extent of our current and future competition; (vi) macroeconomic conditions, such as a disruption of or lack of access to the capital markets or movements in currency exchange rates; (vii) our ability to obtain debt financing on attractive terms or at all, which may adversely impact our ability to pursue acquisition and development opportunities and pay down, refinance, restructure or extend our indebtedness as it becomes due; (viii) increases in our borrowing costs as a result of changes in interest rates and other factors; (ix) international, national and local economic, real estate and other market conditions, which may negatively impact, among other things, the financial condition of our tenants, lenders and institutions that hold our cash balances, and may expose us to increased risks of default by these parties; (x) factors affecting the real estate industry generally or the healthcare real estate industry in particular; (xi) our ability to maintain our status as a REIT for federal and state income tax purposes; (xii) federal and state healthcare and other regulatory requirements, as well as those in the foreign jurisdictions where we own properties; (xiii) the value of our real estate assets, which may limit our ability to dispose of assets at attractive prices or obtain or maintain equity or debt financing secured by our properties or on an unsecured basis; (xiv) the ability of our tenants and operators to operate profitably and generate positive cash flow, comply with applicable laws, rules and regulations in the operation of the our properties, to deliver high-quality services, to attract and retain qualified personnel and to attract patients; (xv) potential environmental contingencies and other liabilities; (xvi) the risk that the expected sale of three Connecticut hospitals currently leased to Prospect does not occur; (xvii) the risk that MPT’s expected sale of its Australian portfolio does not occur; (xviii) the risk that other property sales, loan repayments, and other capital recycling transactions do not occur; and (xix) the risks and uncertainties of litigation. The risks described above are not exhaustive and additional factors could adversely affect our business and financial performance, including the risk factors discussed under the section captioned “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2022 and as updated in our quarterly reports on Form 10-Q. Forward-looking statements are inherently uncertain and actual performance or outcomes may vary materially from any forward-looking statements and the assumptions on which those statements are based. Readers are cautioned to not place undue reliance on forward-looking statements as predictions of future events. We disclaim any responsibility to update such forward-looking statements, which speak only as of the date on which they were made.", "url": "http://www.businesswire.com/news/home/20230523006095/en/Medical-Properties-Trust-Announces-Prospect-Recapitalization-Transactions", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T18:01:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 18:06:00", "publisher": "Business Wire", "title": "Kirby McInerney LLP Announces the Filing of a Securities Class Action on Behalf of Charles River Laboratories International, Inc. (CRL) Investors", "image": "https://images.financialmodelingprep.com/news/kirby-mcinerney-llp-announces-the-filing-of-a-securities-class-action-20230523.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--The law firm of Kirby McInerney LLP announces that a class action lawsuit has been filed in the U.S. District Court for the District of Massachusetts on behalf of those who acquired Charles River Laboratories International, Inc. (“Charles River” or the “Company”) (NYSE: CRL) securities during the period from May 5, 2020 through February 21, 2023 (the “Class Period”). Investors have until July 18, 2023 to apply to the Court to be appointed as lead plaintiff in the lawsuit. Charles River provides clinical tests and drug development services internationally. On February 22, 2023, Charles River issued a press release announcing its fourth quarter and full year 2022 financial results, which also revealed that the Company had received a subpoena from the U.S. Department of Justice relating to an ongoing investigation in conjunction with the U.S. Fish and Wildlife Service into the supply chain and illegal importation of non-human primates for research. On the same day, during an earnings call with investors, Defendant James C. Foster, the Company’s Chief Executive Officer, stated that the “investigation in current [non-human primate] supply situation will result in study delays in our Safety Assessment business.” He further stated that the investigation into the Cambodian non-human primate chain would reduce the annual revenue forecast by approximately 200 basis points to 400 basis points. On this news, the price of Charles River shares declined by $24.51 per share, or approximately 10.06%, from $243.60 per share to close at $219.09 on February 22, 2023. The lawsuit alleges that, throughout the Class Period, Defendants made false and/or misleading statements, as well as failed to disclose that: (1) Charles River had engaged in illegal activity with respect to its importation of non-human primates for research; (2) as a result, Charles River was at a heightened risk of criminal and regulatory investigation by the U.S. Department of Justice; and (3) as a result, Charles River would be forced to suspend shipments of primates from Cambodia. If you purchased or otherwise acquired Charles River securities, have information, or would like to learn more about this lawsuit and how it might affect your rights, please contact Thomas W. Elrod of Kirby McInerney LLP by email at investigations@kmllp.com, or by filling out this contact form, to discuss your rights or interests with respect to these matters without any cost to you. Kirby McInerney LLP is a New York-based plaintiffs’ law firm concentrating in securities, antitrust, whistleblower, and consumer litigation. The firm’s efforts on behalf of shareholders in securities litigation have resulted in recoveries totaling billions of dollars. Additional information about the firm can be found at Kirby McInerney LLP’s website: http://www.kmllp.com. This press release may be considered Attorney Advertising in some jurisdictions under the applicable law and ethical rules.", "url": "http://www.businesswire.com/news/home/20230523006114/en/Kirby-McInerney-LLP-Announces-the-Filing-of-a-Securities-Class-Action-on-Behalf-of-Charles-River-Laboratories-International-Inc.-CRL-Investors", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T18:06:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 18:42:00", "publisher": "Business Wire", "title": "Innoviva Specialty Therapeutics Announces FDA Approval for XACDURO® (sulbactam for injection; durlobactam for injection), Co-packaged for Intravenous Use", "image": "https://images.financialmodelingprep.com/news/innoviva-specialty-therapeutics-announces-fda-approval-for-xacduro-sulbactam-20230523.jpg", "site": "businesswire.com", "text": "WALTHAM, Mass.--(BUSINESS WIRE)--Innoviva Specialty Therapeutics, a subsidiary of Innoviva, Inc. (Nasdaq: INVA), today announced that the U.S. Food and Drug Administration (FDA) approved XACDURO® (sulbactam for injection; durlobactam for injection), co-packaged for intravenous use in patients 18 years of age and older for the treatment of hospital-acquired bacterial pneumonia and ventilator-associated bacterial pneumonia (HABP/VABP) caused by susceptible isolates of Acinetobacter baumannii-calcoaceticus complex (Acinetobacter). Innoviva Specialty Therapeutics is focused on delivering innovative therapies in critical care and infectious disease. “XACDURO is the first pathogen-targeted therapy approved to treat hospital-acquired and ventilator-associated pneumonias caused by Acinetobacter. The FDA approval of XACDURO marks an important milestone in our aim to deliver differentiated therapies to critically ill patients who have limited treatment options,” said David Altarac, MD, Chief Medical Officer, Innoviva Specialty Therapeutics. “Drug-resistant Acinetobacter can cause serious and even life-threatening infections that are associated with high morbidity and mortality, and long, expensive hospital stays, as the pathogen continues to acquire resistance genes for almost all antibiotics used to treat Gram-negative bacteria.” The FDA approval was based on an array of scientific evidence, including results from the landmark Phase 3 ATTACK trial evaluating the safety and efficacy of XACDURO versus colistin in patients with infections caused by Acinetobacter. In the trial, XACDURO demonstrated statistical non-inferiority versus colistin for the primary endpoint of 28-day all-cause mortality in patients with carbapenem-resistant Acinetobacter infections and a significant difference in clinical cure rates. XACDURO was well tolerated and exhibited a favorable safety profile across the clinical program. “Acinetobacter poses a significant danger to hospitalized patients, who are generally very ill and particularly susceptible to infections. Effectively treating infections caused by drug-resistant Acinetobacter is a challenge and makes this patient population in high need of new, effective treatment options,” stated Andrew F. Shorr, MD, MPH, MBA, Clinical Professor of Medicine, Georgetown University School of Medicine, Washington, D.C. “I’m encouraged by the approval of co-packaged sulbactam-durlobactam as it means physicians will soon have a novel therapeutic option that may help to address this urgent public health threat.” The New Drug Application (NDA) for XACDURO was filed by Entasis Therapeutics Inc., an affiliate of Innoviva Specialty Therapeutics. XACDURO was granted Priority Review and designated as a Qualified Infectious Disease Product (QIDP). We anticipate that XACDURO will be available to patients later this year. About Acinetobacter Members of the Acinetobacter baumannii-calcoaceticus complex (Acinetobacter) are Gram-negative, opportunistic human pathogens that predominantly infect critically ill patients often resulting in severe pneumonia and bloodstream infections.1 They can also infect other body sites, such as the urinary tract and the skin. Acinetobacter is considered a global threat in the healthcare setting due in part to its ability to acquire multidrug resistance. Acinetobacter is resistant to penicillins and has also acquired resistance genes for almost all antibiotics used to treat Gram-negative bacteria, including fluoroquinolones, aminoglycosides, cephalosporins, and carbapenems. The Centers for Disease Control and Prevention (CDC) has identified carbapenem-resistant micro-organisms as an urgent threat.2 Globally, Acinetobacter baumannii was among the top six leading pathogens for deaths associated with resistance in 2019.3 Carbapenem-resistant Acinetobacter is considered a Priority 1 pathogen by the World Health Organization (WHO).4 In the U.S., there are an estimated 40,000 to 80,000 cases of Acinetobacter each year, and about 40 percent of those are carbapenem-resistant Acinetobacter.5,6 Globally, there are about a million cases each year of Acinetobacter, and about two-thirds of those are carbapenem-resistant Acinetobacter baumannii.5 More than 300,000 global deaths annually are associated with carbapenem-resistant Acinetobacter.7 About XACDURO® XACDURO® (sulbactam for injection; durlobactam for injection), co-packaged for intravenous use is a combination of sulbactam, a beta-lactam antibacterial, and durlobactam, a beta-lactamase inhibitor, approved in patients 18 years of age and older for the treatment of hospital-acquired bacterial pneumonia and ventilator-associated bacterial pneumonia (HABP/VABP) caused by susceptible isolates of Acinetobacter baumannii-calcoaceticus complex (Acinetobacter). XACDURO is not indicated for the treatment of HABP/VABP caused by pathogens other than susceptible isolates of Acinetobacter. XACDURO® IMPORTANT SAFETY INFORMATION Contraindications: XACDURO is contraindicated in patients with a history of known severe hypersensitivity to the components of XACDURO or other beta-lactam antibacterial drugs. Warnings and Precautions: Hypersensitivity was observed in patients treated with XACDURO in clinical trials. Serious and occasionally fatal hypersensitivity (anaphylactic) reactions and serious skin reactions have been reported in patients receiving betalactam antibacterial drugs. Before initiating therapy with XACDURO, careful inquiry should be made concerning previous hypersensitivity reactions to carbapenems, penicillins, cephalosporins, other beta lactams, and other allergens. If an allergic reaction occurs, discontinue XACDURO. Clostridioides difficile-associated diarrhea (CDAD) has been reported with use of nearly all antibacterial agents and may range in severity from mild diarrhea to fatal colitis. Evaluate if diarrhea occurs. If CDAD is suspected or confirmed, the risk/benefit of continuing treatment with XACDURO should be assessed. Prescribing XACDURO in the absence of a proven or strongly suspected bacterial infection or a prophylactic indication is unlikely to provide benefit to the patient and increases the risk of the development of drug-resistant bacteria. Adverse Reactions: The most common adverse reactions reported in >5% of patients treated with XACDURO were liver test abnormalities (19%), diarrhea (17%), anemia (13%), and hypokalemia (12%). Before administering, please see the Full Prescribing Information for XACDURO. About Innoviva Specialty Therapeutics Innoviva Specialty Therapeutics, a subsidiary of Innoviva, Inc., is focused on delivering innovative therapies in critical care and infectious disease. Innoviva Specialty Therapeutics’ products, through its affiliate, La Jolla Pharmaceutical Company, include GIAPREZA® (angiotensin II), approved to increase blood pressure in adults with septic or other distributive shock, and XERAVA® (eravacycline) for the treatment of complicated intra-abdominal infections in adults. Innoviva Specialty Therapeutics’ products, through its affiliate, Entasis Therapeutics Inc., include XACDURO® (sulbactam for injection; durlobactam for injection), co-packaged for intravenous use approved for the treatment of adults with hospital-acquired bacterial pneumonia and ventilator-associated bacterial pneumonia caused by susceptible strains of Acinetobacter baumannii-calcoaceticus complex (Acinetobacter). For more information about Innoviva Specialty Therapeutics, please visit here. About Innoviva Innoviva, Inc., is a diversified holding company with a portfolio of royalties and other healthcare assets, including Innoviva Specialty Therapeutics, a subsidiary focused on delivering innovative therapies in critical care and infectious disease. Innoviva’s royalty portfolio includes respiratory assets partnered with Glaxo Group Limited (GSK), including RELVAR®/BREO® ELLIPTA® (fluticasone furoate/vilanterol, FF/VI) and ANORO® ELLIPTA® (umeclidinium bromide/vilanterol, UMEC/VI). Under the Long-Acting Beta2 Agonist (LABA) Collaboration Agreement, Innoviva is entitled to receive royalties from GSK on sales of RELVAR®/BREO® ELLIPTA® and ANORO® ELLIPTA®. ANORO®, RELVAR® and BREO® are trademarks of the GSK group of companies. For more information on Innoviva, please visit here. Forward Looking Statements This press release contains certain “forward-looking” statements as that term is defined in the Private Securities Litigation Reform Act of 1995 regarding, among other things, statements relating to goals, plans, objectives, and future events. Innoviva intends such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995. The words “anticipate”, “expect”, “goal”, “intend”, “objective”, “opportunity”, “plan”, “potential”, “target” and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements involve substantial risks, uncertainties, and assumptions. These statements are based on the current estimates and assumptions of the management of Innoviva as of the date of this press release and are subject to known and unknown risks, uncertainties, changes in circumstances, assumptions and other factors that may cause the actual results of Innoviva to be materially different from those reflected in the forward-looking statements. Important factors that could cause actual results to differ materially from those indicated by such forward-looking statements include, among others, risks related to: expected cost savings; lower than expected future royalty revenue from respiratory products partnered with GSK; the commercialization of RELVAR®/BREO® ELLIPTA®, ANORO® ELLIPTA® and, formerly, TRELEGY® ELLIPTA® in the jurisdictions in which these products have been approved; the strategies, plans and objectives of Innoviva (including Innoviva’s growth strategy and corporate development initiatives beyond the existing respiratory portfolio); the timing, manner, and amount of potential capital returns to shareholders; the status and timing of clinical studies, data analysis and communication of results; the potential benefits and mechanisms of action of product candidates; expectations for product candidates through development and commercialization; the timing of regulatory approval of product candidates; and projections of revenue, expenses and other financial items; the impact of the novel coronavirus (COVID-19). Other risks affecting Innoviva are described under the headings “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained in Innoviva’s Annual Report on Form 10-K for the year ended December 31, 2022 and Quarterly Reports on Form 10-Q, which are on file with the Securities and Exchange Commission (SEC) and available on the SEC’s website at www.sec.gov. Past performance is not necessarily indicative of future results. No forward-looking statements can be guaranteed, and actual results may differ materially from such statements. Given these uncertainties, you should not place undue reliance on these forward-looking statements. The information in this press release is provided only as of the date hereof, and Innoviva assumes no obligation to update its forward-looking statements on account of new information, future events or otherwise, except as required by law. ______________ 1 Tala, B., Jad, A., Claude, A., Jihad, I., Chantal, L., Rakan, N.,& Eid, A. (2017). Risk Factors, Clinical Presentation, and Outcome of Acinetobacter baumannii Bacteremia. Front. Cell. Infect. Microbiol., 04 May 2017, Sec. Molecular Bacterial Pathogenesis Volume 7 – 2017: https://doi.org/10.3389/fcimb.2017.00156 2 Centers for Disease Control and Prevention, “Carbapenem-resistant Acinetobacter baumannii (CRAB): An urgent public health threat in United States healthcare facilities,” August 2021: https://arpsp.cdc.gov/story/cra-urgent-public-health-threat 3 Antimicrobial Resistance Collaborators. Global burden of bacterial antimicrobial resistance in 2019: a systematic analysis. Lancet. 2022; 399(10325):629-655. https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext 4 World Health Organization, “WHO publishes list of bacteria for which new antibiotics are urgently needed,” February 27, 2017: https://www.who.int/news/item/27-02-2017-who-publishes-list-of-bacteria-for-which-new-antibiotics-are-urgently-needed 5 Spellberg B, Rex JH. The value of single-pathogen antibacterial agents. Nat Rev Drug Discov. 2013 Dec;12(12):963. doi: 10.1038/nrd3957-c1. Epub 2013 Nov 15. 6 Centers for Disease Control and Prevention. Antibiotic Resistance & Patient Safety Portal. “Carbapenem-resistant Acinetobacter,” May 2023: https://arpsp.cdc.gov/profile/antibiotic-resistance/carbapenem-resistant-acinetobacter 7 Antimicrobial Resistance Collaborators. Global burden of bacterial antimicrobial resistance in 2019: a systematic analysis. Lancet. 2022; 399(10325):629-655. Supplementary Material. Supplementary appendix. https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext", "url": "http://www.businesswire.com/news/home/20230523005961/en/Innoviva-Specialty-Therapeutics-Announces-FDA-Approval-for-XACDURO%C2%AE-sulbactam-for-injection-durlobactam-for-injection-Co-packaged-for-Intravenous-Use", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T18:42:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 19:18:50", "publisher": "InvestorPlace", "title": "7 Safe-Haven Stocks to Buy for Protection From a U.S. Debt Default Disaster", "image": "https://images.financialmodelingprep.com/news/7-safehaven-stocks-to-buy-for-protection-from-a-20230523.png", "site": "investorplace.com", "text": "With the debt ceiling issue rating as perhaps the single-most critical issue for the market right now, investors should consider targeting safe-haven stocks for debt default. Naturally, the U.S. government defaulting on its obligations would probably spark a ripple effect.", "url": "https://investorplace.com/2023/05/7-safe-haven-stocks-to-buy-for-protection-from-a-u-s-debt-default-disaster/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T19:18:50-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 19:34:00", "publisher": "Business Wire", "title": "INVESTOR ALERT: Law Offices of Howard G. Smith Continues Investigation of Sanmina Corporation (SANM) Behalf of Investors", "image": "https://images.financialmodelingprep.com/news/investor-alert-law-offices-of-howard-g-smith-continues-20230523.png", "site": "businesswire.com", "text": "BENSALEM, Pa.--(BUSINESS WIRE)--Law Offices of Howard G. Smith continues its investigation on behalf of Sanmina Corporation (“Sanmina” or the “Company”) (NASDAQ: SANM) investors concerning the Company’s possible violations of federal securities laws. On May 11, 2023, Sanmina disclosed that “certain personnel in a division within the Company’s Components, Products and Services business had failed to properly substantiate and update cost estimates for materials and other costs over the life of certain contracts,” and that an independent investigation found that “revenue was over/(understated) by approximately $10.2 million, $18.3 million, ($29.1 million), and $5.6 million, and GAAP earnings per share was over/(understated) by approximately $0.09, $0.29, $0.25, and ($0.06) in the fiscal years ended October 3, 2020, October 2, 2021 and October 1, 2022, and the first fiscal quarter ended December 31, 2022, respectively.” Furthermore, the Company concluded that financial statements issued during the affected periods should no longer be relied upon. On this news, Sanmina’s stock price fell $3.05, or 5.7%, to close at $50.50 per share on May 12, 2023, thereby injuring investors. If you purchased Sanmina securities, have information or would like to learn more about these claims, or have any questions concerning this announcement or your rights or interests with respect to these matters, please contact Howard G. Smith, Esquire, of Law Offices of Howard G. Smith, 3070 Bristol Pike, Suite 112, Bensalem, Pennsylvania 19020 by telephone at (215) 638-4847, toll-free at (888) 638-4847, or by email to howardsmith@howardsmithlaw.com, or visit our website at www.howardsmithlaw.com. This press release may be considered Attorney Advertising in some jurisdictions under the applicable law and ethical rules.", "url": "http://www.businesswire.com/news/home/20230523006130/en/INVESTOR-ALERT-Law-Offices-of-Howard-G.-Smith-Continues-Investigation-of-Sanmina-Corporation-SANM-Behalf-of-Investors", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T19:34:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-23 23:30:00", "publisher": "Business Wire", "title": "United Steelworkers union calls for answers on deadly Kelowna crane collapse", "image": "https://images.financialmodelingprep.com/news/united-steelworkers-union-calls-for-answers-on-deadly-kelowna-20230523.jpg", "site": "businesswire.com", "text": "BURNABY, British Columbia--(BUSINESS WIRE)--The United Steelworkers union (USW) is adding its support to calls for answers into the tragic crane collapse that killed five people in Kelowna, B.C., in July 2021. Kelowna RCMP and WorkSafeBC released a joint statement on Tuesday, May 16, following a 22-month investigation, but decided they would not release the WorkSafeBC investigation report publicly. “The families of the victims and the public deserve to know what happened and if any criminal elements were present. If there were such elements, there needs to be accountability. If there weren’t, then we need to know what happened, so tragic accidents can be prevented in the future,” said Ed Kent, USW Health, Safety and Environment representative for Western Canada. In the statement, the Kelowna RCMP said it is unable to provide specific details of the investigation at this time “in order to protect the integrity of the criminal investigation.” “There seems to be an eye on the criminal aspect of these devastating fatalities. We need to know what the report found and if employer negligence was to blame,” said Kent. “If employer negligence was found, then it’s time to enforce the law. There need to be serious consequences for killing workers, more than just fines. Death cannot be a cost of doing business.” Every year 1,000 workers are killed on the job and too few corporations are held criminally accountable. The USW national campaign to enforce the 2004 Westray Law, amendments to the Criminal Code, is aimed at ending the continuing carnage in Canada’s workplaces. “Our union has been fighting long and hard to have workplace fatalities and injuries investigated as criminal events, but convictions are too few and far between. It’s quite simple, really – if you kill a worker, you go to jail,” said Kent. The USW’s national campaign, “Stop the Killing, Enforce the Law,” targets all levels of government, law enforcement, attorneys general, and Crown prosecutors. The campaign’s goals include increased training for law enforcement and Crown prosecutors in using the Westray Law and the appointment of dedicated police officers and prosecutors to investigate and prosecute workplace fatalities when gross negligence is involved. The USW represents 225,000 members in nearly every economic sector across Canada and is the largest private-sector union in North America, with 850,000 members in Canada, the United States and the Caribbean. Each year, thousands of workers choose to join the USW because of our strong track record in creating healthier, safer and more respectful workplaces and negotiating better working conditions and fairer compensation – including good wages, benefits and pensions. For more information on USW’s campaign “Stop the Killing, Enforce the Law,” see www.usw.ca/stopthekilling.", "url": "http://www.businesswire.com/news/home/20230523006154/en/United-Steelworkers-union-calls-for-answers-on-deadly-Kelowna-crane-collapse", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-23T23:30:00-04:00", "date_et": "2023-05-23"}
{"symbol": "COST", "publishedDate": "2023-05-24 05:55:00", "publisher": "The Motley Fool", "title": "Better Buy: Amazon vs. Costco Wholesale", "image": "https://images.financialmodelingprep.com/news/better-buy-amazon-vs-costco-wholesale-20230524.jpg", "site": "fool.com", "text": "Both stocks have a long record of beating market averages. Amazon is funneling more investment into its e-commerce operations to widen its competitive lead.", "url": "https://www.fool.com/investing/2023/05/24/better-buy-amazon-vs-costco-wholesale/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-24T05:55:00-04:00", "date_et": "2023-05-24"}
{"symbol": "COST", "publishedDate": "2023-05-24 10:28:10", "publisher": "24/7 Wall Street", "title": "Earnings Previews: Costco, Gap, Marvell, Pinduoduo", "image": "https://images.financialmodelingprep.com/news/earnings-previews-costco-gap-marvell-pinduoduo-20230524.jpg", "site": "247wallst.com", "text": "In the first half-hour of trading on Tuesday, the Dow Jones industrials were down 0.58%, the S&P 500 down 0.67% and the Nasdaq 0.62% lower.", "url": "https://247wallst.com/investing/2023/05/24/earnings-previews-costco-gap-marvell-pinduoduo/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-24T10:28:10-04:00", "date_et": "2023-05-24"}
{"symbol": "COST", "publishedDate": "2023-05-24 14:01:08", "publisher": "Schaeffers Research", "title": "Costco Stock Extends Slide Before Earnings", "image": "https://images.financialmodelingprep.com/news/costco-stock-extends-slide-before-earnings-20230524.jpg", "site": "schaeffersresearch.com", "text": "Costco Wholesale Corp (NASDAQ:COST) is set to announce its fiscal third-quarter earnings report after the close tomorrow, Thursday, May 25.", "url": "https://www.schaeffersresearch.com/content/news/2023/05/24/costco-stock-extends-slide-before-earnings", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-24T14:01:08-04:00", "date_et": "2023-05-24"}
{"symbol": "COST", "publishedDate": "2023-05-24 18:14:04", "publisher": "Zacks Investment Research", "title": "Time to Buy Costco (COST) or Dollar Tree (DLTR) Stock as Earnings Approach?", "image": "https://images.financialmodelingprep.com/news/time-to-buy-costco-cost-or-dollar-tree-dltr-20230524.jpg", "site": "zacks.com", "text": "Two of the more notable retailers reporting their quarterly results this week are Costco (COST)) and Dollar Tree (DLTR) with both set to report on Thursday, May 25.", "url": "https://www.zacks.com/stock/news/2099306/time-to-buy-costco-cost-or-dollar-tree-dltr-stock-as-earnings-approach", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-24T18:14:04-04:00", "date_et": "2023-05-24"}
{"symbol": "COST", "publishedDate": "2023-05-25 07:00:03", "publisher": "Forbes", "title": "What To Watch For In Costco's Stock Post Q3?", "image": "https://images.financialmodelingprep.com/news/what-to-watch-for-in-costcos-stock-post-q3-20230525.jpg", "site": "forbes.com", "text": "We expect Costco to likely beat the revenue and earnings expectations.", "url": "https://www.forbes.com/sites/greatspeculations/2023/05/25/what-to-watch-for-in-costcos-stock-post-q3/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T07:00:03-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 15:15:52", "publisher": "Benzinga", "title": "Trading Strategies for Costco Stock Before And After Q3 Earnings - Costco Wholesale (NASDAQ:COST)", "image": "https://images.financialmodelingprep.com/news/trading-strategies-for-costco-stock-before-and-after-q3-20230525.jpg", "site": "benzinga.com", "text": "Costco Wholesale Corporation COST was trading slightly higher Thursday heading into its third-quarter financial results, which are set to print after the market close.", "url": "https://www.benzinga.com/trading-ideas/long-ideas/23/05/32582323/trading-strategies-for-costco-stock-before-and-after-q3-earnings?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T15:15:52-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 16:15:00", "publisher": "GlobeNewsWire", "title": "Costco Wholesale Corporation Reports Third Quarter and Year-to-Date Operating Results for Fiscal 2023", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-corporation-reports-third-quarter-and-yeartodate-operating-20230525.jpg", "site": "globenewswire.com", "text": "ISSAQUAH, Wash., May 25, 2023 (GLOBE NEWSWIRE) -- Costco Wholesale Corporation (“Costco” or the “Company”) (Nasdaq: COST) today announced its operating results for the third quarter (twelve weeks) and the first 36 weeks of fiscal 2023, ended May 7, 2023.", "url": "https://www.globenewswire.com/news-release/2023/05/25/2676719/0/en/Costco-Wholesale-Corporation-Reports-Third-Quarter-and-Year-to-Date-Operating-Results-for-Fiscal-2023.html", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T16:15:00-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 16:31:00", "publisher": "Barron's", "title": "Costco Stock Falls as Earnings, Sales Come Short", "image": "https://images.financialmodelingprep.com/news/costco-stock-falls-as-earnings-sales-come-short-20230525.jpg", "site": "barrons.com", "text": "The company's same-store sales increased 0.3% this quarter, less than what analysts were forecasting.", "url": "https://www.barrons.com/articles/costco-stock-falls-earnings-28c16a51", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T16:31:00-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 16:40:00", "publisher": "Market Watch", "title": "Costco results miss expectations, as U.S. same-store sales decline", "image": "https://images.financialmodelingprep.com/news/costco-results-miss-expectations-as-us-samestore-sales-decline-20230525.jpg", "site": "marketwatch.com", "text": "Shares of Costco Wholesale Corp. COST, +0.79% fell 1.5% after hours on Thursday after the membership warehouse retailer reported fiscal third-quarter results that missed expectations, with a same-store sales decline in the U.S. The company reported net income of $1.3 billion, or $2.93 a share, compared with $1.35 billion, or $3.04 a share, in the same quarter last year. Sales rose 1.9% to $52.6 billion, compared with $51.61 billion in the prior-year quarter.", "url": "https://www.marketwatch.com/story/costco-results-miss-expectations-as-u-s-same-store-sales-decline-ed9efb78", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T16:40:00-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 16:42:48", "publisher": "Proactive Investors", "title": "Costco Wholesale 3Q results miss estimates; stock sags after hours", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-3q-results-miss-estimates-stock-sags-after-20230525.jpg", "site": "proactiveinvestors.com", "text": "Costco Wholesale Corporation (NASDAQ:COST) saw its third-quarter 2023 net sales edge up 1.9% year over year to $52.6 billion, with net income for the period of $1.3 billion, $2.93 per diluted share, which includes a non-recurring charge to merchandise costs of $298 million. The charge was primarily for the discontinuation of its charter shipping activities, the company said.", "url": "https://www.proactiveinvestors.com/companies/news/1016156?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T16:42:48-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 21:16:16", "publisher": "Fox Business", "title": "Costco CFO says company has been 'fortunate' to avoid theft", "image": "https://images.financialmodelingprep.com/news/costco-cfo-says-company-has-been-fortunate-to-avoid-20230525.jpg", "site": "foxbusiness.com", "text": "Costco CFO Richard Galanti said Thursday during the company's third-quarter earnings call the company has been \"fortunate\" regarding theft.", "url": "https://www.foxbusiness.com/retail/costco-cfo-says-company-fortunate-avoid-theft", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T21:16:16-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-25 22:24:08", "publisher": "Seeking Alpha", "title": "Costco Wholesale Corporation (COST) Q3 2023 Earnings Call Transcript", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-corporation-cost-q3-2023-earnings-call-transcript-20230525.jpg", "site": "seekingalpha.com", "text": "Costco Wholesale Corporation (NASDAQ:COST ) Q3 2023 Earnings Conference Call May 25, 2023 5:00 PM ET Company Participants Richard Galanti - CFO Conference Call Participants Michael Lasser - UBS Simeon Gutman - Morgan Stanley Christopher Horvers - JPMorgan Scot Ciccarelli - Truist Securities Karen Short - Credit Suisse John Heinbockel - Guggenheim Securities Oliver Chen - TD Cowen Scott Mushkin - R5 Capital Brandon Cheatham - Citi Rupesh Parikh - Oppenheimer & Co Operator Ladies and gentlemen, thank you for standing by, and welcome to Costco Wholesale Corporation's Fiscal Q3 2023 Conference Call. All lines have been placed on mute to prevent any background noise.", "url": "https://seekingalpha.com/article/4607513-costco-wholesale-corporation-cost-q3-2023-earnings-call-transcript", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-25T22:24:08-04:00", "date_et": "2023-05-25"}
{"symbol": "COST", "publishedDate": "2023-05-26 06:45:00", "publisher": "Forbes", "title": "Costco Sees Deflation In Their Third Quarter", "image": "https://images.financialmodelingprep.com/news/costco-sees-deflation-in-their-third-quarter-20230526.jpg", "site": "forbes.com", "text": "Costco reported 3rd quarter 2023 results.", "url": "https://www.forbes.com/sites/walterloeb/2023/05/26/costco-sees-deflation-in-their-third-quarter/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-26T06:45:00-04:00", "date_et": "2023-05-26"}
{"symbol": "COST", "publishedDate": "2023-05-26 10:11:12", "publisher": "MarketBeat", "title": "Costco's Earnings Call Reassure Economists, Recession Cancelled", "image": "https://images.financialmodelingprep.com/news/costcos-earnings-call-reassure-economists-recession-cancelled-20230526.jpg", "site": "marketbeat.com", "text": "Some investors are blessed with the opportunity to participate in the growth and development of a business that genuinely carries the 'recession-proof' badge of honor. Unfortunately, recession concerns have recently increased the fear gauge in markets, with many beginning to withdraw from equities and look for alternative 'safer' investments like government bonds.", "url": "https://www.marketbeat.com/originals/costcos-earnings-call-reassure-economists-recession-cancelled/?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-26T10:11:12-04:00", "date_et": "2023-05-26"}
{"symbol": "COST", "publishedDate": "2023-05-26 11:20:06", "publisher": "Zacks Investment Research", "title": "Costco's (COST) Q3 Top Line Lags, Comparable Sales Up 0.3%", "image": "https://images.financialmodelingprep.com/news/costcos-cost-q3-top-line-lags-comparable-sales-up-20230526.jpg", "site": "zacks.com", "text": "Costco (COST) registers a comparable sales increase of 0.3% in the third quarter of fiscal 2023. Meanwhile, comparable e-commerce sales decrease 10% in the quarter.", "url": "https://www.zacks.com/stock/news/2100265/costco-s-cost-q3-top-line-lags-comparable-sales-up-0-3", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-26T11:20:06-04:00", "date_et": "2023-05-26"}
{"symbol": "COST", "publishedDate": "2023-05-26 15:05:38", "publisher": "Proactive Investors", "title": "Costco Wholesale stock is underpriced and worth COST of admission", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-stock-is-underpriced-and-worth-cost-of-20230526.jpg", "site": "proactiveinvestors.com", "text": "Costco Wholesale Corporation (NASDAQ:COST) (COST) is well positioned to meet consumer demand in a variety of different economic environments, according to analysts at UBS, who believe its shares are “underpriced at current levels” and worth the COST of admission. Despite the optimism, they lowered their target price on the bulk retailer to $560 per share, from $575 previously, while also noting that the company's solid growth prospects support its premium valuation.", "url": "https://www.proactiveinvestors.com/companies/news/1016260?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-26T15:05:38-04:00", "date_et": "2023-05-26"}
{"symbol": "COST", "publishedDate": "2023-05-27 06:00:00", "publisher": "The Motley Fool", "title": "A Pending Restaurant IPO and AI Buzz", "image": "https://images.financialmodelingprep.com/news/a-pending-restaurant-ipo-and-ai-buzz-20230527.jpg", "site": "fool.com", "text": "Mediterranean restaurant chain Cava has filed to go public later this year. Will investors be as satisfied as Cava's customers?", "url": "https://www.fool.com/investing/2023/05/27/a-pending-restaurant-ipo-and-ai-buzz/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-27T06:00:00-04:00", "date_et": "2023-05-27"}
{"symbol": "COST", "publishedDate": "2023-05-27 07:35:41", "publisher": "Fox Business", "title": "Costco CFO talks eggs, nuts and meat inflation", "image": "https://images.financialmodelingprep.com/news/costco-cfo-talks-eggs-nuts-and-meat-inflation-20230527.jpg", "site": "foxbusiness.com", "text": "Costco CFO Richard Galanti on Thursday offered some observations on inflationary pressures, saying they continue to \"abate somewhat\" for the retailer.", "url": "https://www.foxbusiness.com/economy/costco-cfo-talks-eggs-nuts-meat-inflation", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-27T07:35:41-04:00", "date_et": "2023-05-27"}
{"symbol": "COST", "publishedDate": "2023-05-27 09:00:00", "publisher": "The Motley Fool", "title": "3 Amazing Dividend Stocks That Should Pay You Forever", "image": "https://images.financialmodelingprep.com/news/3-amazing-dividend-stocks-that-should-pay-you-forever-20230527.jpg", "site": "fool.com", "text": "Starbucks changes with consumer trends to maintain high sales growth. Williams-Sonoma has a long history of consistent growth and pays a market-beating yield of 2.9%.", "url": "https://www.fool.com/investing/2023/05/27/amazing-dividend-stocks-pay-forever-sbux-cost/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-27T09:00:00-04:00", "date_et": "2023-05-27"}
{"symbol": "COST", "publishedDate": "2023-05-28 09:06:00", "publisher": "The Motley Fool", "title": "Costco Is Growing Where It Matters Most", "image": "https://images.financialmodelingprep.com/news/costco-is-growing-where-it-matters-most-20230528.jpg", "site": "fool.com", "text": "Costco reported fiscal third-quarter net sales and earnings per share below consensus analyst forecasts. Excluding some one-time items, Costco's net income grew sharply despite a higher tax rate.", "url": "https://www.fool.com/investing/2023/05/28/costco-is-growing-where-it-matters-most/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-28T09:06:00-04:00", "date_et": "2023-05-28"}
{"symbol": "COST", "publishedDate": "2023-05-29 18:44:20", "publisher": "InvestorPlace", "title": "3 Safe Stocks to Buy to Sleep Like a Baby", "image": "https://images.financialmodelingprep.com/news/3-safe-stocks-to-buy-to-sleep-like-a-20230529.jpg", "site": "investorplace.com", "text": "When the Covid-19 crisis faded, Americans finally looked forward to a broader recovery, which on paper doesn't necessarily incentivize the best sleep-well-at-night stocks. However, lingering headwinds – such as stubbornly high inflation – along with fresh negative catalysts (most notably a worsening geopolitical backdrop) require a rethink of reliable enterprises.", "url": "https://investorplace.com/2023/05/3-safe-stocks-to-buy-to-sleep-like-a-baby/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-29T18:44:20-04:00", "date_et": "2023-05-29"}
{"symbol": "COST", "publishedDate": "2023-05-30 07:15:00", "publisher": "The Motley Fool", "title": "Is Costco About to Pay Another Special Dividend?", "image": "https://images.financialmodelingprep.com/news/is-costco-about-to-pay-another-special-dividend-20230530.jpg", "site": "fool.com", "text": "The giant retailer has paid four special dividends to investors since 2012. Costco has been conserving cash, making another special dividend likely.", "url": "https://www.fool.com/investing/2023/05/30/is-costco-about-to-pay-another-special-dividend/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-30T07:15:00-04:00", "date_et": "2023-05-30"}
{"symbol": "COST", "publishedDate": "2023-05-30 08:05:00", "publisher": "Seeking Alpha", "title": "8% Yielding 'Strong Buy' REIT Preferred Shares", "image": "https://images.financialmodelingprep.com/news/8-yielding-strong-buy-reit-preferred-shares-20230530.jpg", "site": "seekingalpha.com", "text": "Many preferred stocks are now heavily discounted and offer high yields. Since real estate is well-known for its cash generation capabilities, REIT preferreds often offer better risk-to-reward. We discuss two REIT preferreds with yields above 8% for your consideration.", "url": "https://seekingalpha.com/article/4607891-8-percent-yielding-strong-buy-reit-preferred-shares", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-30T08:05:00-04:00", "date_et": "2023-05-30"}
{"symbol": "COST", "publishedDate": "2023-05-30 10:00:00", "publisher": "The Motley Fool", "title": "After a Lackluster Earnings Report, Is Now the Time to Buy Costco Stock?", "image": "https://images.financialmodelingprep.com/news/after-a-lackluster-earnings-report-is-now-the-time-20230530.jpg", "site": "fool.com", "text": "Net income fell as it shut down its charter shipping activities. Still, the share price rose following the announcement.", "url": "https://www.fool.com/investing/2023/05/30/after-lackluster-report-now-time-buy-costco/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-30T10:00:00-04:00", "date_et": "2023-05-30"}
{"symbol": "COST", "publishedDate": "2023-05-30 10:10:00", "publisher": "Market Watch", "title": "13 retailers posted a good earnings season based on two key measures. Are their stocks worth a look?", "image": "https://images.financialmodelingprep.com/news/13-retailers-posted-a-good-earnings-season-based-on-20230530.jpg", "site": "marketwatch.com", "text": "Every earnings season there are retail horror stories but also some companies that stand out in a competitive environment. Below is a list of 13 U.S. retailers that have put up good quarterly numbers.", "url": "https://www.marketwatch.com/story/13-retailers-posted-a-good-earnings-season-based-on-two-key-measures-are-their-stocks-worth-a-look-6d3f310", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-30T10:10:00-04:00", "date_et": "2023-05-30"}
{"symbol": "COST", "publishedDate": "2023-05-31 05:10:00", "publisher": "The Motley Fool", "title": "Why Coca-Cola, Costco, and Starbucks Are No-Brainer Buys Right Now", "image": "https://images.financialmodelingprep.com/news/why-cocacola-costco-and-starbucks-are-nobrainer-buys-right-20230531.jpg", "site": "fool.com", "text": "Coca-Cola is as reliable as you can get for dividend payments. Costco still draws new members and demonstrates operational health even in the pressured economy.", "url": "https://www.fool.com/investing/2023/05/31/why-coca-cola-costco-starbucks-no-brainer-buys/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-31T05:10:00-04:00", "date_et": "2023-05-31"}
{"symbol": "COST", "publishedDate": "2023-05-31 09:39:25", "publisher": "CNBC", "title": "These are the 7 most loved brands in America—Apple and Amazon just missed the cut", "image": "https://images.financialmodelingprep.com/news/these-are-the-7-most-loved-brands-in-americaapple-20230531.jpg", "site": "cnbc.com", "text": "The seven brands with the best reputations in the U.S. include apparel company Patagonia, fast food giant Chick-fil-A and automaker Toyota — not Apple or Amazon.", "url": "https://www.cnbc.com/2023/05/31/companies-with-best-us-reputations-patagonia-costco-john-deere.html", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-31T09:39:25-04:00", "date_et": "2023-05-31"}
{"symbol": "COST", "publishedDate": "2023-05-31 10:11:56", "publisher": "The Motley Fool", "title": "Looking for Sizable Dividend Growth? Look No Further Than Costco Stock", "image": "https://images.financialmodelingprep.com/news/looking-for-sizable-dividend-growth-look-no-further-than-20230531.jpg", "site": "fool.com", "text": "Costco's net sales edged higher in its fiscal Q3. The company should have a long runway of dividend growth ahead of it.", "url": "https://www.fool.com/investing/2023/05/31/looking-dividend-growth-look-for-costco-stock/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-31T10:11:56-04:00", "date_et": "2023-05-31"}
{"symbol": "COST", "publishedDate": "2023-05-31 15:43:54", "publisher": "InvestorPlace", "title": "4 Dividend Stocks to Play Defense", "image": "https://images.financialmodelingprep.com/news/4-dividend-stocks-to-play-defense-20230531.jpg", "site": "investorplace.com", "text": "So far, the stock market has seemingly shrugged off fears of default if the U.S. debt ceiling is not raised. But intelligent investors may want to play it safe with dividend stocks.", "url": "https://investorplace.com/2023/05/4-dividend-stocks-to-play-defense/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-05-31T15:43:54-04:00", "date_et": "2023-05-31"}
{"symbol": "COST", "publishedDate": "2023-06-01 08:04:49", "publisher": "CNN", "title": "Macy's and Costco sound a warning about the economy", "image": "https://images.financialmodelingprep.com/news/macys-and-costco-sound-a-warning-about-the-economy-20230601.jpg", "site": "cnn.com", "text": "Macy's, Costco and other big chains say shoppers are pulling back at their stores and changing what they buy. That could be a red flag for the US economy.", "url": "https://www.cnn.com/2023/06/01/investing/macys-earnings-costco/index.html", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-01T08:04:49-04:00", "date_et": "2023-06-01"}
{"symbol": "COST", "publishedDate": "2023-06-01 10:04:36", "publisher": "Zacks Investment Research", "title": "Costco Wholesale Corporation (COST) Is a Trending Stock: Facts to Know Before Betting on It", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-corporation-cost-is-a-trending-stock-facts-to-20230601.jpg", "site": "zacks.com", "text": "Zacks.com users have recently been watching Costco (COST) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.", "url": "https://www.zacks.com/stock/news/2102447/costco-wholesale-corporation-cost-is-a-trending-stock-facts-to-know-before-betting-on-it", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-01T10:04:36-04:00", "date_et": "2023-06-01"}
{"symbol": "COST", "publishedDate": "2023-06-01 16:15:00", "publisher": "GlobeNewsWire", "title": "Costco Wholesale Corporation Reports May Sales Results", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-corporation-reports-may-sales-results-20230601.jpg", "site": "globenewswire.com", "text": "ISSAQUAH, Wash., June 01, 2023 (GLOBE NEWSWIRE) -- Costco Wholesale Corporation (“Costco” or the “Company”) (Nasdaq: COST) today reported net sales of $18.45 billion for the retail month of May, the four weeks ended May 28, 2023, an increase of 1.2 percent from $18.23 billion last year.", "url": "https://www.globenewswire.com/news-release/2023/06/01/2680848/0/en/Costco-Wholesale-Corporation-Reports-May-Sales-Results.html", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-01T16:15:00-04:00", "date_et": "2023-06-01"}
{"symbol": "COST", "publishedDate": "2023-06-01 16:35:00", "publisher": "Market Watch", "title": "Costco stock drops 1% after May online sales fall nearly 8%", "image": "https://images.financialmodelingprep.com/news/costco-stock-drops-1-after-may-online-sales-fall-20230601.jpg", "site": "marketwatch.com", "text": "Costco Wholesale Corp. COST said late Thursday its May sales rose 1.2% to $18.45 billion, from $18.23 billion in May 2022. Comparable-store sales fell 0.3%, including a 1.3% decline in U.S. comparable-store sales.", "url": "https://www.marketwatch.com/story/costco-stock-drops-1-after-may-online-sales-fall-nearly-8-e1df6af4", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-01T16:35:00-04:00", "date_et": "2023-06-01"}
{"symbol": "COST", "publishedDate": "2023-06-01 18:06:05", "publisher": "Zacks Investment Research", "title": "Costco (COST) Reports Q3 Earnings: What Key Metrics Have to Say", "image": "https://images.financialmodelingprep.com/news/costco-cost-reports-q3-earnings-what-key-metrics-have-to-20230601.jpg", "site": "zacks.com", "text": "While the top- and bottom-line numbers for Costco (COST) give a sense of how the business performed in the quarter ended May 2023, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.", "url": "https://www.zacks.com/stock/news/2102818/costco-cost-reports-q3-earnings-what-key-metrics-have-to-say", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-01T18:06:05-04:00", "date_et": "2023-06-01"}
{"symbol": "COST", "publishedDate": "2023-06-02 05:03:00", "publisher": "The Motley Fool", "title": "1 Reason Not to Worry About Costco Stock in 2023", "image": "https://images.financialmodelingprep.com/news/1-reason-not-to-worry-about-costco-stock-in-2023-20230602.jpg", "site": "fool.com", "text": "Sales growth slowed to a crawl in the U.S market this past quarter. Still, Costco's renewal rate remained in record-high territory.", "url": "https://www.fool.com/investing/2023/06/02/1-reason-not-to-worry-about-costco-stock-in-2023/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T05:03:00-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-02 05:52:00", "publisher": "The Motley Fool", "title": "5 Smart Reasons to Buy Costco Stock Right Now", "image": "https://images.financialmodelingprep.com/news/5-smart-reasons-to-buy-costco-stock-right-now-20230602.jpeg", "site": "fool.com", "text": "The warehouse chain has little to fear from a recession. When it comes to profits, Costco is a picture of consistency.", "url": "https://www.fool.com/investing/2023/06/02/5-smart-reasons-to-buy-costco-stock-right-now/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T05:52:00-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-02 06:05:00", "publisher": "The Motley Fool", "title": "3 Top E-Commerce Stocks to Buy in June", "image": "https://images.financialmodelingprep.com/news/3-top-ecommerce-stocks-to-buy-in-june-20230602.jpg", "site": "fool.com", "text": "Amazon has the most to gain from e-commerce growth with its dominating market share. Meanwhile, PayPal's role as a leading payment service could see it flourish as the market recovers.", "url": "https://www.fool.com/investing/2023/06/02/3-top-e-commerce-stocks-to-buy-in-june/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T06:05:00-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-02 09:30:18", "publisher": "24/7 Wall Street", "title": "Costco's Troubles", "image": "https://images.financialmodelingprep.com/news/costcos-troubles-20230602.jpg", "site": "247wallst.com", "text": "Costco Wholesale Corp. (NASDAQ: COST) is often cited as the best-run large retailer in the United States.", "url": "https://247wallst.com/retail/2023/06/02/costcos-troubles/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T09:30:18-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-02 11:15:56", "publisher": "GuruFocus", "title": "Costco Executives Drop an Economic Bomb", "image": "https://images.financialmodelingprep.com/news/costco-executives-drop-an-economic-bomb-20230602.jpg", "site": "gurufocus.com", "text": "Costco Wholesale Corporation ( COST , Financial), a leading global bulk retailer that has warehouse club operations in 11 countries, has just reported its third-quarter fiscal 2023 earnings, and it was a mixed bag. However, the company itself is not what has investors worried following the earnings report.", "url": "https://www.gurufocus.com/news/2013101/costco-executives-drop-an-economic-bomb", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T11:15:56-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-02 14:09:06", "publisher": "Zacks Investment Research", "title": "Costco (COST) Witnesses Dismal Comparable Sales in May", "image": "https://images.financialmodelingprep.com/news/costco-cost-witnesses-dismal-comparable-sales-in-may-20230602.jpg", "site": "zacks.com", "text": "Costco's (COST) May sales results disappoint investors. Comparable sales decline 0.3% during the month under review.", "url": "https://www.zacks.com/stock/news/2103409/costco-cost-witnesses-dismal-comparable-sales-in-may", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-02T14:09:06-04:00", "date_et": "2023-06-02"}
{"symbol": "COST", "publishedDate": "2023-06-03 07:30:00", "publisher": "The Motley Fool", "title": "Tech Companies Have Lots of News for Their Investors", "image": "https://images.financialmodelingprep.com/news/tech-companies-have-lots-of-news-for-their-investors-20230603.jpg", "site": "fool.com", "text": "Nvidia, Intuit, Zoom, and more.", "url": "https://www.fool.com/investing/2023/06/03/tech-companies-have-lots-of-news-for-their-investo/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-03T07:30:00-04:00", "date_et": "2023-06-03"}
{"symbol": "COST", "publishedDate": "2023-06-04 05:30:00", "publisher": "The Motley Fool", "title": "What Costco's Weak Results Could Mean for the Retail Sector", "image": "https://images.financialmodelingprep.com/news/what-costcos-weak-results-could-mean-for-the-retail-20230604.jpg", "site": "fool.com", "text": "Costco's top line was up from a year ago but below analyst consensus estimates. The company highlighted an important divergence between broad product categories.", "url": "https://www.fool.com/investing/2023/06/04/what-costco-weak-results-could-mean-for-the-retail/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-04T05:30:00-04:00", "date_et": "2023-06-04"}
{"symbol": "COST", "publishedDate": "2023-06-04 09:05:00", "publisher": "The Motley Fool", "title": "Better Buy: Costco vs. BJ's Wholesale Stock", "image": "https://images.financialmodelingprep.com/news/better-buy-costco-vs-bjs-wholesale-stock-20230604.jpg", "site": "fool.com", "text": "These retailers both look attractive as investments today. Costco stock will appeal to more cautious investors.", "url": "https://www.fool.com/investing/2023/06/04/better-buy-costco-vs-bj-wholesale-stock/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-04T09:05:00-04:00", "date_et": "2023-06-04"}
{"symbol": "COST", "publishedDate": "2023-06-04 09:14:00", "publisher": "The Motley Fool", "title": "Stock Split Watch: Is Costco Next?", "image": "https://images.financialmodelingprep.com/news/stock-split-watch-is-costco-next-20230604.jpg", "site": "fool.com", "text": "With a share price of around $500, Costco is a good candidate for a stock split. Costco has had three stock splits in its history, with the last one coming in 2000.", "url": "https://www.fool.com/investing/2023/06/04/stock-split-watch-is-costco-next/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-04T09:14:00-04:00", "date_et": "2023-06-04"}
{"symbol": "COST", "publishedDate": "2023-06-04 10:00:00", "publisher": "The Motley Fool", "title": "1 Under-the-Radar Growth Stock to Buy In June", "image": "https://images.financialmodelingprep.com/news/1-undertheradar-growth-stock-to-buy-in-june-20230604.jpg", "site": "fool.com", "text": "Costco has become one of the world's most successful retailers. Its shares have outperformed competitors like Amazon and Walmart.", "url": "https://www.fool.com/investing/2023/06/04/1-under-the-radar-growth-stock-to-buy-in-june/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-04T10:00:00-04:00", "date_et": "2023-06-04"}
{"symbol": "COST", "publishedDate": "2023-06-05 08:41:24", "publisher": "Seeking Alpha", "title": "Walmart Vs. Costco: Is The Dividend Aristocrat The Better Buy?", "image": "https://images.financialmodelingprep.com/news/walmart-vs-costco-is-the-dividend-aristocrat-the-better-20230605.jpg", "site": "seekingalpha.com", "text": "Over the last year, Walmart has outperformed Costco. Walmart's margins are much higher than Costco's. Costco increases its dividend faster than Walmart.", "url": "https://seekingalpha.com/article/4609412-walmart-vs-costco-is-the-dividend-aristocrat-the-better-buy", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-05T08:41:24-04:00", "date_et": "2023-06-05"}
{"symbol": "COST", "publishedDate": "2023-06-05 11:33:57", "publisher": "Seeking Alpha", "title": "Costco Wholesale Offers An Attractive Entry Price (Technical Analysis)", "image": "https://images.financialmodelingprep.com/news/costco-wholesale-offers-an-attractive-entry-price-technical-analysis-20230605.jpg", "site": "seekingalpha.com", "text": "Costco Wholesale Corp has broken out of a symmetrical triangle formation and is showing bullish momentum with institutional buying support. The trade offers an acceptable risk to reward ratio of over 5, with a price target of $715.86, entry price at the current level, and a stop loss at $475. One concern is COST's underperformance compared to the S&P 500 index, suggesting investors might be better off buying the index instead.", "url": "https://seekingalpha.com/article/4609458-costco-wholesale-offers-an-attractive-entry-price", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-05T11:33:57-04:00", "date_et": "2023-06-05"}
{"symbol": "COST", "publishedDate": "2023-06-06 05:25:00", "publisher": "The Motley Fool", "title": "Costco's Latest Earnings Results Aren't All That Concerning", "image": "https://images.financialmodelingprep.com/news/costcos-latest-earnings-results-arent-all-that-concerning-20230606.jpg", "site": "fool.com", "text": "Costco's bottom line missed expectations last quarter but in terms of profit margin, it wasn't that bad of a quarter for the company. Sales growth of 2% was also a bit misleading as it was gas prices and foreign exchange that weighed down its top line.", "url": "https://www.fool.com/investing/2023/06/06/costcos-latest-earnings-results-arent-all-that-con/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-06T05:25:00-04:00", "date_et": "2023-06-06"}
{"symbol": "COST", "publishedDate": "2023-06-06 07:58:51", "publisher": "MarketBeat", "title": "Celsius Jumps Nearly 5% As Piper Sandler Boosts Price Target", "image": "https://images.financialmodelingprep.com/news/celsius-jumps-nearly-5-as-piper-sandler-boosts-price-20230606.jpg", "site": "marketbeat.com", "text": "For many consumers, energy drinks have evolved into a product characterized as “must haves,” which fall under the consumer staples category. One of the category leaders, in terms of sales and earnings growth, as well as stock price appreciation, is Celsius Holdings Inc. NASDAQ: CELH.", "url": "https://www.marketbeat.com/originals/celsius-jumps-nearly-5-as-piper-sandler-boosts-price-target/?SNAPI", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-06T07:58:51-04:00", "date_et": "2023-06-06"}
{"symbol": "COST", "publishedDate": "2023-06-06 10:15:00", "publisher": "The Motley Fool", "title": "If I Could Buy Only 1 Stock, This Would Be It", "image": "https://images.financialmodelingprep.com/news/if-i-could-buy-only-1-stock-this-would-20230606.jpg", "site": "fool.com", "text": "Costco's growth is slowing as the economy comes under pressure, but underlying metrics remain strong. Its model counterintuitively aims for a low gross margin, but achieves a high operating margin.", "url": "https://www.fool.com/investing/2023/06/06/if-i-could-buy-only-1-stock-this-would-be-it/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-06T10:15:00-04:00", "date_et": "2023-06-06"}
{"symbol": "COST", "publishedDate": "2023-06-07 08:30:00", "publisher": "The Motley Fool", "title": "Wall Street Is Bullish on Costco Stock: Why Things Could Get Murky for Investors", "image": "https://images.financialmodelingprep.com/news/wall-street-is-bullish-on-costco-stock-why-things-20230607.jpg", "site": "fool.com", "text": "Costco stock trades at nearly its highest price-to-earnings ratio since the early 2000s. Highly valued stocks need lots of growth to support it, but Costco is reporting slowing growth.", "url": "https://www.fool.com/investing/2023/06/07/wall-street-bullish-costco-investors/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-07T08:30:00-04:00", "date_et": "2023-06-07"}
{"symbol": "COST", "publishedDate": "2023-06-07 19:39:32", "publisher": "InvestorPlace", "title": "7 Growth Stocks That Could Skyrocket in the Next 12 Months", "image": "https://images.financialmodelingprep.com/news/7-growth-stocks-that-could-skyrocket-in-the-next-20230607.jpg", "site": "investorplace.com", "text": "While we're not there quite yet, the stock market looks like it's on the cusp of a bull run. Technology stocks have been leading the way higher.", "url": "https://investorplace.com/2023/06/7-growth-stocks-that-could-skyrocket-in-the-next-12-months/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-07T19:39:32-04:00", "date_et": "2023-06-07"}
{"symbol": "COST", "publishedDate": "2023-06-08 05:37:00", "publisher": "The Motley Fool", "title": "My Top 3 Dividend Stocks to Buy Now", "image": "https://images.financialmodelingprep.com/news/my-top-3-dividend-stocks-to-buy-now-20230608.jpg", "site": "fool.com", "text": "Apple just released its Vision Pro, but that's not what investors should focus on. Costco's membership model helps drive growth in all economic conditions.", "url": "https://www.fool.com/investing/2023/06/08/my-top-3-dividend-stocks-to-buy-now/", "ticker": "COST", "event_date": "2023-05-25", "window_start": "2023-05-18", "window_end": "2023-06-08", "publishedDateET": "2023-06-08T05:37:00-04:00", "date_et": "2023-06-08"}
