[
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-08 00:45:00",
    "publisher": "Seeking Alpha",
    "title": "Dividend Hikes Offer Optimism Amid Tariff Turmoil",
    "image": "https://images.financialmodelingprep.com/news/dividend-hikes-offer-optimism-amid-tariff-turmoil-20250508.jpg",
    "site": "seekingalpha.com",
    "text": "Stocks have rebounded sharply off their early-April lows, but macro risks persist. Dividend stocks have largely outperformed so far this year. We profile a pair of blue chips that recently announced dividend hikes, which has turned out to be a broader Q2 theme.",
    "url": "https://seekingalpha.com/article/4783419-dividend-hikes-offer-optimism-amid-tariff-turmoil",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-08T00:45:00-04:00",
    "date_et": "2025-05-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-08 08:50:00",
    "publisher": "Business Wire",
    "title": "Walmart and Alquist Complete 3D Concrete Printed Expansion Of Alabama Supercenter",
    "image": "https://images.financialmodelingprep.com/news/walmart-and-alquist-complete-3d-concrete-printed-expansion-of-20250508.jpg",
    "site": "businesswire.com",
    "text": "OWENS CROSS ROADS, Ala.--(BUSINESS WIRE)--Alquist 3D prints a Walmart expansion in 75 hours, reducing construction time by 50% and creating 3x stronger walls.",
    "url": "https://www.businesswire.com/news/home/20250507123352/en/Walmart-and-Alquist-Complete-3D-Concrete-Printed-Expansion-Of-Alabama-Supercenter/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-08T08:50:00-04:00",
    "date_et": "2025-05-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-08 10:06:00",
    "publisher": "Fool - Investing News",
    "title": "Upstart Aced Earnings but Still Got Crushed. Time to Buy the Dip?",
    "image": "https://images.financialmodelingprep.com/news/upstart-aced-earnings-but-still-got-crushed-time-to-20250508.jpg",
    "site": "https://www.fool.com",
    "text": "Investors came in to Upstart's (UPST 1.79%) first-quarter earnings report hoping the company would maintain its momentum from the end of last year. Its growth has accelerated thanks to a new artificial intelligence (AI) model, Model 18 or M18, that has significantly improved its conversion rate thanks to an even broader prediction set that includes approximately 1 million predictions per applicant, or six times its prior model. With those tailwinds behind it, Upstart's results in Q1 did not disappoint. Revenue jumped 67% to $213.4 million, which topped estimates at $201.3 million. Those results included 34% growth in revenue from fees to $185.5 million, and Upstart benefited from a decline in fair value adjustments on its loans, indicating better credit performance. Underlying growth in its business was especially impressive as loan originations rose 102% to 240,706 loans, and total originations jumped 89% to more than $2.1 billion. The conversion rate continued to improve, rising from 14% to 19.1%, all signs that adoption is growing rapidly. Its metrics on the bottom line also improved. Adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) improved from a loss of $20.3 million to a profit of $42.6 million. It nearly reported a generally accepted accounting principles (GAAP) profit, finishing the quarter with a loss of $2.4 million, up from a loss of $64.6 million in the quarter a year ago. It reported an adjusted per-share profit of $0.30, ahead of the consensus at $0.17, and up from an adjusted per-share loss of $0.31 in the quarter a year ago. Despite the strong Q1 earnings report, Upstart essentially reiterated its full-year guidance untouched as it guided to revenue of $225 million for Q2, below the consensus at $226.3 million. Wall Street tends to see a beat without a raise as a sign that the current momentum won't last, and investors sometimes punish growth stocks for that pattern. As a result, the stock was down 16% in after-hours trading on Tuesday. While management did acknowledge the uncertainty in the economy, there wasn't anything in the guidance to indicate weakness. Meanwhile, a number of indicators in the business showed it continuing to strengthen. Upstart has diversified its business away from unsecured consumer loans in recent years as auto loans grew by five times to $61 million in the quarter and up 42% from Q4. Home loan origination jumped six times to $41 million, and management noted on the earnings call that its lending partners greatly prefer secured loans to unsecured loans, which bodes well for continued growth in the business. Prior to the earnings release, the company announced a one-year strategic partnership with OnePay, a fintech majority owned by Walmart. Upstart said the partnership would help it market lending product to Walmart's customer base, a massive opportunity for the company. It also plans to offer co-branded products without OnePay, though it said it didn't expect the partnership to have a material impact on financial results this year. Additionally, Upstart announced a forward-flow commitment from Fortress Investment Group, which agreed to purchase up to $1.2 billion in loans originated on Upstart, which will further diversify the company's base of lending partners and help ensure adequate funding for its loans. If the after-hours sell-off holds, Upstart now trades at a forward price-to-earnings (P/E) ratio of just 31 based on adjusted earnings, and that number is likely to fall as analysts up their forecasts following the strong quarter. Meanwhile, Upstart's revenue growth and the tailwinds in the large auto and home loan markets show it still has a significant growth runway in front of it. Upstart's own proprietary data even shows the macroenvironment improving modestly, and the business is less at risk of turmoil in the credit market than it was in 2022 when interest rates surged, freezing borrower demand. With interest rates already high and Upstart's business now resilient, the company seems to be in good shape no matter what happens on the macrofront. A recession could even be a positive for the company as it could lower interest rates. Overall, Upstart's business is getting stronger, its technology is improving, and the valuation looks attractive. The company also has scheduled an \"AI day\" when it will present technology updates and discuss its business model and strategy.",
    "url": "https://www.fool.com/investing/2025/05/08/upstart-aced-earnings-but-still-got-crushed-time-t/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-08T10:06:00-04:00",
    "date_et": "2025-05-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-08 11:00:00",
    "publisher": "Seeking Alpha",
    "title": "63 Top Dividend Growth Stocks For May 2025",
    "image": "https://images.financialmodelingprep.com/news/63-top-dividend-growth-stocks-for-may-2025-20250508.jpg",
    "site": "seekingalpha.com",
    "text": "I present 63 high-quality dividend growth stocks for investment for May 2025, categorized by yield: High (4%+), Medium (2.5-3.9%), and Low (",
    "url": "https://seekingalpha.com/article/4783196-63-top-dividend-growth-stocks-for-may-2025",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-08T11:00:00-04:00",
    "date_et": "2025-05-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-08 11:05:44",
    "publisher": "Zacks Investment Research",
    "title": "Analysts Estimate Walmart (WMT) to Report a Decline in Earnings: What to Look Out for",
    "image": "https://images.financialmodelingprep.com/news/analysts-estimate-walmart-wmt-to-report-a-decline-in-20250508.jpg",
    "site": "zacks.com",
    "text": "Walmart (WMT) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.",
    "url": "https://www.zacks.com/stock/news/2465264/analysts-estimate-walmart-wmt-to-report-a-decline-in-earnings-what-to-look-out-for?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_9-2465264",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-08T11:05:44-04:00",
    "date_et": "2025-05-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 01:52:43",
    "publisher": "Reuters",
    "title": "Walmart calls, but India's garment worker woes blunt tariff edge",
    "image": "https://images.financialmodelingprep.com/news/walmart-calls-but-indias-garment-worker-woes-blunt-tariff-20250509.jpg",
    "site": "reuters.com",
    "text": "In a garment hub in south India, R.K. Sivasubramaniam is fielding requests from Walmart and Costco who want to sidestep higher U.S. tariffs faced by rival Asian suppliers, Bangladesh and China.",
    "url": "https://www.reuters.com/world/china/walmart-calls-indias-garment-worker-woes-blunt-tariff-edge-2025-05-09/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T01:52:43-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 07:00:54",
    "publisher": "Investors Business Daily",
    "title": "Price Hikes Ahead? Walmart And Alibaba Earnings Could Hint At Tariff Impact.",
    "image": "https://images.financialmodelingprep.com/news/price-hikes-ahead-walmart-and-alibaba-earnings-could-hint-20250509.jpg",
    "site": "youtube.com",
    "text": "IBD's Alexis Garcia and Ed Carson preview key upcoming earnings reports from Walmart, Alibaba and Sea Limited. Check out our daily newsletter!",
    "url": "https://www.youtube.com/watch?v=Y3bwRqF3H_8",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T07:00:54-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 10:15:42",
    "publisher": "Zacks Investment Research",
    "title": "2 Supermarket Stocks in Focus Amid Robust Industry Trends",
    "image": "https://images.financialmodelingprep.com/news/2-supermarket-stocks-in-focus-amid-robust-industry-trends-20250509.jpg",
    "site": "zacks.com",
    "text": "The Zacks Retail - Supermarkets industry is capitalizing on consistent consumer demand and embracing AI-driven omnichannel innovations, positioning WMT and KR for long-term growth.",
    "url": "https://www.zacks.com/commentary/2465874/2-supermarket-stocks-in-focus-amid-robust-industry-trends?cid=CS-STOCKNEWSAPI-FT-industry_outlook-2465874",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T10:15:42-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 15:32:05",
    "publisher": "247 Wallst",
    "title": "5 Dividend ETFs to Buy and Hold for a Lifetime of Passive Income",
    "image": "https://images.financialmodelingprep.com/news/5-dividend-etfs-to-buy-and-hold-for-a-20250509.jpg",
    "site": "https://247wallst.com",
    "text": "Dividend stock investing offers a reliable path to passive income and long-term wealth creation, making it a cornerstone for many portfolios. By owning shares in companies that pay regular dividends, investors gain consistent cash flow, often from stable, high-quality firms like Coca-Cola (NYSE:KO) or Johnson &amp; Johnson (NYSE:JNJ). Dividends provide a hedge against market volatility, as payouts persist even during downturns, and reinvesting them can compound returns significantly over time. Moreover, dividend-paying stocks historically outperform non-dividend peers, with lower volatility. 24/7 Wall St. Insights: Dividend stock investing has proven a reliable path for investors to gather immense wealth over time. Dividend ETFs bolster those results by investing in hundreds of dividend-paying stocks, offering instant diversification and minimizing single-stock risk. Sit back and let dividends do the heavy lifting for a simple, steady path to serious wealth creation over time. Grab a free copy of “2 Legendary High-Yield Dividend Stocks“ now. Dividend-paying exchange-traded funds (ETFs) enhance these benefits by pooling dozens or hundreds of such stocks, offering instant diversification, reduced single-stock risk, and low expense ratios. In 2025’s uncertain market, marked by tariffs and persistent inflation, dividend ETFs provide resilience and income stability. Pursuing this strategy ensures steady returns and growth, making it ideal for both novice and seasoned investors seeking financial security. Schwab U.S. Dividend Equity ETF (SCHD) Any discussion of dividend ETFs must begin with Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). It is a top-tier dividend ETF, tracking the Dow Jones U.S. Dividend 100 Index with around 100 high-quality stocks like Lockheed-Martin (NYSE:LMT) and Cisco Systems (NASDAQ:CSCO), each boasting more than 10 years of dividend growth. The ETF&#8217;s 3.7% yield and ultra-low 0.06% expense ratio make it cost-effective while limiting sector exposure to no more than 25% ensures diversification. SCHD’s 11.4% annualized return over a decade reflects its balance of income and growth. Because SCHD focuses on financially sound companies, the dividend ETF mitigates risks, offering investors stability. For those seeking high yield and reliability, SCHD stock is a must-own ETF for lifelong passive income. Vanguard High Dividend Yield ETF (VYM) The Vanguard High Dividend Yield ETF (NYSE:VYM) tracks the FTSE High Dividend Yield Index, holding 589 stocks like ExxonMobil (NYSE:XOM) and UnitedHealth Group (NYSE:UNH), with no stock exceeding 4% of the portfolio. VYM&#8217;s 2.7% yield and 0.06% expense ratio deliver strong value, while its 13.3% five-year annualized return highlights its consistency. VYM also offers broad diversification across sectors like energy and financials, reducing volatility, making it ideal for conservative investors. With tariff&#8217;s top-of-mind for investors these days, the ETF&#8217;s U.S.-focused holdings provide resilience against global disruptions. Its proven track record and low costs makes VYM a foundational ETF for steady dividend income and long-term wealth building. Vanguard Dividend Appreciation ETF (VIG) Vanguard Dividend Appreciation ETF (NYSEARCA:VIG) targets companies with over 10 years of dividend increases, such as Microsoft (NASDAQ:MSFT) and Apple (NASDAQ:AAPL), and holds 338 stocks in its portfolio. The ETF&#8217;s 1.8% yield is lower, but its focus on dividend growth drives an 11.2% annualized return over the past decade. VIG&#8217;s 0.05% expense ratio is also among the lowest, maximizing investor returns. The Vanguard dividend ETF’s tech- and consumer-heavy portfolio suits investors prioritizing capital appreciation alongside income. And for investors looking for exposure to stable, growing firms, VIG cushions against economic uncertainty. It&#8217;s another ETF sporting a blend of growth and income, making it a versatile choice for investors seeking a balance of dividends and upside potential. iShares Core Dividend Growth ETF (DGRO) The iShares Core Dividend Growth ETF (NYSEARCA:DGRO) tracks the Morningstar US Dividend Growth Index, holding over 400 stocks like Chevron (NYSE:CVX) and Procter &amp; Gamble (NYSE:PG), and emphasizes its consistent dividend growth. DGRO sports a 2.3% yield and 0.08% expense ratio, offering a balanced income stream and a 16.4% annualized return over five years. The ETF&#8217;s diversified sector exposure, including financials and healthcare, minimizes risk. In today&#8217;s volatile market, the ETF&#8217;s focus on resilient, dividend-growing companies counters the extreme swings the market is experiencing. DGRO’s low cost and steady performance make it an excellent choice for investors seeking dependable income with moderate growth in a challenging economic landscape. ProShares S&amp;P 500 Dividend Aristocrats ETF (NOBL) The last dividend ETF to consider is ProShares S&amp;P 500 Dividend Aristocrats ETF (NYSEARCA:NOBL), which tracks the S&amp;P 500 Dividend Aristocrats Index. It holds over 60 stocks, each with over 25 years of dividend increases, such as Walmart (NYSE:WMT) and C.H. Robinson Worldwide (NASDAQ:CHRW). With a 2.5% yield and 0.35% expense ratio, it reflects NOBL&#8217;s premium quality, which has generated 14.5% annualized returns over the last five years. The ETF&#8217;s equal-weighted approach also reduces concentration risk, while its focus on elite dividend payers ensures stability. NOBL’s defensive holdings, with a long history of thriving amid uncertainty, offer investors reliable payouts. For those prioritizing quality and consistency, NOBL’s proven resilience makes it a stellar long-term holding for passive income. The post 5 Dividend ETFs to Buy and Hold for a Lifetime of Passive Income appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/08/5-dividend-etfs-to-buy-and-hold-for-a-lifetime-of-passive-income/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T15:32:05-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 16:47:46",
    "publisher": "Seeking Alpha",
    "title": "Walmart Q1 Earnings Preview: All Eyes On The Health Of The U.S. Consumer",
    "image": "https://images.financialmodelingprep.com/news/walmart-q1-earnings-preview-all-eyes-on-the-health-20250509.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart Inc. is set to release Q1 earnings on May 15, with expectations of revenue growth but a slight decline in EPS. Despite a strong track record of beating estimates, the stock is priced-to-perfection, warranting a cautious approach. Key focus areas include management commentary on tariffs, inflation, and the U.S. consumer health, especially given recent economic uncertainties.",
    "url": "https://seekingalpha.com/article/4784612-walmart-q1-earnings-preview-all-eyes-on-the-health-of-the-us-consumer",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T16:47:46-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-09 20:25:32",
    "publisher": "Zacks Investment Research",
    "title": "Walmart & Retail Sector Earnings Loom: A Closer Look",
    "image": "https://images.financialmodelingprep.com/news/walmart-retail-sector-earnings-loom-a-closer-look-20250509.jpg",
    "site": "zacks.com",
    "text": "Walmart WMT shares have been standout performers this year, handily outperforming not just the broader market indexes and peers like Target TGT but also the likes of Amazon AMZN and most of the Magnificent 7 group members.",
    "url": "https://www.zacks.com/commentary/2466429/walmart-retail-sector-earnings-loom-a-closer-look?cid=CS-STOCKNEWSAPI-FT-earnings_preview-2466429",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-09T20:25:32-04:00",
    "date_et": "2025-05-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-11 02:11:28",
    "publisher": "Invezz",
    "title": "Top S&P 500 Index stocks to watch: Walmart, Applied Materials, Cisco",
    "image": "https://images.financialmodelingprep.com/news/top-sp-500-index-stocks-to-watch-walmart-applied-20250511.jpg",
    "site": "invezz.com",
    "text": "The S&P 500 Index has jumped in the past few weeks and pared back some of the losses it made earlier this year when Donald Trump unveiled his tariffs. After initially falling to a low of $4,840 in April, it has rebounded by 17% to the current $5,660, its highest level since April 2.",
    "url": "https://invezz.com/news/2025/05/11/top-sp-500-index-stocks-to-watch-walmart-applied-materials-cisco/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-11T02:11:28-04:00",
    "date_et": "2025-05-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-11 05:05:58",
    "publisher": "Investopedia",
    "title": "What To Expect in the Markets This Week",
    "image": "https://images.financialmodelingprep.com/news/what-to-expect-in-the-markets-this-week-20250511.jpg",
    "site": "investopedia.com",
    "text": "Inflation data, scheduled for Tuesday, may claim the spotlight early this week. But investors will also be evaluating the outcome of the weekend meetings between U.S. and Chinese trade officials after a quiet Friday session that left stocks down for the week.",
    "url": "https://www.investopedia.com/what-to-expect-in-the-markets-this-week-11731294",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-11T05:05:58-04:00",
    "date_et": "2025-05-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-11 14:00:00",
    "publisher": "Barrons",
    "title": "Fox, Walmart, Cisco, and More to Watch",
    "image": "https://images.financialmodelingprep.com/news/fox-walmart-cisco-and-more-to-watch-20250511.jpg",
    "site": "barrons.com",
    "text": "Simon Property, Sony, Alibaba, and Deere will also report earnings. Economic releases this week will include data on inflation, producer prices, and retail sales.",
    "url": "https://www.barrons.com/articles/inflation-walmart-cisco-stock-earnings-485e2524",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-11T14:00:00-04:00",
    "date_et": "2025-05-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-11 23:14:34",
    "publisher": "Seeking Alpha",
    "title": "Target And Walmart - Where To Spend Your Money",
    "image": "https://images.financialmodelingprep.com/news/target-and-walmart-where-to-spend-your-money-20250511.jpg",
    "site": "seekingalpha.com",
    "text": "You can buy a share in Walmart or Target today for $96. Target is great value today. Walmart's stability and growth are reflected in its higher P/E, but its valuation seems stretched, given similar earnings growth to Target. Both companies face risks from tariffs and potential recession, but Target's higher dividend yield and lower forward P/E make it more attractive.",
    "url": "https://seekingalpha.com/article/4785435-target-and-walmart-where-to-spend-your-money",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-11T23:14:34-04:00",
    "date_et": "2025-05-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 01:00:00",
    "publisher": "Barrons",
    "title": "Meta, Walmart, and Other Stocks This AI Trader Is Selling Amid the Market Uncertainty",
    "image": "https://images.financialmodelingprep.com/news/meta-walmart-and-other-stocks-this-ai-trader-is-20250512.jpg",
    "site": "barrons.com",
    "text": "Investors may have been agonizing over trades in recent months but this AI trader has a clear plan—for better or worse.",
    "url": "https://www.barrons.com/articles/meta-walmart-stocks-ai-trader-palantir-broadcom-c3359c83",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T01:00:00-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 04:12:00",
    "publisher": "The Motley Fool",
    "title": "3 Things I'll Be Watching in Walmart's Upcoming Earnings Report (and 2 I'll Ignore)",
    "image": "https://images.financialmodelingprep.com/news/3-things-ill-be-watching-in-walmarts-upcoming-earnings-20250512.jpg",
    "site": "fool.com",
    "text": "We may be well into earnings season, but we haven't heard from every noteworthy name just yet. Mega-retailer Walmart (WMT -0.58%) is slated to report its fiscal first-quarter numbers on Thursday morning, offering a glimpse into consumers' current psyches and buying power.",
    "url": "https://www.fool.com/investing/2025/05/12/things-ill-be-watching-walmart-upcoming-earnings/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T04:12:00-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 05:26:01",
    "publisher": "Investopedia",
    "title": "What Analysts Think of Walmart Stock Ahead of Earnings",
    "image": "https://images.financialmodelingprep.com/news/what-analysts-think-of-walmart-stock-ahead-of-earnings-20250512.jpg",
    "site": "investopedia.com",
    "text": "Walmart (WMT) is set to report results for the first quarter of its 2026 fiscal year early Thursday, with analysts bullish on the retail giant they see as a potential winner from continued tariff uncertainty.",
    "url": "https://www.investopedia.com/what-analysts-think-of-walmart-stock-ahead-of-earnings-11730181",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T05:26:01-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 08:26:05",
    "publisher": "Zacks Investment Research",
    "title": "How Should You Play Walmart Stock Ahead of Q1 Earnings Release?",
    "image": "https://images.financialmodelingprep.com/news/how-should-you-play-walmart-stock-ahead-of-q1-20250512.jpg",
    "site": "zacks.com",
    "text": "WMT's Q1 results are likely to reflect gains from diversified business amid earnings pressure from sales volatility, rising costs and economic uncertainty.",
    "url": "https://www.zacks.com/stock/news/2466577/how-should-you-play-walmart-stock-ahead-of-q1-earnings-release?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_preview-2466577",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T08:26:05-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 10:15:50",
    "publisher": "Zacks Investment Research",
    "title": "Curious about Walmart (WMT) Q1 Performance? Explore Wall Street Estimates for Key Metrics",
    "image": "https://images.financialmodelingprep.com/news/curious-about-walmart-wmt-q1-performance-explore-wall-street-20250512.jpg",
    "site": "zacks.com",
    "text": "Beyond analysts' top -and-bottom-line estimates for Walmart (WMT), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended April 2025.",
    "url": "https://www.zacks.com/stock/news/2466677/curious-about-walmart-wmt-q1-performance-explore-wall-street-estimates-for-key-metrics?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm_preview-2466677",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T10:15:50-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 11:08:22",
    "publisher": "Investopedia",
    "title": "There's an 'Inconsistency in the Vibe' of the American Consumer These Days",
    "image": "https://images.financialmodelingprep.com/news/theres-an-inconsistency-in-the-vibe-of-the-american-consumer-20250512.jpg",
    "site": "https://www.investopedia.com",
    "text": "Close Key Takeaways Retail and credit card data shows Americans continue to spend, but a few aspects of their behavior have some analysts concerned about a potential slowdown.New retail numbers and an earnings report from Walmart slated to come out this week may offer clarity on the health of the consumer.Higher-income customers have been relying more on Walmart—and its delivery service—in recent months, executives have said. Americans haven’t stopped spending despite broad economic uncertainty. But a close look at recent data and trends has fed concerns about a slowdown. The unemployment rate is relatively low, and job creation is holding steady. Retail spending shot up 6.8% year-over-year in April, the National Retail Federation said, exclusive of car and gas purchases. But Americans are increasingly uneasy, several measures suggest. Consumer sentiment fell in April for a fourth straight month, according to the Michigan Consumer Sentiment Index. Quick-service restaurants and companies selling everything from lunch to laundry detergent say their customers seem squeezed. And while credit and debit card spending ticked up 1% last month, according to Bank of America, there was a pullback in big splurges like trips and hotels. Two releases set for Thursday will offer fresh data: Walmart (WMT) is slated to hand in its first-quarter numbers, and the government is scheduled to publish April retail data. Trade negotiations, notably with China, ahve contributed to the uncertainty: Widespread “reciprocal” tariffs are not slated to take effect for weeks, but the NRFthinks the threat of higher import taxes has spurred consumers to stock up on some items, juicing retail spending in April. “There’s a real inconsistency in the vibe,” said Max Levchin, CEO of buy now, pay later provider Affirm (AFRM), on CNBC Friday. “People are stressed out about the economy, yet they’re shopping. They’re buying, and they’re paying their bills.” Shoppers Look for Lower Sticker Prices Oppenheimer analysts on Wednesday said Walmart has historically performed well in recessionary periods. Still, they acknowledged the current outlook can be hard to read. “We have seen potentially mixed consumer data-points lately with still healthy consumer spending trends overall,” they wrote. “But at the same time, [there has been] more downbeat [consumer packaged goods company] commentary.” Consumers have “a lot to process” and a reason to “pause,” Procter & Gamble (PG) CFO Andre Schulten said last month. The parent company of brands like Tide and Febreze recently downgraded its outlook for the full fiscal year. So did another consumer goods giant, Church & Dwight (CHD). Americans are watching their tabs at Applebee’s and IHOP and cutting back at Wendy’s (WEN) and McDonald’s (MCD), executives recently said. At grocery and convenience stores, some shoppers are focusing more on sticker prices than the cost-per-serving, which has prompted Pepsi (PEP) and Mondelēz International (MDLZ) to offer smaller packages at lower price points, executives said last month. “While two, three years ago consumers would easily pay above $4 for a pack of biscuits, we’re now seeing that we need to be below $4, and ideally below $3,” said Dirk Van de Put, CEO of Mondelēz, which counts Ritz Crackers and Oreo cookies as parts of its biscuit category. Demand hasn’t waned for international airfare or luxury clothing, companies said. Households with six-figure incomes have been flocking to Walmart’s delivery service in recent months. “We’re seeing higher engagement across income cohorts, with upper-income households continuing to account for the majority of share gains,” CFO John David Rainey said this winter. Do you have a news tip for Investopedia reporters? Please email us at tips@investopedia.com",
    "url": "https://www.investopedia.com/analysts-look-to-walmart-for-clues-amid-inconsistency-in-consumer-behavior-11731887",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T11:08:22-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 11:18:04",
    "publisher": "24/7 Wall Street",
    "title": "Earnings Calendar: 7 Market-Moving Stocks Every Investor Should Watch Closely This Week",
    "image": "https://images.financialmodelingprep.com/news/earnings-calendar-7-marketmoving-stocks-every-investor-should-watch-closely-20250512.jpg",
    "site": "247wallst.com",
    "text": "The bulk of earnings season is over, but there are still plenty of stocks to issue their quarterly results.",
    "url": "https://247wallst.com/investing/2025/05/12/earnings-calendar-7-market-moving-stocks-every-investor-should-watch-closely-this-week/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T11:18:04-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 11:31:18",
    "publisher": "Fool - Investing News",
    "title": "Amex Platinum vs. Chase Sapphire Reserve: Which Card Wins for Summer Travel?",
    "image": "https://images.financialmodelingprep.com/news/amex-platinum-vs-chase-sapphire-reserve-which-card-wins-20250512.png",
    "site": "https://www.fool.com",
    "text": "KEY POINTS The Amex Platinum Card offers luxury perks like Centurion Lounge access and elite hotel status.The Chase Sapphire Reserve maximizes travel and dining purchases, with 3x to 10x total points in those categories.Both cards offer huge welcome bonuses for meeting minimum spend requirements. I'll never forget my first airport lounge experience. I was 26, on a work trip to Austin, when my boss waved me into the Delta Sky Club as his guest. I tried to act cool -- like I belonged there -- but inside, I was buzzing like a kid in a candy store. Free drinks, gourmet snacks, fancy bathrooms, lightning-fast wifi…it felt like a whole different world.After that trip I learned that getting into airport lounges isn't actually that hard. Holding the right credit card can get you access to more than 1,400 lounges worldwide -- no boss required.Today, two of the best cards for VIP travel perks (including lounge access) are The Platinum Card® from American Express (see rates and fees) and the Chase Sapphire Reserve® (see rates and fees). We'll break down the differences so you can determine which is best for you this year. (function(){function c(){var b=a.contentDocument||a.contentWindow.document;if(b){var d=b.createElement('script');d.innerHTML=\"window.__CF$cv$params={r:'93eaf654eba1f5f7',t:'MTc0NzA2Mzg3Ny4wMDAwMDA='};var a=document.createElement('script');a.nonce='';a.src='/cdn-cgi/challenge-platform/scripts/jsd/main.js';document.getElementsByTagName('head')[0].appendChild(a);\";b.getElementsByTagName('head')[0].appendChild(d)}}if(document.body){var a=document.createElement('iframe');a.height=1;a.width=1;a.style.position='absolute';a.style.top=0;a.style.left=0;a.style.border='none';a.style.visibility='hidden';document.body.appendChild(a);if('loading'!==document.readyState)c();else if(window.addEventListener)document.addEventListener('DOMContentLoaded',c);else{var e=document.onreadystatechange||function(){};document.onreadystatechange=function(b){e(b);'loading'!==document.readyState&&(document.onreadystatechange=e,c())}}}})();Comparison at a glanceHere's a quick side-by-side comparison of these two awesome travel cards: Amex Platinum Card Chase Sapphire Reserve Welcome offer Earn 80,000 Membership Rewards® Points after you spend $8,000 on eligible purchases on your new Card in your first 6 months of Card Membership. Earn 60,000 bonus points after you spend $5,000 on purchases in the first 3 months from account opening. Annual fee $695 $550 Standout perks -$200 in hotel credits-$200 in airline fee credits-$199 CLEAR® Plus credit-Hotel elite status with Hilton and Marriott-Walmart+ credit up to $12.95 each month-$200 in Uber cash ($15/month and $35 in December)-Terms apply; enrollment may be required -$300 annual travel credit-Global Entry or TSA PreCheck® or NEXUS Fee Credit-DashPass by DoorDash for 12 months (worth $120) when you activate by Dec. 31, 2027 Lounge access Centurion Lounges, Escape Lounges, Priority Pass lounges (enrollment required), Delta Sky Clubs (when flying Delta), Lufthansa Lounges, Plaza Premium Lounge Chase Sapphire Lounge by The Club, Priority Pass Select (enrollment required) Earning points -5X points on flights booked directly with airlines or with American Express Travel, up to $500,000 on these purchases per calendar year-5X points on prepaid hotels booked with American Express Travel-1X points on other purchases -10x total points on hotels and car rentals through Chase Travel℠ immediately after the first $300 is spent on travel purchases annually-5x total points on air travel through Chase Travel℠ immediately after the first $300 is spent on travel purchases annually-3x points on other travel and dining-1x points on all other purchases-Points are worth 50% more when redeemed for travel through Chase Both are killer cards, built for heavy travelers.While the Amex Platinum Card does have a slightly higher annual fee ($695, see rates and fees), it includes a much wider range of annual credits, as well as access to more airport lounges.I will say, though, that I'm a huge fan of Chase Ultimate Rewards points. In my eyes, the Chase Sapphire Reserve card has higher earning opportunities for everyday spending. With its slightly lower fee of $550, it may be a better fit for those who like to stretch their travel budget a bit further.What I love about the Amex Platinum CardIf you're looking for the full VIP experience, The Platinum Card® from American Express is tough to beat. The access to Centurion Lounges alone make those long layovers actually enjoyable. Terms apply. I've eaten full meals, drunk plenty of mimosas, and even showered once before a long-haul flight -- all thanks to the airport lounge perks included with my card membership.Hotel elite status is an underrated perk. Just by having the card, you can get room upgrades, early check-ins, and late checkouts at Hilton and Marriott properties. Terms apply; enrollment may be required.One low-key perk that I love is the $100 Saks Fifth Avenue credit. Terms apply. I use this to buy my wife fancy gifts each year (one for her birthday in July and one in December for Christmas!).If you're a frequent traveler who loves a first-class vibe, consider applying for The Platinum Card® from American Express here (see rates and fees).What I love about Chase Sapphire ReserveIf you want premium perks and serious bang for your buck, the Chase Sapphire Reserve® delivers the goods. First off, the $300 annual travel credit is almost effortless to use. (Plus, it makes up for over half the annual fee.)Point redemptions are where Chase Sapphire Reserve® truly crushes it. Your points are worth 50% more when you book through Chase Travel. That's up to $900 in travel value from a welcome offer of 60,000 bonus points (after spending $5,000 in the first 3 months).And you get 10x total points on hotels and car rentals through Chase Travel℠ immediately after the first $300 is spent on travel purchases annually, 5x total points on air travel through Chase Travel℠ immediately after the first $300 is spent on travel purchases annually, and 3x points on other travel and dining. It's easy to see how everyday spending can stack up points really fast.If you want a practical card without giving up great travel perks, apply for the Chase Sapphire Reserve® here (see rates and fees).Final verdict: Which card should you pick?If you're chasing luxury experiences -- and you'll actually use lounge access, hotel upgrades, and airline credits -- the Amex Platinum Card is your ticket to a VIP summer.If you want to maximize value per dollar and score easy rewards on everything from Uber rides to steak dinners, the Chase Sapphire Reserve® probably fits your style better.",
    "url": "https://www.fool.com/money/credit-cards/articles/amex-platinum-vs-chase-sapphire-reserve-which-card-wins-for-summer-travel/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T11:31:18-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 13:07:26",
    "publisher": "Proactive Investors",
    "title": "Walmart poised to deliver solid Q1 report as analysts see continued share gains and improving profitability ahead",
    "image": "https://images.financialmodelingprep.com/news/walmart-poised-to-deliver-solid-q1-report-as-analysts-20250512.jpg",
    "site": "proactiveinvestors.com",
    "text": "Walmart Inc (NYSE:WMT, ETR:WMT) will report its fiscal first-quarter 2025 financial results on Thursday, May 15, with Bank of America analysts repeating their ‘Buy' rating ahead of the release, citing continued market share gains and improving long-term profitability. They also maintained their price target of $120, representing upside from Walmart's share price on Monday afternoon of about $96.",
    "url": "https://www.proactiveinvestors.com/companies/news/1071067",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T13:07:26-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 13:45:00",
    "publisher": "Seeking Alpha",
    "title": "China Trade Progress: Market Booms On News, Who Will Benefit?",
    "image": "https://images.financialmodelingprep.com/news/china-trade-progress-market-booms-on-news-who-will-benefit-20250512.jpg",
    "site": "seekingalpha.com",
    "text": "The U.S. and China agreed to reduce tariffs on each other's goods for 90 days, boosting global equity markets and easing trade tensions. U.S. tariffs on Chinese imports will drop from 145% to 30%, while China will cut tariffs on U.S. goods from 125% to 10%. The tariff reductions are expected to lower input costs, alleviate supply chain pressures, and enhance cross-border commerce in key industries.",
    "url": "https://seekingalpha.com/article/4785658-china-trade-progress-market-booms-on-news-who-will-benefit",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T13:45:00-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-12 15:42:41",
    "publisher": "Investopedia",
    "title": "What a Big Walmart Bull Expects From the Retail Giant's Earnings",
    "image": "https://images.financialmodelingprep.com/news/what-a-big-walmart-bull-expects-from-the-retail-20250512.jpg",
    "site": "investopedia.com",
    "text": "Walmart's (WMT) same-store sales growth may be more muted than expected when the retail giant reports quarterly results in a few days, Bank of America said, but its e-commerce growth will likely outpace projections.",
    "url": "https://www.investopedia.com/what-a-big-walmart-bull-expects-from-the-retail-giant-s-earnings-11733233",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-12T15:42:41-04:00",
    "date_et": "2025-05-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-13 07:00:00",
    "publisher": "Seeking Alpha",
    "title": "Why J Mintzmyer Is Short Walmart And Long 3 Shipping Stocks",
    "image": "https://images.financialmodelingprep.com/news/why-j-mintzmyer-is-short-walmart-and-long-3-20250513.jpg",
    "site": "seekingalpha.com",
    "text": "Shipping expert J Mintzmyer discusses the current volatility in the shipping sector, and the impact of geopolitical events and tariffs on container ships and tankers. Tanker stocks are particularly attractive due to strong rates and geopolitical factors, while container ship stocks face significant challenges from tariffs and reduced trade volumes.",
    "url": "https://seekingalpha.com/article/4785807-why-j-mintzmyer-is-shorting-walmart-and-long-3-shipping-stocks",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-13T07:00:00-04:00",
    "date_et": "2025-05-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-13 07:05:00",
    "publisher": "Seeking Alpha",
    "title": "My Biggest Mistakes As A Dividend Investor",
    "image": "https://images.financialmodelingprep.com/news/my-biggest-mistakes-as-a-dividend-investor-20250513.jpg",
    "site": "seekingalpha.com",
    "text": "Dividend investing has been a very successful journey for me. However, I have made numerous very painful mistakes. I share my biggest mistakes here and the lessons I have learned from them that have made me a better investor.",
    "url": "https://seekingalpha.com/article/4785903-biggest-mistakes-as-dividend-investor",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-13T07:05:00-04:00",
    "date_et": "2025-05-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-13 12:15:37",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Earnings Loom: Are WMT Shares Attractive?",
    "image": "https://images.financialmodelingprep.com/news/walmart-earnings-loom-are-wmt-shares-attractive-20250513.jpg",
    "site": "zacks.com",
    "text": "Earnings season continues its rapid pace this week, with this week's docket primarily dominated by retailers. We've already heard from most S&P 500 companies, with results overall positive amid lingering uncertainty concerning upcoming periods.",
    "url": "https://www.zacks.com/commentary/2467188/walmart-earnings-loom-are-wmt-shares-attractive?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2467188",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-13T12:15:37-04:00",
    "date_et": "2025-05-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-13 15:27:00",
    "publisher": "PRNewsWire",
    "title": "GABBY'S DOLLHOUSE LIVE! PRESENTED BY WALMART KICKS OFF 80+ SHOW NORTH AMERICAN TOUR IN LONG BEACH, CA",
    "image": "https://images.financialmodelingprep.com/news/gabbys-dollhouse-live-presented-by-walmart-kicks-off-80-20250513.jpg",
    "site": "prnewswire.com",
    "text": "LOS ANGELES , May 13, 2025 /PRNewswire/ -- DreamWorks Animation, Universal Destinations and Experiences, TEG Life Like Touring, and Terrapin Station Entertainment are delighted to announce the North American premiere season of GABBY'S DOLLHOUSE LIVE! PRESENTED BY WALMART, launching in Long Beach, CA on September 19, 2025.",
    "url": "https://www.prnewswire.com/news-releases/gabbys-dollhouse-live-presented-by-walmart-kicks-off-80-show-north-american-tour-in-long-beach-ca-302454410.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-13T15:27:00-04:00",
    "date_et": "2025-05-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-13 20:59:38",
    "publisher": "PYMNTS",
    "title": "CFPB Drops Lawsuit Against Walmart and FinTech Company Branch",
    "image": "https://images.financialmodelingprep.com/news/cfpb-drops-lawsuit-against-walmart-and-fintech-company-branch-20250513.jpg",
    "site": "pymnts.com",
    "text": "The Consumer Financial Protection Bureau (CFPB) reportedly dropped a lawsuit against Walmart and Branch that it filed in December. The agency filed a notice of dismissal Tuesday (May 13), Bloomberg reported Tuesday.",
    "url": "https://www.pymnts.com/walmart/2025/cfpb-drops-lawsuit-against-walmart-and-fintech-company-branch/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-13T20:59:38-04:00",
    "date_et": "2025-05-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 10:00:00",
    "publisher": "Business Wire",
    "title": "On Behalf of Agri-Tech Startup Zest Labs, Inc., Bartko Pavia's Patrick M. Ryan Obtains $222 Million Jury Verdict Against Walmart",
    "image": "https://images.financialmodelingprep.com/news/on-behalf-of-agritech-startup-zest-labs-inc-bartko-20250514.jpg",
    "site": "businesswire.com",
    "text": "LITTLE ROCK, Ark.--(BUSINESS WIRE)-- #BartkoPavia--Bartko Pavia LLP trial team, led by Patrick M. Ryan, achieves a landmark victory for Zest Labs, Inc. against Walmart.",
    "url": "https://www.businesswire.com/news/home/20250514194280/en/On-Behalf-of-Agri-Tech-Startup-Zest-Labs-Inc.-Bartko-Pavia%E2%80%99s-Patrick-M.-Ryan-Obtains-222-Million-Jury-Verdict-Against-Walmart/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T10:00:00-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 11:00:41",
    "publisher": "Schwab Network",
    "title": "\"Feeling Relief:\" Markets Hold Recovery, WMT \"Bellwether,\" UBER Bull Case",
    "image": "https://images.financialmodelingprep.com/news/feeling-relief-markets-hold-recovery-wmt-bellwether-uber-bull-20250514.jpg",
    "site": "youtube.com",
    "text": "Jay Woods didn't expect this sharp of a V-shaped recovery following April's massive selling action. He notes stocks are overbought but sees this recovery holding in the mid to long-term.",
    "url": "https://www.youtube.com/watch?v=OEUdjZtQfSA",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T11:00:41-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 11:36:20",
    "publisher": "Schwab Network",
    "title": "Sundaram: Expect Strong WMT Earnings, Will Beat FY2025 Outlook",
    "image": "https://images.financialmodelingprep.com/news/sundaram-expect-strong-wmt-earnings-will-beat-fy2025-outlook-20250514.jpg",
    "site": "youtube.com",
    "text": "Arun Sundaram believes Walmart (WMT) will post strong numbers in its earnings Thursday morning, backed by strength from March retail sales. He notes caution heading into earnings, as last quarter's report was the first domino toppling into a steep tariff-induced sell-off across Wall Street.",
    "url": "https://www.youtube.com/watch?v=iB-YWBXZGnw",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T11:36:20-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 13:22:15",
    "publisher": "Reuters",
    "title": "How Walmart handles Trump's tariffs could offer clues on retail health",
    "image": "https://images.financialmodelingprep.com/news/how-walmart-handles-trumps-tariffs-could-offer-clues-on-20250514.jpg",
    "site": "reuters.com",
    "text": "Results from Walmart , a bellwether for the U.S. retail industry, will offer proof on Thursday why the Arkansas behemoth is best placed to navigate the uncertainty from the Trump administration's tariffs.",
    "url": "https://www.reuters.com/business/retail-consumer/how-walmart-handles-trumps-tariffs-could-offer-clues-retail-health-2025-05-14/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T13:22:15-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 13:45:02",
    "publisher": "Schwab Network",
    "title": "Example Earnings Trades: WMT Call Calendar, DE Call Vertical",
    "image": "https://images.financialmodelingprep.com/news/example-earnings-trades-wmt-call-calendar-de-call-vertical-20250514.jpg",
    "site": "youtube.com",
    "text": "Ahead of Thursday's earnings reports, Kevin Hincks demonstrates example options trades in Walmart (WMT) and Deere & Co. (DE). For Walmart, Kevin composes a bullish long call calendar example using the May 23 and May 16 strike dates.",
    "url": "https://www.youtube.com/watch?v=WZ8kQ8Z-u1M",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T13:45:02-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 13:48:22",
    "publisher": "Seeking Alpha",
    "title": "Walmart: How Tariff Panic Created A Buy Window Ahead Of Earnings",
    "image": "https://images.financialmodelingprep.com/news/walmart-how-tariff-panic-created-a-buy-window-ahead-20250514.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart's e-commerce momentum and strategic choices position it to exceed conservative revenue guidance, with a projected 28% upside if earnings beat expectations. The market may have overestimated tariff impact; actual tariffs implemented in Q1 are unlikely to significantly affect Walmart's financials. Walmart's investments in supply chain automation and Vizio's ad business enhance productivity and profitability, supporting a 6% YoY revenue increase.",
    "url": "https://seekingalpha.com/article/4786688-wmt-how-tariff-panic-created-a-buy-window-ahead-of-earnings",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T13:48:22-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 16:30:00",
    "publisher": "Barrons",
    "title": "Walmart Is Retail's Bellwether for Tariffs. What Earnings Will Show.",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-retails-bellwether-for-tariffs-what-earnings-will-20250514.jpg",
    "site": "barrons.com",
    "text": "The discount chain's quarterly results will lay out what's happening with consumer demand, too. Wall Street expects a steady performance.",
    "url": "https://www.barrons.com/articles/walmart-earnings-stock-price-a0c89352",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T16:30:00-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-14 18:33:28",
    "publisher": "CNBC Television",
    "title": "Pull forward could boost Walmart's Q1 earnings report, says Telsey's Joe Feldman",
    "image": "https://images.financialmodelingprep.com/news/pull-forward-could-boost-walmarts-q1-earnings-report-says-telseys-20250514.jpg",
    "site": "youtube.com",
    "text": "Joe Feldman, Telsey Advisory Group, joins 'Fast Money' to talk what to expect from Walmart's quarterly results.",
    "url": "https://www.youtube.com/watch?v=lMz4haMiISg",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-14T18:33:28-04:00",
    "date_et": "2025-05-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 00:01:01",
    "publisher": "CNBC",
    "title": "Walmart will report earnings before the bell. Here's what to expect",
    "image": "https://images.financialmodelingprep.com/news/walmart-will-report-earnings-before-the-bell-heres-what-20250515.jpg",
    "site": "cnbc.com",
    "text": "Walmart will report fiscal first-quarter earnings before the bell on Thursday. Investors and economists are trying to gauge the strength of the U.S. consumer and the impact of higher tariffs on the retail industry.",
    "url": "https://www.cnbc.com/2025/05/15/walmart-wmt-q1-2026-earnings.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T00:01:01-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 05:01:09",
    "publisher": "FXEmpire",
    "title": "The Day Ahead: Walmart Earnings, PPI, Retail Sales and Powell's Speech Drive Markets Today",
    "image": "https://images.financialmodelingprep.com/news/the-day-ahead-walmart-earnings-ppi-retail-sales-and-powells-20250515.jpg",
    "site": "fxempire.com",
    "text": "Retail sales, producer inflation data, Walmart earnings, and Powell's remarks steer U.S. markets today amid fading momentum in equity futures.",
    "url": "https://www.fxempire.com/forecasts/article/the-day-ahead-walmart-earnings-ppi-retail-sales-and-powells-speech-drive-markets-today-1519209",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T05:01:09-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:00:00",
    "publisher": "WSJ",
    "title": "Walmart Is Preparing to Welcome Its Next Customer: The AI Shopping Agent",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-preparing-to-welcome-its-next-customer-the-20250515.jpg",
    "site": "wsj.com",
    "text": "As consumers begin to use AI agents to do their shopping, retailers are trying to figure out how to market to bots in addition to humans.",
    "url": "https://www.wsj.com/articles/walmart-is-preparing-to-welcome-its-next-customer-the-ai-shopping-agent-6659ef18",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:00:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:01:00",
    "publisher": "WSJ",
    "title": "Walmart Weathers Trade War Storm With Strong Sales",
    "image": "https://images.financialmodelingprep.com/news/walmart-weathers-trade-war-storm-with-strong-sales-20250515.jpg",
    "site": "wsj.com",
    "text": "The retail giant said its sales grew stronger during a quarter when President Trump enacted steep tariffs against the country's biggest trading partners.",
    "url": "https://www.wsj.com/business/retail/walmart-weathers-trade-war-storm-with-strong-sales-b978bcf5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:01:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:02:00",
    "publisher": "Business Wire",
    "title": "Walmart reports revenue of 2.5%, up 4.0% in constant currency (cc) with operating income growing of 4.3%, or 3.0% adjusted (cc)",
    "image": "https://images.financialmodelingprep.com/news/walmart-reports-revenue-of-25-up-40-in-constant-20250515.jpg",
    "site": "businesswire.com",
    "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)--Walmart Inc. (NYSE: WMT): First Quarter Highlights: Revenue of $165.6 billion, up 2.5%, or 4.0% (cc) ; includes ~100 bps headwind from lapping leap day Global eCommerce sales grew 22%, led by store-fulfilled pickup & delivery and marketplace Global advertising business grew 50%, including VIZIO; Walmart Connect in the U.S. up 31% Membership and other income up 3.7%, including 14.8% growth in membership income Gross margin rate up 12 bps, led by Walmart U.",
    "url": "https://www.businesswire.com/news/home/20250514537784/en/Walmart-reports-revenue-of-2.5-up-4.0-in-constant-currency-cc-with-operating-income-growing-of-4.3-or-3.0-adjusted-cc/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:02:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:08:08",
    "publisher": "Reuters",
    "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-of-higher-prices-withholds-secondquarter-profit-guidance-20250515.jpg",
    "site": "reuters.com",
    "text": "Walmart U.S. comparable sales surpassed expectations in the first quarter, but the retailing giant known for affordable goods said the high costs of tariffs may mean it cannot keep from passing on higher prices to shoppers in the near-future.",
    "url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:08:08-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:11:00",
    "publisher": "Market Watch",
    "title": "Walmart's stock jumps as outlook maintained, streak of earnings beats extended",
    "image": "https://images.financialmodelingprep.com/news/walmarts-stock-jumps-as-outlook-maintained-streak-of-earnings-20250515.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Walmart Inc. surged 2.9% in premarket trading Thursday, after the discount retail giant's fiscal first-quarter results beat on every key metric, and the full-year outlook was maintained in the face of economic and tariff-related uncertainties.",
    "url": "https://www.marketwatch.com/story/walmarts-stock-jumps-as-outlook-maintained-streak-of-earnings-beats-extended-4b2d557f",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:11:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:17:43",
    "publisher": "Business Insider",
    "title": "Walmart gets a lift from Trump's trade chaos — but warns price rises are coming",
    "image": "https://images.financialmodelingprep.com/news/walmart-gets-a-lift-from-trumps-trade-chaos-but-20250515.jpg",
    "site": "businessinsider.com",
    "text": "Walmart reported first-quarter revenues of $168 billion, up 4% from last year. US sales were boosted by shoppers rushing to get ahead of tariff-related price hikes.",
    "url": "https://www.businessinsider.com/walmart-stock-q1-earnings-release-report-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:17:43-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:17:51",
    "publisher": "FXEmpire",
    "title": "Walmart Beats Q1, Gains 2.5% Premarket on E-Commerce Strength and Solid U.S. Sales",
    "image": "https://images.financialmodelingprep.com/news/walmart-beats-q1-gains-25-premarket-on-ecommerce-strength-20250515.jpg",
    "site": "fxempire.com",
    "text": "Walmart Q1 beats EPS estimates with strong U.S. sales and e-commerce profits. Shares rise 2.5% premarket as guidance holds steady.",
    "url": "https://www.fxempire.com/news/article/walmart-beats-q1-gains-2-5-premarket-on-e-commerce-strength-and-solid-u-s-sales-1519267",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:17:51-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:21:06",
    "publisher": "Investopedia",
    "title": "Walmart Tops Q1 Profit Estimates, Affirms Full-Year Forecasts",
    "image": "https://images.financialmodelingprep.com/news/walmart-tops-q1-profit-estimates-affirms-fullyear-forecasts-20250515.jpg",
    "site": "investopedia.com",
    "text": "Walmart (WMT) shares rose in premarket trading Thursday after the retail giant's fiscal 2026 first-quarter profit came in better than analysts had expected and it backed its full-year projections.",
    "url": "https://www.investopedia.com/walmart-q1-fy2026-earnings-11732833",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:21:06-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:33:43",
    "publisher": "CNBC Television",
    "title": "Walmart CFO says price hikes could start later this month, as retailer beats on earnings",
    "image": "https://images.financialmodelingprep.com/news/walmart-cfo-says-price-hikes-could-start-later-this-20250515.jpg",
    "site": "youtube.com",
    "text": "CNBC's Courtney Reagan joins 'Squawk Box' to report on the company's quarterly earnings results.",
    "url": "https://www.youtube.com/watch?v=dtrw1yU-fNk",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:33:43-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 07:41:06",
    "publisher": "Fox Business",
    "title": "Walmart says some price increases are possible in tariff 'uncertainty,' e-commerce sales grow",
    "image": "https://images.financialmodelingprep.com/news/walmart-says-some-price-increases-are-possible-in-tariff-20250515.jpg",
    "site": "foxbusiness.com",
    "text": "Walmart warns of potential price hikes due to tariffs, despite strong Q1 results and eCommerce growth. The retailer remains optimistic about future sales.",
    "url": "https://www.foxbusiness.com/markets/walmart-says-some-price-increases-possible-tariff-uncertainty-e-commerce-sales-grow",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T07:41:06-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 08:15:00",
    "publisher": "WSJ",
    "title": "Walmart Raises Prices Because of Tariffs",
    "image": "https://images.financialmodelingprep.com/news/walmart-raises-prices-because-of-tariffs-20250515.jpg",
    "site": "wsj.com",
    "text": "The retail giant said its sales grew stronger during a quarter when President Trump enacted steep tariffs against the country's biggest trading partners.",
    "url": "https://www.wsj.com/business/retail/walmart-wmt-q1-earnings-report-stock-2026-b978bcf5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T08:15:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 08:35:04",
    "publisher": "Forbes",
    "title": "Tariffs, Shmariffs: Walmart's Earnings Show The Consumer Is Strong",
    "image": "https://images.financialmodelingprep.com/news/tariffs-shmariffs-walmarts-earnings-show-the-consumer-is-strong-20250515.jpg",
    "site": "forbes.com",
    "text": "Walmart reported earnings before Thursday's open and over the next few weeks several other big retailers will be reporting earnings too. The big question investors are asking: Is the Consumer Still Strong?",
    "url": "https://www.forbes.com/sites/adamsarhan/2025/05/15/tariffs-shmariffs-walmarts-earnings-show-the-consumer-is-strong/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T08:35:04-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 09:11:08",
    "publisher": "Zacks Investment Research",
    "title": "Walmart (WMT) Surpasses Q1 Earnings and Revenue Estimates",
    "image": "https://images.financialmodelingprep.com/news/walmart-wmt-surpasses-q1-earnings-and-revenue-estimates-20250515.jpg",
    "site": "zacks.com",
    "text": "Walmart (WMT) came out with quarterly earnings of $0.61 per share, beating the Zacks Consensus Estimate of $0.57 per share. This compares to earnings of $0.60 per share a year ago.",
    "url": "https://www.zacks.com/stock/news/2471552/walmart-wmt-surpasses-q1-earnings-and-revenue-estimates?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_4-2471552",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T09:11:08-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 09:12:37",
    "publisher": "The Motley Fool",
    "title": "Walmart Earnings: Price Hikes Are Coming",
    "image": "https://images.financialmodelingprep.com/news/walmart-earnings-price-hikes-are-coming-20250515.jpg",
    "site": "fool.com",
    "text": "Here's our initial take on Walmart's (WMT -4.19%) financial report.",
    "url": "https://www.fool.com/investing/2025/05/15/walmart-earnings-price-hikes-are-coming/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T09:12:37-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 09:40:03",
    "publisher": "Schwab Network",
    "title": "WMT Raises Prices Due to Tariffs, DKS Acquires Foot Locker",
    "image": "https://images.financialmodelingprep.com/news/wmt-raises-prices-due-to-tariffs-dks-acquires-foot-20250515.jpg",
    "site": "youtube.com",
    "text": "Despite an earnings beat, shares of Walmart (WMT) have pulled back from after-hours highs. Alex Coffey looks at the company's unaltered guidance and plans to raise prices as it weighs the impact of tariff costs.",
    "url": "https://www.youtube.com/watch?v=N1T8U7Szxrg",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T09:40:03-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:10:23",
    "publisher": "Benzinga",
    "title": "Dow Tumbles 150 Points; Walmart Earnings Top Views",
    "image": "https://images.financialmodelingprep.com/news/dow-tumbles-150-points-walmart-earnings-top-views-20250515.jpg",
    "site": "benzinga.com",
    "text": "U.S. stocks traded lower this morning, with the Dow Jones index falling more than 150 points on Thursday.",
    "url": "https://www.benzinga.com/25/05/45439522/dow-tumbles-150-points-walmart-earnings-top-views",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:10:23-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:13:46",
    "publisher": "New York Post",
    "title": "Walmart warns ‘unprecedented' price hikes are coming as tariffed goods start to hit shelves",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-unprecedented-price-hikes-are-coming-as-tariffed-20250515.jpg",
    "site": "nypost.com",
    "text": "The world's largest retailer warned it's facing a dynamic environment as it withheld a profit forecast for the current quarter.",
    "url": "https://nypost.com/2025/05/15/business/unprecedented-walmart-price-hikes-coming-as-tariffed-goods-start-to-hit-shelves/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:13:46-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:17:21",
    "publisher": "Invezz",
    "title": "Walmart to pass on tariff burden to shoppers, bracs for margin volatility",
    "image": "https://images.financialmodelingprep.com/news/walmart-to-pass-on-tariff-burden-to-shoppers-bracs-for-20250515.jpg",
    "site": "invezz.com",
    "text": "Walmart customers could soon see higher prices on store shelves, as the retail giant grapples with rising costs from new and ongoing tariffs. The company announced Thursday that it will raise prices on some items this month and into early summer, as tariff-related expenses begin to ripple through its supply chain.",
    "url": "https://invezz.com/news/2025/05/15/walmart-to-pass-on-tariff-burden-to-shoppers-bracs-for-margin-volatility/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:17:21-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:21:18",
    "publisher": "Fast Company",
    "title": "Walmart's earnings could offer clues about how retail is weathering the tariff storm",
    "image": "https://images.financialmodelingprep.com/news/walmarts-earnings-could-offer-clues-about-how-retail-is-20250515.jpg",
    "site": "fastcompany.com",
    "text": "Results from Walmart, a bellwether for the U.S. retail industry, will offer proof on Thursday why the Arkansas behemoth is best placed to navigate the uncertainty from the Trump administration's tariffs.",
    "url": "https://www.fastcompany.com/91334695/walmarts-earnings-preview-retail-tariffs",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:21:18-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:31:21",
    "publisher": "Zacks Investment Research",
    "title": "Here's What Key Metrics Tell Us About Walmart (WMT) Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/heres-what-key-metrics-tell-us-about-walmart-wmt-20250515.jpg",
    "site": "zacks.com",
    "text": "While the top- and bottom-line numbers for Walmart (WMT) give a sense of how the business performed in the quarter ended April 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.",
    "url": "https://www.zacks.com/stock/news/2471728/here-s-what-key-metrics-tell-us-about-walmart-wmt-q1-earnings?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm-2471728",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:31:21-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:32:45",
    "publisher": "Schaeffers Research",
    "title": "Walmart Stock Slips Despite Earnings Beat, Tariff Warning",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-slips-despite-earnings-beat-tariff-warning-20250515.jpg",
    "site": "schaeffersresearch.com",
    "text": "Walmart Inc (NYSE:WMT) stock is falling this morning, last seen 3.8% lower at $93.20 even after the retail giant beat quarterly earnings expectations and delivered its first-ever profitable quarter for e-commerce operations.",
    "url": "https://www.schaeffersresearch.com/content/news/2025/05/15/walmart-stock-slips-despite-earnings-beat-tariff-warning",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:32:45-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 10:53:29",
    "publisher": "Proactive Investors",
    "title": "Walmart executives warn tariff-driven price increases are coming as Q1 profit tops estimates",
    "image": "https://images.financialmodelingprep.com/news/walmart-executives-warn-tariffdriven-price-increases-are-coming-as-20250515.jpg",
    "site": "proactiveinvestors.com",
    "text": "Walmart Inc (NYSE:WMT, ETR:WMT) shares moved lower despite a first quarter earnings beat as management warned that price increases as a result of global tariffs are coming soon.  “We will do our best to keep our prices as low as possible but given the magnitude of the tariffs, even at the reduced levels announced this week, we aren't able to absorb all the pressure given the reality of narrow retail margins,” Walmart CEO Doug McMillon said in the company's earnings call on Thursday.",
    "url": "https://www.proactiveinvestors.com/companies/news/1071312",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T10:53:29-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 11:02:04",
    "publisher": "Fast Company",
    "title": "Walmart warns of higher prices due to tariffs; stock price falls in early trading",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-of-higher-prices-due-to-tariffs-stock-20250515.jpg",
    "site": "fastcompany.com",
    "text": "Walmart, known as one of America's most affordable retail chains, just signaled that President Trump's tariffs are about to disrupt its competitive pricing. Here's what to know:",
    "url": "https://www.fastcompany.com/91335300/walmart-raising-prices-tariffs-ceo-warns-stock-price-falls",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T11:02:04-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 11:11:57",
    "publisher": "CNBC Television",
    "title": "Walmart CFO: There's a wide range of outcomes in terms of tariffs",
    "image": "https://images.financialmodelingprep.com/news/walmart-cfo-theres-a-wide-range-of-outcomes-in-20250515.jpg",
    "site": "youtube.com",
    "text": "John David Rainey, Walmart CFO and executive vice president, joins CNBC's 'Squawk on the Street' to discuss the company's most recent earnings, how they will respond to tariffs, and more.",
    "url": "https://www.youtube.com/watch?v=fe7ow8QzJIs",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T11:11:57-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 11:29:42",
    "publisher": "The Motley Fool",
    "title": "Why Walmart Is Down Today",
    "image": "https://images.financialmodelingprep.com/news/why-walmart-is-down-today-20250515.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -1.68%) beat estimates for the quarter, but the retail giant warned of price hikes on the horizon because of tariffs.",
    "url": "https://www.fool.com/investing/2025/05/15/why-walmart-is-down-today/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T11:29:42-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 11:30:53",
    "publisher": "The Street",
    "title": "Walmart blames tariffs for higher prices",
    "image": "https://images.financialmodelingprep.com/news/walmart-blames-tariffs-for-higher-prices-20250515.jpg",
    "site": "youtube.com",
    "text": "Walmart CEO Doug McMillan made the announcement. Transcript: The world's largest retailer is raising prices - and it's blaming the White House.",
    "url": "https://www.youtube.com/watch?v=wYkBQ2HZ6So",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T11:30:53-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 11:41:06",
    "publisher": "PYMNTS",
    "title": "Walmart US eCommerce Sales Jump 21%; McMillon Cites Tariff-Proof Factors",
    "image": "https://images.financialmodelingprep.com/news/walmart-us-ecommerce-sales-jump-21-mcmillon-cites-tariffproof-20250515.jpg",
    "site": "pymnts.com",
    "text": "Walmart's strengthening position in eCommerce can help blunt at least some of the impact from tariffs and gives some room to offset cost pressures from its supply chain, management told analysts on Thursday during the fiscal first-quarter conference call.",
    "url": "https://www.pymnts.com/earnings/2025/walmart-us-ecommerce-sales-jump-21percent-mcmillon-cites-tariff-proof-factors/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T11:41:06-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 12:21:08",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Q1 Earnings Beat Estimates, E-Commerce Growth Supports Sales",
    "image": "https://images.financialmodelingprep.com/news/walmart-q1-earnings-beat-estimates-ecommerce-growth-supports-sales-20250515.jpg",
    "site": "zacks.com",
    "text": "WMT's fiscal Q1 results reflect increased sales and earnings growth across all segments.",
    "url": "https://www.zacks.com/stock/news/2472084/walmart-q1-earnings-beat-estimates-e-commerce-growth-supports-sales?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_article-2472084",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T12:21:08-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 12:26:06",
    "publisher": "Zacks Investment Research",
    "title": "PPI Declined More Than Expected",
    "image": "https://images.financialmodelingprep.com/news/ppi-declined-more-than-expected-20250515.jpg",
    "site": "zacks.com",
    "text": "Aside from last weekend's suspended reciprocal tariffs between the U.S. and China, and Tuesday's Consumer Price Index (CPI), this morning brings us the biggest bang for the buck in terms of grist for the economic mill. Just like every Thursday morning, this includes Weekly Jobless Claims.",
    "url": "https://www.zacks.com/stock/news/2471979/ppi-declined-more-than-expected?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2471979",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T12:26:06-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 12:30:39",
    "publisher": "Investopedia",
    "title": "Top Stock Movers Now: UnitedHealth Group, Walmart, Deere, and More",
    "image": "https://images.financialmodelingprep.com/news/top-stock-movers-now-unitedhealth-group-walmart-deere-and-20250515.jpg",
    "site": "investopedia.com",
    "text": "U.S. equities were mixed at midday, with the Dow Jones Industrial Average and S&P 500 slightly higher and the Nasdaq marginally lower.",
    "url": "https://www.investopedia.com/top-stock-movers-now-unitedhealth-group-walmart-deere-and-more-11735453",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T12:30:39-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 12:45:49",
    "publisher": "Yahoo Finance",
    "title": "Walmart had a really solid quarter despite tariff pressure, analyst says",
    "image": "https://images.financialmodelingprep.com/news/walmart-had-a-really-solid-quarter-despite-tariff-pressure-20250515.jpg",
    "site": "youtube.com",
    "text": "Walmart (WMT) stock is in focus after reporting mixed first quarter results — topping earnings estimates while coming slightly shy of revenue forecasts — and maintaining its full-year outlook, despite warning of tariffs causing price hikes. TD Cowen senior research analyst Oliver Chen joins Morning Brief to take a closer look at Walmart's earnings and the retail space at large.",
    "url": "https://www.youtube.com/watch?v=1H6gdXCyOo4",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T12:45:49-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 12:50:05",
    "publisher": "Yahoo Finance",
    "title": "Investing amid tariff uncertainty, Walmart earnings, Dick's Sporting Good to buy Foot Locker",
    "image": "https://images.financialmodelingprep.com/news/investing-amid-tariff-uncertainty-walmart-earnings-dicks-sporting-good-20250515.jpg",
    "site": "youtube.com",
    "text": "Morning Brief anchors Madison Mills and Brad Smith break down the latest financial news for May 15, 2025. Tariff uncertainty continues to persist, we speak with experts about what it means for inflation, plus strategies to protect your portfolio including why investors should not buy the dip right now.",
    "url": "https://www.youtube.com/watch?v=mimQGjWNMp0",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T12:50:05-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:09:44",
    "publisher": "CNBC Television",
    "title": "Jefferies' Corey Tarlowe on how Walmart is navigating tariff uncertainty",
    "image": "https://images.financialmodelingprep.com/news/jefferies-corey-tarlowe-on-how-walmart-is-navigating-tariff-20250515.jpg",
    "site": "youtube.com",
    "text": "Jefferies analyst Corey Tarlowe joins 'Closing Bell Overtime' to discuss Walmart as the discount retailer is set to report earnings on Thursday.",
    "url": "https://www.youtube.com/watch?v=6Nc8XwD_mcY",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:09:44-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:12:11",
    "publisher": "CNBC",
    "title": "Walmart says it will hike some prices due to tariffs. Here's what shoppers may pay more for",
    "image": "https://images.financialmodelingprep.com/news/walmart-says-it-will-hike-some-prices-due-to-tariffs-20250515.jpg",
    "site": "cnbc.com",
    "text": "Walmart on Thursday said even the discounter will have to raise prices on some items because of tariffs. Bananas, roses, avocados and toys are some the items hit by higher tariffs, according to the company.",
    "url": "https://www.cnbc.com/2025/05/15/walmart-price-increases-trump-tariffs.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:12:11-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:17:02",
    "publisher": "Yahoo Finance",
    "title": "Walmart CFO foresees price hikes, Dick's-Foot Locker deal: Catalysts",
    "image": "https://images.financialmodelingprep.com/news/walmart-cfo-foresees-price-hikes-dicksfoot-locker-deal-catalysts-20250515.jpg",
    "site": "youtube.com",
    "text": "It's the first full trading hour of Thursday, May 15, and the stock action is not letting up! Madison Mills and guest host, Innovator ETFs chief investment strategist Tim Urbanowicz, cover several of the top industry and market stories while tracking this morning's top trending stocks.",
    "url": "https://www.youtube.com/watch?v=nuXqtYg5JP4",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:17:02-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:17:38",
    "publisher": "CNET",
    "title": "Walmart Warns of Price Hikes on Food, Tech and Toys, Blames Tariffs",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-of-price-hikes-on-food-tech-and-20250515.jpg",
    "site": "cnet.com",
    "text": "You can expect to see prices creep up in the next few weeks.",
    "url": "https://www.cnet.com/personal-finance/walmart-warns-of-price-hikes-on-food-tech-and-toys-blames-tariffs/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:17:38-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:21:46",
    "publisher": "MarketBeat",
    "title": "Walmart Stock Alert: Big Price Move Expected Soon",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-alert-big-price-move-expected-soon-20250515.jpg",
    "site": "marketbeat.com",
    "text": "Walmart's NYSE: WMT stock price is set for a big move due to underlying strengths, market positioning, guidance, high potential for positive catalysts, and analysts' sentiment.",
    "url": "https://www.marketbeat.com/originals/walmart-stock-alert-big-price-move-expected-soon/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:21:46-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:26:03",
    "publisher": "Yahoo Finance",
    "title": "Price increases will be 'unavoidable' due to tariffs: Walmart CFO",
    "image": "https://images.financialmodelingprep.com/news/price-increases-will-be-unavoidable-due-to-tariffs-walmart-cfo-20250515.jpg",
    "site": "youtube.com",
    "text": "Walmart (WMT) warns of product price hikes to come stemming from tariffs while boasting strong same-store sales results in its mixed first quarter earnings report. Walmart CFO John David Rainey sits down with Catalysts host Madison Mills and Yahoo Finance executive editor Brian Sozzi to expand upon the retailer's pricing decisions, the consumer categories that will be most heavily affected by these increases, and how the store is considering any future supply chain shocks.",
    "url": "https://www.youtube.com/watch?v=Xu3HD4HFuJU",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:26:03-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 13:37:23",
    "publisher": "Bloomberg Markets and Finance",
    "title": "Walmart Warns of Higher Prices | Open Interest 05/15/25",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-of-higher-prices-open-interest-051525-20250515.jpg",
    "site": "youtube.com",
    "text": "Retail sales barely rise in April, another sign of a pullback on spending as Walmart warns that higher prices are coming soon. Jamie Dimon says he wouldn't take a recession off the table.",
    "url": "https://www.youtube.com/watch?v=cKiFIhw6gLI",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T13:37:23-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 15:00:56",
    "publisher": "Seeking Alpha",
    "title": "Walmart: Tariff Commentary Diverting Attention From Growth Deceleration",
    "image": "https://images.financialmodelingprep.com/news/walmart-tariff-commentary-diverting-attention-from-growth-deceleration-20250515.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart beat earnings estimates, but this was its weakest quarter since 2022, with broad-based growth deceleration and margin pressure from FX headwinds. Management warned of upcoming price hikes due to tariffs and withheld profit guidance, signaling heightened uncertainty for the near term. At 37x forward earnings and slowing growth, Walmart's valuation looks stretched, with little upside even if the premium multiple is maintained.",
    "url": "https://seekingalpha.com/article/4787274-walmart-tariff-commentary-diverting-attention-from-growth-deceleration",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T15:00:56-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 15:09:37",
    "publisher": "Business Insider",
    "title": "Walmart CFO says tariff rates are still 'too high' and the retail giant can't predict how shoppers will respond",
    "image": "https://images.financialmodelingprep.com/news/walmart-cfo-says-tariff-rates-are-still-too-high-20250515.jpg",
    "site": "businessinsider.com",
    "text": "Walmart says tariffs remain \"too high,\" even after recent reductions. The company warned that it will have to raise some prices if import costs don't come down further.",
    "url": "https://www.businessinsider.com/walmart-cfo-tariffs-too-high-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T15:09:37-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 15:35:10",
    "publisher": "Seeking Alpha",
    "title": "Coupang: Next-Gen Walmart",
    "image": "https://images.financialmodelingprep.com/news/coupang-nextgen-walmart-20250515.jpg",
    "site": "seekingalpha.com",
    "text": "In this review of Coupang, we will consider the nature of the business, and, in doing so, better understand its cash flow durability, which is important in understanding its valuation. We will then consider the business' recent performance and growth runway, long-term margin expansion opportunity, and perform a valuation exercise. In my view, the market continues to wholesale reject the possibility of margin expansion, new product launches, new geographies, and new acquisitions. As such, I believe Coupang is undervalued today, and, over time, the market will come to appreciate the substantial economic content latent within the Coupang business.",
    "url": "https://seekingalpha.com/article/4787275-coupang-next-gen-walmart",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T15:35:10-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 15:46:25",
    "publisher": "Investopedia",
    "title": "High Tariffs Could Pinch Profits at Walmart, Retailer Says",
    "image": "https://images.financialmodelingprep.com/news/high-tariffs-could-pinch-profits-at-walmart-retailer-says-20250515.jpg",
    "site": "investopedia.com",
    "text": "Higher tariffs could jeopardize Walmart's profits in the year ahead even if the retail giant hits its sales goals, executives said Thursday.",
    "url": "https://www.investopedia.com/tariffs-may-pinch-profits-at-walmart-retailer-says-11735725",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T15:46:25-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 17:19:49",
    "publisher": "Schwab Network",
    "title": "UNH Drop, WMT Earnings Move, COIN Pressure, AMAT Mixed",
    "image": "https://images.financialmodelingprep.com/news/unh-drop-wmt-earnings-move-coin-pressure-amat-mixed-20250515.jpg",
    "site": "youtube.com",
    "text": "JD Durkin wraps up the trading day as the S&P 500 (SPX) extends its winning streak to 4 days. Meanwhile, UnitedHealth (UNH) and Coinbase (COIN) each fall on reports of governmental investigations into their businesses.",
    "url": "https://www.youtube.com/watch?v=BApz3PF8jN4",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T17:19:49-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 18:24:10",
    "publisher": "CNBC Television",
    "title": "Walmart is best poised to weather the tariffs, says former Walmart U.S. CEO Bill Simon",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-best-poised-to-weather-the-tariffs-says-former-20250515.jpg",
    "site": "youtube.com",
    "text": "Bill Simon, former Walmart U.S. CEO, joins ‘Fast Money' to discuss the discount retailer's better-than-expected Q1 earnings, the company's plan to raise prices on some items due to tariffs, and more.",
    "url": "https://www.youtube.com/watch?v=bZ4YRn-FQtg",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T18:24:10-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 19:47:06",
    "publisher": "CNBC",
    "title": "Walmart's former U.S. CEO Bill Simon thinks retailer can easily absorb tariff costs, criticizes its 'doom and gloom' commentary",
    "image": "https://images.financialmodelingprep.com/news/walmarts-former-us-ceo-bill-simon-thinks-retailer-can-20250515.jpg",
    "site": "cnbc.com",
    "text": "Bill Simon, who ran Walmart from 2010 to 2014, suggests the company may be overstating challenges tied to tariffs.",
    "url": "https://www.cnbc.com/2025/05/15/walmart-can-absorb-tariffs-fmr-us-ceo-simon-questions-price-hikes.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T19:47:06-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 20:13:12",
    "publisher": "CNBC Television",
    "title": "Walmart can be tough with suppliers because they have more bargaining power, says Jim Cramer",
    "image": "https://images.financialmodelingprep.com/news/walmart-can-be-tough-with-suppliers-because-they-have-20250515.jpg",
    "site": "youtube.com",
    "text": "Mad Money' host Jim Cramer explains how investors can make big money in the stock market—and more.",
    "url": "https://www.youtube.com/watch?v=ovmdEsoZR9s",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T20:13:12-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 20:46:04",
    "publisher": "Zacks Investment Research",
    "title": "Buy, Sell, or Hold Walmart Stock After Q1 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/buy-sell-or-hold-walmart-stock-after-q1-earnings-20250515.jpg",
    "site": "zacks.com",
    "text": "Reporting its Q1 results this morning, Walmart (WMT) exceeded expectations but warned that its prices will rise as the retailer can't avoid passing on the high costs of tariffs to its customers.",
    "url": "https://www.zacks.com/commentary/2472605/buy-sell-or-hold-walmart-stock-after-q1-earnings?cid=CS-STOCKNEWSAPI-FT-investment_ideas-2472605",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T20:46:04-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 21:00:00",
    "publisher": "WSJ",
    "title": "Walmart's Price Hikes Open Door to Increases From ‘Everybody Else'",
    "image": "https://images.financialmodelingprep.com/news/walmarts-price-hikes-open-door-to-increases-from-everybody-20250515.jpg",
    "site": "wsj.com",
    "text": "The company's announcement on tariffs sends a clear signal that higher prices are on the way.",
    "url": "https://www.wsj.com/business/retail/walmart-tariff-raising-prices-economic-impact-714c10fd",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T21:00:00-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-15 22:31:50",
    "publisher": "Seeking Alpha",
    "title": "Walmart Inc. (WMT) Q1 2026 Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-q1-2026-earnings-call-transcript-20250515.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart Inc. (NYSE:WMT ) Q1 2026 Earnings Conference Call May 15, 2025 8:00 AM ET Company Participants Steph Wissink - SVP, IR Doug McMillon - CEO John David Rainey - CFO John Furner - CEO, Walmart U.S. Chris Nicholas - CEO, Sam's Club Kath McLay - CEO, Walmart International Conference Call Participants Paul Lejuez - Citigroup Simeon Gutman - Morgan Stanley Christopher Horvers - JP Morgan Peter Benedict - Baird Brad Thomas - KeyBanc Capital Markets Michael Lasser - UBS Edward Kelly - Wells Fargo Kate McShane - Goldman Sachs Scot Ciccarelli - Truist Securities Robby Ohmes - Bank of America Rupesh Parikh - Oppenheimer David Bellinger - Mizuho Securities Greg Melich - Evercore ISI Krisztina Katai - Deutsche Bank Operator Greetings. Welcome to Walmart's First Quarter Fiscal Year 2026 Earnings Call.",
    "url": "https://seekingalpha.com/article/4787443-walmart-inc-wmt-q1-2026-earnings-call-transcript",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-15T22:31:50-04:00",
    "date_et": "2025-05-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 00:02:00",
    "publisher": "Invezz",
    "title": "Top 4 Dow Jones stocks to buy and hold for the next bull run",
    "image": "https://images.financialmodelingprep.com/news/top-4-dow-jones-stocks-to-buy-and-hold-20250516.jpg",
    "site": "invezz.com",
    "text": "The Dow Jones Industrial Average has rebounded after crashing to $36,640 in April as concerns about the trade war rose. It has jumped by over 15.5% to $42,310, and is hovering at the highest point since March 27.",
    "url": "https://invezz.com/news/2025/05/16/top-4-dow-jones-stocks-to-buy-and-hold-for-the-next-bull-run/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T00:02:00-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 09:15:03",
    "publisher": "Forbes",
    "title": "Walmart Warns On Prices As Tariffs, Markets, And Earnings Collide",
    "image": "https://images.financialmodelingprep.com/news/walmart-warns-on-prices-as-tariffs-markets-and-earnings-20250516.jpg",
    "site": "forbes.com",
    "text": "Key Takeaways",
    "url": "https://www.forbes.com/sites/jjkinahan/2025/05/16/walmart-warns-on-prices-as-tariffs-markets-and-earnings-collide/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T09:15:03-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 09:51:20",
    "publisher": "Zacks Investment Research",
    "title": "How Should Investors Approach Walmart Stock Post Q1 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/how-should-investors-approach-walmart-stock-post-q1-earnings-20250516.jpg",
    "site": "zacks.com",
    "text": "WMT's Q1 results and strategic growth areas reinforce long-term strength, but challenges like tariffs and currency headwinds cloud short-term visibility.",
    "url": "https://www.zacks.com/stock/news/2472762/how-should-investors-approach-walmart-stock-post-q1-earnings?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2472762",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T09:51:20-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 10:31:52",
    "publisher": "247 Wallst",
    "title": "S&P 500 INDEX (SPX) Live: Markets Pivot Toward Caution After Winning Streak",
    "image": "https://images.financialmodelingprep.com/news/sp-500-index-spx-live-markets-pivot-toward-caution-20250516.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Has Ended Economy Not in the Clear: JPMorgan CEO 12:05 pm by Gerelyn Terzo Despite more optimistic forecasts from within JPMorgan Chase, CEO Jamie Dimon continues to express concerns about the economy&#8217;s resilience, cautioning that it is not yet clear of potential recession rearing its head. Dimon pointed to the unpredictable nature of tariffs as a key area of uncertainty, while the bank’s chief U.S. economist has attached a less than 50% chance of a recession. Dimon told Bloomberg, &#8220;If there’s a recession, I don’t know how big it will be or how long it will last. Hopefully we’ll avoid it, but I wouldn’t take it off the table at this point.&#8221; Shielding Consumers 11:07 am by Gerelyn Terzo While some retailers like Walmart are discussing higher prices for consumers due to tariffs, data on producer prices suggests a broader trend of cost absorption. April saw a significant 0.5% decrease in producer prices, the most substantial drop in five years. This indicates that U.S. producers are largely bearing the brunt of increased costs, protecting consumers from immediate price hikes, a finding that significantly undershot Bloomberg economist expectations of a 0.2% increase. This article will be updated throughout the day, so check back often for more daily updates. The stock market has opened with a cautious tone this morning, as the Dow, Nasdaq, and S&amp;P 500 are all trading lower. The SPX index is down 0.37%. Investors are reacting to concerning statements made by Federal Reserve Chairman Jerome Powell at an economic forum earlier today. Powell warned of potentially higher long-term interest rates for the long term, owing in part to an uncertain monetary policy outlook. Today&#8217;s pullback follows an impressive run for the broader stock market in which the S&amp;P 500 has been retaking lost ground for a positive year-to-date performance. For its part, the tech-heavy Nasdaq Composite has recovered 6% over the past five trading sessions. Today Apple (Nasdaq: AAPL) will distribute it quarterly cash dividend of $0.26 per share to shareholders. Here&#8217;s the early look at market performance: Dow Jones Industrial Average: Down 114.29 (-0.27%) Nasdaq Composite: Down 128.16 (-0.67%) S&amp;P 500: Down 13.30 (-0.23%) Stocks in Focus Walmart (NYSE: WMT) is trading down by 4.0% following an announcement from a company executive that the retailer plans to transfer tariff costs to consumers in the form of higher prices, with these increases potentially taking effect this month. Shares of Chinese e-commerce leader Alibaba (NYSE: BABA) have tumbled by 6.5% today after the company reported disappointing revenue figures for its fiscal fourth quarter. Networking solutions provider Cisco (Nasdaq: CSCO) is also seeing downward pressure, with its stock down 4.2%. CoreWeave (Nasdaq: CRWV) is under pressure, falling by 4.4%, despite announcing strong first-quarter revenue and significant demand for its AI cloud platform,. Investors appear concerned by the company&#8217;s plans for aggressive capex plans in Q2. On the positive side, CoreWeave clinched a lucrative partnership with Google. UnitedHealth Group (NYSE: UNH) is a major drag on the markets, falling 17% today in a series of setbacks, the latest of which is a potential Medicare controversy. The post S&#038;P 500 INDEX (SPX) Live: Markets Pivot Toward Caution After Winning Streak appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/15/sp-500-index-spx-live-markets-pivot-toward-caution-after-winning-streak/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T10:31:52-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 10:47:59",
    "publisher": "Business Insider",
    "title": "Walmart delivery has reached Amazon-like speeds. It just helped the company turn a profit online.",
    "image": "https://images.financialmodelingprep.com/news/walmart-delivery-has-reached-amazonlike-speeds-it-just-helped-20250516.jpg",
    "site": "businessinsider.com",
    "text": "Walmart will soon offer delivery in three-hours or less to 95% of the US population. Its delivery business is also profitable for the first time, executives said on Thursday.",
    "url": "https://www.businessinsider.com/walmart-delivery-amazon-fast-profitable-first-time-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T10:47:59-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 11:21:04",
    "publisher": "Zacks Investment Research",
    "title": "ETFs in Focus Post Walmart Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/etfs-in-focus-post-walmart-q1-earnings-20250516.jpg",
    "site": "zacks.com",
    "text": "Walmart tops earnings and revenue estimates but warns of price hikes.",
    "url": "https://www.zacks.com/stock/news/2473043/etfs-in-focus-post-walmart-q1-earnings?cid=CS-STOCKNEWSAPI-FT-etf_news_and_commentary-2473043",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T11:21:04-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 11:57:59",
    "publisher": "Benzinga",
    "title": "Walmart Growth Prospects Remain Solid But Tariff Uncertainty Lingers, Analysts Say",
    "image": "https://images.financialmodelingprep.com/news/walmart-growth-prospects-remain-solid-but-tariff-uncertainty-lingers-20250516.jpg",
    "site": "benzinga.com",
    "text": "Shares of Walmart Inc WMT were climbing in early trading on Friday, despite the company Thursday reporting mixed first-quarter results.",
    "url": "https://www.benzinga.com/news/earnings/earnings-beats/25/05/45472271/walmart-growth-prospects-remain-solid-but-tariff-uncertainty-lingers-analysts-say",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T11:57:59-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 12:40:14",
    "publisher": "Zacks Investment Research",
    "title": "CRRFY or WMT: Which Is the Better Value Stock Right Now?",
    "image": "https://images.financialmodelingprep.com/news/crrfy-or-wmt-which-is-the-better-value-stock-20250516.jpg",
    "site": "zacks.com",
    "text": "Investors interested in stocks from the Retail - Supermarkets sector have probably already heard of Carrefour SA (CRRFY) and Walmart (WMT). But which of these two stocks presents investors with the better value opportunity right now?",
    "url": "https://www.zacks.com/stock/news/2473138/crrfy-or-wmt-which-is-the-better-value-stock-right-now?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_3-2473138",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T12:40:14-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 14:02:37",
    "publisher": "Benzinga",
    "title": "These Analysts Increase Their Forecasts On Walmart After Upbeat Earnings",
    "image": "https://images.financialmodelingprep.com/news/these-analysts-increase-their-forecasts-on-walmart-after-upbeat-earnings-20250516.jpg",
    "site": "benzinga.com",
    "text": "Walmart Inc. WMT reported better-than-expected earnings for its first quarter on Thursday.",
    "url": "https://www.benzinga.com/25/05/45474494/these-analysts-increase-their-forecasts-on-walmart-after-upbeat-earnings",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T14:02:37-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 17:10:36",
    "publisher": "CNBC Television",
    "title": "Neuberger Berman's John San Marco on whether Walmart's rivals will follow its price hikes",
    "image": "https://images.financialmodelingprep.com/news/neuberger-bermans-john-san-marco-on-whether-walmarts-rivals-20250516.jpg",
    "site": "youtube.com",
    "text": "John San Marco, senior research analyst at Neuberger Berman, joins ‘Closing Bell Overtime' to discuss what Walmart's plan to raise prices on some goods means for the retail business, how investors should approach retail, and more.",
    "url": "https://www.youtube.com/watch?v=T674eiiU06Y",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T17:10:36-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 17:17:00",
    "publisher": "WSJ",
    "title": "The Score: UnitedHealth, Walmart, Coinbase Global and More Stocks That Moved on the Week's News",
    "image": "https://images.financialmodelingprep.com/news/the-score-unitedhealth-walmart-coinbase-global-and-more-stocks-20250516.jpg",
    "site": "wsj.com",
    "text": "Here are some of the major companies whose stocks moved on the week's news.",
    "url": "https://www.wsj.com/finance/stocks/the-score-unitedhealth-walmart-coinbase-global-and-more-stocks-that-moved-on-the-weeks-news-1cbc7fba",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T17:17:00-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 17:23:13",
    "publisher": "PYMNTS",
    "title": "Walmart Prepares for a Future Where AI Shops for Consumers",
    "image": "https://images.financialmodelingprep.com/news/walmart-prepares-for-a-future-where-ai-shops-for-20250516.jpg",
    "site": "pymnts.com",
    "text": "Walmart is gearing up for a shift in consumer behavior as artificial intelligence begins to take a more active role in how people shop.",
    "url": "https://www.pymnts.com/news/artificial-intelligence/2025/walmart-prepares-future-where-ai-shops-rather-than-consumers/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T17:23:13-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-16 17:50:00",
    "publisher": "The Motley Fool",
    "title": "Why Walmart Stock Topped the Market Today",
    "image": "https://images.financialmodelingprep.com/news/why-walmart-stock-topped-the-market-today-20250516.jpg",
    "site": "fool.com",
    "text": "The market wasn't so hot on Walmart (WMT 1.99%) stock on Thursday following the company's latest quarterly-earnings release, but sentiment changed the following day. Thanks in no small part to a clutch of positive analyst updates on the company, investors snapped up Walmart again, sending it to a 3% gain on the day.",
    "url": "https://www.fool.com/investing/2025/05/16/why-walmart-stock-topped-the-market-today/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-16T17:50:00-04:00",
    "date_et": "2025-05-16"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 05:30:00",
    "publisher": "WSJ",
    "title": "In a Trade War, Walmart Lacks Some of Amazon's Ammunition",
    "image": "https://images.financialmodelingprep.com/news/in-a-trade-war-walmart-lacks-some-of-amazons-ammunition-20250517.jpg",
    "site": "wsj.com",
    "text": "Walmart's stock is pricier, but Amazon's growth and profit potential are far greater.",
    "url": "https://www.wsj.com/business/retail/walmart-amazon-trade-war-660afaa9",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T05:30:00-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 05:42:00",
    "publisher": "The Motley Fool",
    "title": "Tariff Turmoil: Is Walmart's Stock Set to Slide?",
    "image": "https://images.financialmodelingprep.com/news/tariff-turmoil-is-walmarts-stock-set-to-slide-20250517.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT 1.99%) easily beat Wall Street's first-quarter earnings estimates. But it didn't matter.",
    "url": "https://www.fool.com/investing/2025/05/17/walmarts-tariff-warning-is-the-stock-poised-to-sin/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T05:42:00-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 08:05:00",
    "publisher": "Seeking Alpha",
    "title": "Ride High But Stay Dry: Why I'm Accumulating Cash As The Market Rebounds",
    "image": "https://images.financialmodelingprep.com/news/ride-high-but-stay-dry-why-im-accumulating-cash-20250517.jpg",
    "site": "seekingalpha.com",
    "text": "The 10-Year Treasury yield signals that the market does not expect a recession in the near term. Current yield levels suggest inflation expectations remain elevated compared to recent years. Investors should interpret the bond market as pricing in persistent inflation rather than imminent economic contraction.",
    "url": "https://seekingalpha.com/article/4787661-ride-high-stay-dry-accumulating-cash-as-market-rebounds",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T08:05:00-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 09:15:00",
    "publisher": "Invezz",
    "title": "Stephanie Link reveals her favourite retail stocks after April inflation data",
    "image": "https://images.financialmodelingprep.com/news/stephanie-link-reveals-her-favourite-retail-stocks-after-april-inflation-20250517.jpg",
    "site": "invezz.com",
    "text": "US retail stocks are in focus this week after the Bureau of Labour Statistics said that inflation was up slightly less-than-expected in April. Inflation data tends to be significant for retail stocks as it directly influences consumer purchasing power and overall business costs.",
    "url": "https://invezz.com/news/2025/05/17/stephanie-link-reveals-her-favourite-retail-stocks-after-april-inflation-data/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T09:15:00-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 10:45:35",
    "publisher": "Reuters",
    "title": "Trump tells Walmart to 'eat the tariffs' instead of raising prices",
    "image": "https://images.financialmodelingprep.com/news/trump-tells-walmart-to-eat-the-tariffs-instead-of-20250517.jpg",
    "site": "reuters.com",
    "text": "U.S. President Donald Trump said on Saturday that Walmart (WMT.N) should \"eat the tariffs\" instead of blaming duties imposed on imported goods for the retailer's increase prices.",
    "url": "https://www.reuters.com/world/us/trump-tells-walmart-eat-tariffs-instead-raising-prices-2025-05-17/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T10:45:35-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 11:16:12",
    "publisher": "CNBC",
    "title": "Trump tells Walmart to 'eat the tariffs' after retailer warned it will raise prices",
    "image": "https://images.financialmodelingprep.com/news/trump-tells-walmart-to-eat-the-tariffs-after-retailer-20250517.jpg",
    "site": "cnbc.com",
    "text": "Trump blasted Walmart after the retailer warned it would raise prices due to tariffs.",
    "url": "https://www.cnbc.com/2025/05/17/trump-tells-walmart-to-eat-the-tariffs.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T11:16:12-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 13:15:00",
    "publisher": "WSJ",
    "title": "Trump Attacks Walmart for Tariff-Related Price Increases",
    "image": "https://images.financialmodelingprep.com/news/trump-attacks-walmart-for-tariffrelated-price-increases-20250517.jpg",
    "site": "wsj.com",
    "text": "Retailer's CEO last month was among a small group of executives who warned the president that tariffs would result in price hikes.",
    "url": "https://www.wsj.com/business/retail/trump-attacks-walmart-for-tariff-related-price-increases-63ef9db8",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T13:15:00-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 14:58:06",
    "publisher": "New York Post",
    "title": "‘Eat the tariffs': Trump warns Walmart after retail giant cautions steep price raises",
    "image": "https://images.financialmodelingprep.com/news/eat-the-tariffs-trump-warns-walmart-after-retail-giant-20250517.jpg",
    "site": "nypost.com",
    "text": "President Donald Trump ripped into Walmart, saying on social media that the retail giant should eat the additional costs created by his tariffs.",
    "url": "https://nypost.com/2025/05/17/us-news/eat-the-tariffs-trump-warns-walmart-after-retail-giant-cautions-steep-price-raises/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T14:58:06-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-17 16:50:04",
    "publisher": "Forbes",
    "title": "Trump Tells Walmart 'Eat The Tariffs' After Retailer Warns Of Higher Prices—Here's What Could Go Up In Price",
    "image": "https://images.financialmodelingprep.com/news/trump-tells-walmart-eat-the-tariffs-after-retailer-warns-20250517.jpg",
    "site": "forbes.com",
    "text": "President Donald Trump told Walmart to stop blaming his sweeping tariffs as the reason for price increases, urging the retail conglomerate to absorb the costs of the tariffs as it prepares to raise the prices of several goods this month.",
    "url": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/17/trump-tells-walmart-eat-the-tariffs-after-retailer-warns-of-higher-prices-heres-what-could-go-up-in-price/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-17T16:50:04-04:00",
    "date_et": "2025-05-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 08:47:00",
    "publisher": "The Motley Fool",
    "title": "Actually, Walmart's Q1 Report Was Better Than It Seems",
    "image": "https://images.financialmodelingprep.com/news/actually-walmarts-q1-report-was-better-than-it-seems-20250518.jpg",
    "site": "fool.com",
    "text": "With nothing more than a passing glance, it would be easy to come to a bearish conclusion about Walmart (WMT 1.99%). The world's biggest brick-and-mortar retailer topped its first-quarter earnings estimates, but its reported profits technically fell year over year.",
    "url": "https://www.fool.com/investing/2025/05/18/walmarts-q1-report-was-better-than-it-seems/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T08:47:00-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 10:00:00",
    "publisher": "Market Watch",
    "title": "Prices are probably going up at Walmart. Target and other retailers will detail the tariff impact this week",
    "image": "https://images.financialmodelingprep.com/news/prices-are-probably-going-up-at-walmart-target-and-20250518.jpg",
    "site": "marketwatch.com",
    "text": "This week, the lens on the consumer will narrow, as we get quarterly reports from retailers like Home Depot, Lowe's and other chains.",
    "url": "https://www.marketwatch.com/story/prices-are-probably-going-up-at-walmart-target-and-other-retailers-will-detail-the-tariff-impact-this-week-582e3f24",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T10:00:00-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 10:17:29",
    "publisher": "24/7 Wall Street",
    "title": "Walmart's Stock Could Be Tanked By Trump Tariffs",
    "image": "https://images.financialmodelingprep.com/news/walmarts-stock-could-be-tanked-by-trump-tariffs-20250518.jpg",
    "site": "247wallst.com",
    "text": "There is a rumor that Amazon (NASDAQ: AMZN) planned to show the effect of tariffs on the prices of items sold at its site.",
    "url": "https://247wallst.com/politics/2025/05/18/walmarts-stock-could-be-tanked-by-trump-tariffs/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T10:17:29-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 11:59:35",
    "publisher": "The Guardian",
    "title": "US treasury secretary says Walmart will ‘eat some of the tariffs' after Trump demand",
    "image": "https://images.financialmodelingprep.com/news/us-treasury-secretary-says-walmart-will-eat-some-of-20250518.jpg",
    "site": "theguardian.com",
    "text": "Scott Bessent claims he received assurance in a personal call with company's chief executive",
    "url": "https://www.theguardian.com/us-news/2025/may/18/trump-walmart-tariffs",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T11:59:35-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 17:55:36",
    "publisher": "Investopedia",
    "title": "President Trump Says Walmart Should 'Eat the Tariffs'",
    "image": "https://images.financialmodelingprep.com/news/president-trump-says-walmart-should-eat-the-tariffs-20250518.jpg",
    "site": "investopedia.com",
    "text": "Walmart is accustomed to attracting attention for its prices. This weekend, it caught the eyes—and ire—of the president.",
    "url": "https://www.investopedia.com/president-trump-says-walmart-should-eat-the-tariffs-11737234",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T17:55:36-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-18 18:15:00",
    "publisher": "Business Wire",
    "title": "Walmart, Sam's Club and the Walmart Foundation Commit $750,000 to Support Tornado Relief Efforts",
    "image": "https://images.financialmodelingprep.com/news/walmart-sams-club-and-the-walmart-foundation-commit-750000-20250518.jpg",
    "site": "businesswire.com",
    "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)--Walmart Inc., along with Sam's Club and the Walmart Foundation, is actively supporting impacted communities in Illinois, Kentucky, and Missouri following severe storms that have left thousands with damage to their homes and many others without electricity. Together, they are committing $750,000 to support relief efforts across the impacted areas. Following the devastating storms—particularly in St. Louis, MO, and London and Somerset, KY—Walmart and Sam's Club.",
    "url": "https://www.businesswire.com/news/home/20250518012653/en/Walmart-Sam%E2%80%99s-Club-and-the-Walmart-Foundation-Commit-750000-to-Support-Tornado-Relief-Efforts/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-18T18:15:00-04:00",
    "date_et": "2025-05-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 09:11:10",
    "publisher": "FXEmpire",
    "title": "S&P 500: Moody's Downgrade and Yield Spike Sink Tesla, Walmart, and Tech Stocks",
    "image": "https://images.financialmodelingprep.com/news/sp-500-moodys-downgrade-and-yield-spike-sink-tesla-20250519.jpg",
    "site": "fxempire.com",
    "text": "Moody's U.S. credit downgrade and surging yields hit the S&P 500 hard as Tesla and Walmart lead losses in tech and consumer sectors.",
    "url": "https://www.fxempire.com/forecasts/article/sp-500-moodys-downgrade-and-yield-spike-sink-tesla-walmart-and-tech-stocks-1519989",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T09:11:10-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 10:04:00",
    "publisher": "Market Watch",
    "title": "After Trump rages, Walmart says it will eat ‘some' of the tariff costs",
    "image": "https://images.financialmodelingprep.com/news/after-trump-rages-walmart-says-it-will-eat-some-20250519.jpg",
    "site": "marketwatch.com",
    "text": "Citing a conversation with Walmart CEO Doug McMillon, Treasury Secretary Scott Bessent said the retailer will absorb some of the tariffs' impact, as it did during President Trump's first term in office.",
    "url": "https://www.marketwatch.com/story/after-trump-rages-walmart-says-it-will-eat-some-of-the-tariff-costs-637af84c",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T10:04:00-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 10:06:12",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Inc. (WMT) Is a Trending Stock: Facts to Know Before Betting on It",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-is-a-trending-stock-facts-to-20250519.jpg",
    "site": "zacks.com",
    "text": "Walmart (WMT) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
    "url": "https://www.zacks.com/stock/news/2473698/walmart-inc-wmt-is-a-trending-stock-facts-to-know-before-betting-on-it?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|most_searched_stocks-2473698",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T10:06:12-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 10:40:00",
    "publisher": "Proactive Investors - Finance",
    "title": "Klarna Swings to profit as UK moves to regulate buy now, pay later sector",
    "image": "https://images.financialmodelingprep.com/news/klarna-swings-to-profit-as-uk-moves-to-regulate-20250519.jpeg",
    "site": "https://www.proactiveinvestors.com",
    "text": "Klarna reported a 15% rise in first-quarter revenue on Monday and returned to profit as the UK announced plans to tighten regulation on buy now, pay later lenders. The Swedish fintech posted $701 million in revenue and a $3 million adjusted profit, compared with a $2 million loss a year earlier, excluding the sale of its checkout business. The results follow Klarna’s decision last month to pause its planned US initial public offering, citing economic uncertainty and tariff concerns. The company made no mention of the IPO in its earnings update but said it is monitoring shifts in the business environment. The UK, one of Klarna’s key markets, said Monday it will introduce new rules from next year aimed at protecting consumers from unregulated lending. Klarna’s US revenue rose 33%, helped by partnerships with Walmart, DoorDash and eBay. StickIt Technologies Inc. (CSE:STKT) announced that it has strengthened its leadership team with the appointment of Igor Kostioutchenko to its board of directors. Kostioutchenko brings more than 15 years of experience in accounting and finance to the company, StickIt said in a statement on Friday. He holds multiple professional designations, including Chartered Professional Accountant, Chartered Business Valuator, Certified Internal Auditor, Certified Fraud Examiner, and is a Licensed Public Accountant. His expertise lies in financial assurance, advisory, and valuations, which StickIt highlighted are critical areas as the company advances its intellectual property portfolio and product commercialization. Eli Ben Haroosh, StickIt CEO, welcomed Kostioutchenko to the company’s board of directors. \"We hope his expertise in finance and assurance will further increase the company's audit committee's and board of directors' financial expertise,” he said. “Mr Kostioutchenko is a chartered professional accountant with extensive experience in a variety of companies, and I am confident that his contribution to the company will be significant and comes at exactly the right time.\"",
    "url": "https://www.proactiveinvestors.com/companies/news/1071473/klarna-swings-to-profit-as-uk-moves-to-regulate-buy-now-pay-later-sector-1071473.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T10:40:00-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 11:52:49",
    "publisher": "Yahoo Finance",
    "title": "Walmart is not going to take a hit on its operating margins, advisor says",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-not-going-to-take-a-hit-on-20250519.jpg",
    "site": "youtube.com",
    "text": "Walmart's (WMT) pricing power is under the spotlight as earnings from major retailers loom. SW Retail Advisors president Stacey Widlitz joins Morning Brief to explain how Walmart's scale allows it to pressure vendors in ways other retailers can't.",
    "url": "https://www.youtube.com/watch?v=z5nb-VMi6SA",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T11:52:49-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 12:35:33",
    "publisher": "CNBC Television",
    "title": "Mizuho's David Bellinger: Tariff pressure will 'absolutely help' Walmart in near-term",
    "image": "https://images.financialmodelingprep.com/news/mizuhos-david-bellinger-tariff-pressure-will-absolutely-help-walmart-20250519.jpg",
    "site": "youtube.com",
    "text": "David Bellinger, Mizuho senior analyst, joins CNBC's 'Money Movers' to discuss the potential impact of tariffs on Walmart.",
    "url": "https://www.youtube.com/watch?v=He362fNWBSs",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T12:35:33-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 13:30:23",
    "publisher": "Schwab Network",
    "title": "Seay: Tariffs \"Economic Warfare,\" WMT & Retailer Duty to Help Consumers & Investors",
    "image": "https://images.financialmodelingprep.com/news/seay-tariffs-economic-warfare-wmt-retailer-duty-to-help-20250519.jpg",
    "site": "youtube.com",
    "text": "George Seay says Walmart (WMT) is \"shooting the lights out\" when it comes to its earnings. However, tariffs are creating a situation where Walmart and similar retailers may pass some of those costs to consumers.",
    "url": "https://www.youtube.com/watch?v=peZN7ZOtKw4",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T13:30:23-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 13:42:04",
    "publisher": "MarketBeat",
    "title": "Walmart Stock Holds as Tariff Risk Spurs Support",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-holds-as-tariff-risk-spurs-support-20250519.jpg",
    "site": "marketbeat.com",
    "text": "There's no denying that the current state of the S&P 500 index can be summed up in a couple of words: volatile and uncertain. President Trump's recently rolled out trade tariffs create a less clear future for global trade and the costs to be paid and handled by hundreds of businesses in the United States, indirectly hurting the ability for management and Wall Street analysts to forecast earnings potential down the line.",
    "url": "https://www.marketbeat.com/originals/walmart-stock-holds-as-tariff-risk-spurs-support/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T13:42:04-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 14:18:22",
    "publisher": "Investopedia",
    "title": "Walmart Stock Ticks Lower After Trump Says Retailer Should 'Eat the Tariffs'",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-ticks-lower-after-trump-says-retailer-should-20250519.jpg",
    "site": "https://www.investopedia.com",
    "text": "Close Key Takeaways Walmart should \"eat the tariffs\" rather than raise prices, President Donald Trump said in a recent Truth Social post.CEO Doug McMillon warned on the company's earnings call that profits could fall this year depending on the direction of trade policy.McMillon said \"the reality of narrow retail margins\" makes the tariffs, even at reduced levels, difficult to absorb. Walmart (WMT) shares slumped in early trading Monday after President Donald Trump said the retailer should absorb the cost of tariffs rather than pass it on to customers by raising prices. “Walmart should STOP trying to blame Tariffs as the reason for raising prices throughout the chain,” Trump said in a Saturday message on Truth Social. “Walmart made BILLIONS OF DOLLARS last year, far more than expected. Between Walmart and China they should, as is said, ‘EAT THE TARIFFS,’ and not charge valued customers ANYTHING. I’ll be watching, and so will your customers!!!” Shares of Walmart slid about 2% before the opening bell. The stock is up about 9% in 2025. Trump’s post came in response to Walmart CEO Doug McMillon warning that profits could fall this year depending on the direction of trade policy. “Given the magnitude of the tariffs, even at the reduced levels announced this week, we aren't able to absorb all the pressure given the reality of narrow retail margins,” McMillon said during the company’s earnings call Thursday, a transcript of which was made available by AlphaSense. McMillon credited President Trump and Treasury Secretary Scott Bessent for “progress” on lowering tariffs after the U.S. and China agreed to roll back import taxes for a period of 90 days. “We will do our best to keep our prices as low as possible,” the CEO added. Do you have a news tip for Investopedia reporters? Please email us at tips@investopedia.com",
    "url": "https://www.investopedia.com/walmart-stock-ticks-lower-after-trump-says-retailer-should-eat-the-tariffs-11737362",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T14:18:22-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 15:41:41",
    "publisher": "Fast Company",
    "title": "Walmart stock slips after Trump lashes out about tariff-driven price hikes",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-slips-after-trump-lashes-out-about-tariffdriven-20250519.jpg",
    "site": "fastcompany.com",
    "text": "Last week, anticipated price hikes at Walmart attracted headlines across the country after CEO Doug McMillon warned that certain items would become more expensive as a result of President Donald Trump's tariff policies.",
    "url": "https://www.fastcompany.com/91336887/walmart-price-hikes-update-trump-lashes-out-stock-slips",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T15:41:41-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 15:43:09",
    "publisher": "Seeking Alpha",
    "title": "Tariffs, Trump, And Thin Ice: Why I'm Sell-Rated On Walmart",
    "image": "https://images.financialmodelingprep.com/news/tariffs-trump-and-thin-ice-why-im-sellrated-on-20250519.jpg",
    "site": "seekingalpha.com",
    "text": "I'm giving Walmart Inc. a Sell rating for its near-term downside risks from tariff uncertainty and rising costs that'll weigh on margins. Despite strong growth in high-margin segments like Walmart Connect and Walmart+, I see more room for weakness than strength for gross margins. Earnings missed sales estimates and warned of higher prices, and now Walmart is facing pressure to absorb the cost impact.",
    "url": "https://seekingalpha.com/article/4788259-tariffs-trump-and-thin-ice-why-im-sell-rated-on-walmart",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T15:43:09-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 16:04:29",
    "publisher": "Business Insider",
    "title": "Walmart just made it even easier for everyone else to raise prices",
    "image": "https://images.financialmodelingprep.com/news/walmart-just-made-it-even-easier-for-everyone-else-20250519.jpg",
    "site": "businessinsider.com",
    "text": "Walmart's announcement that it will raise prices due to tariffs has other retailers \"delighted.\" The news gives retailers cover to raise their own prices, experts told BI.",
    "url": "https://www.businessinsider.com/walmart-tariff-raise-prices-retail-trump-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T16:04:29-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 16:04:49",
    "publisher": "CNBC Television",
    "title": "Walmart is still a top idea for us as it'll keep the lowest prices, says TD Cowen's Chen",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-still-a-top-idea-for-us-as-20250519.jpg",
    "site": "youtube.com",
    "text": "Oliver Chen, TD Cowen retail analyst, joins 'Closing Bell' to discuss Chen's thoughts on retail earnings, political elements to Walmart's stock, and much more.",
    "url": "https://www.youtube.com/watch?v=pN70CLomBWo",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T16:04:49-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 16:21:10",
    "publisher": "NYTimes",
    "title": "Trump Berates Walmart and Mattel for Warning About Tariff Price Increases",
    "image": "https://images.financialmodelingprep.com/news/trump-berates-walmart-and-mattel-for-warning-about-tariff-20250519.jpg",
    "site": "nytimes.com",
    "text": "The president recently attacked Walmart, saying it should “eat” the costs rather than pass them on to customers.",
    "url": "https://www.nytimes.com/2025/05/19/us/politics/trump-tariffs-walmart-mattel-prices.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T16:21:10-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-19 20:08:53",
    "publisher": "CNBC Television",
    "title": "Cramer is breaking down Trump's 'eat the tariffs' callout of Walmart",
    "image": "https://images.financialmodelingprep.com/news/cramer-is-breaking-down-trumps-eat-the-tariffs-callout-20250519.jpg",
    "site": "youtube.com",
    "text": "‘Mad Money' host Jim Cramer weighs in on Trump vs Walmart and how the stock is holding up amid tariff pressure.",
    "url": "https://www.youtube.com/watch?v=GhjnZPQRGGY",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-19T20:08:53-04:00",
    "date_et": "2025-05-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-20 04:20:00",
    "publisher": "The Motley Fool",
    "title": "Up 97% in 2 years, Is Walmart a No-Brainer Dividend King Stock to Buy Now?",
    "image": "https://images.financialmodelingprep.com/news/up-97-in-2-years-is-walmart-a-nobrainer-20250520.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.20%) stock nearly doubled in the last two years while the S&P 500 (^GSPC 0.09%) gained 43.3%.",
    "url": "https://www.fool.com/investing/2025/05/20/up-big-buy-walmart-dividend-king-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-20T04:20:00-04:00",
    "date_et": "2025-05-20"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-20 12:46:55",
    "publisher": "CNBC",
    "title": "Why Walmart decided to say it would raise prices — and risk Trump's fury",
    "image": "https://images.financialmodelingprep.com/news/why-walmart-decided-to-say-it-would-raise-prices-20250520.jpg",
    "site": "cnbc.com",
    "text": "Walmart's announcement on Thursday that it will hike some prices due to tariffs came at a risk — and led to a critical social media post by President Donald Trump. The big-box retailer's thinner margins, price-sensitive customers and desire to influence policymakers' decisions may have factored into its decision to speak out, according to retail analysts.",
    "url": "https://www.cnbc.com/2025/05/20/walmart-price-increases-trump-tariffs.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-20T12:46:55-04:00",
    "date_et": "2025-05-20"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-20 13:30:05",
    "publisher": "247 Wallst",
    "title": "S&P 500 INDEX (SPX) Live: Markets Pare Losses in Face of Credit Downgrade",
    "image": "https://images.financialmodelingprep.com/news/sp-500-index-spx-live-markets-pare-losses-in-20250520.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Has Ended Jamie Dimon on the Risk of Inflation and Deflation 3:23 pm by Gerelyn Terzo The markets have recouped most of their losses, with the SPX now down a modest 0.03%. JPMorgan CEO Jamie Dimon believes the risks around the threat of both inflation and deflation have yet to surface in stock market values. He said at an event in New York, “We have huge deficits; we have what I consider almost complacent central banks. You all think they can manage all this. I don’t think” they can&#8230;“My own view is people feel pretty good because you haven’t [yet] seen effective tariffs&#8230;The market came down 10%, [it’s] back up 10%; that’s an extraordinary amount of complacency.&#8221; Ray Dalio Comments on US Debt 11:58 am by Gerelyn Terzo Ray Dalio, founder of Bridgewater Associates, reportedly raised a flag that Moody&#8217;s downgrade of the U.S. sovereign credit rating misses a crucial point regarding the vulnerability of U.S. Treasuries. According to Dalio, the credit agency&#8217;s analysis fails to account for the inherent risk of the federal government resorting to money printing to service its massive debt. While Treasury yields rise, the markets remain under pressure, including a 0.17% decline in the SPX ETF. Retail Stocks in Focus 10:57 am by Gerelyn Terzo This week, the market&#8217;s focus pivots to corporate earnings, with reports due from major players like Home Depot (NYSE: HD), Target (NYSE: TGT) and TJX Companies (NYSE: TJX). Notably, TJX stock has already climbed 11% this year so far. Comparable store sales figures will be under close examination amid ongoing high interest rates as well as signs of cooling inflation. This article will be updated throughout the day, so check back often for more daily updates. The markets are narrowing their declines in the face of a U.S. debt downgrade by one of the credit rating agencies. Moody&#8217;s lowered its view of U.S. debt by a single notch to to Aa1, down from the highest possible rating. Moody&#8217;s blamed the persistent budget deficit and high interest rates, a view challenged by President Trump, who affirmed global confidence in the U.S. economy. The credit downgrade adds insult to injury following a week in which the S&amp;P 500 advanced 5%. Atlanta Fed President Raphael Bostic told CNBC he predicts one interest rate cut in 2025 as the economy continues to stave off a recession. The central bank has tipped its hand to a possible two rate cuts this year. Today&#8217;s credit downgrade sent Treasury yields higher, with the 30-year Treasury surpassing the 5% threshold, and weighed heavily on equities. While the SPX ETF is currently down slightly, the three major averages are showing signs of resilience, paring back their earlier losses as the morning progresses. The broader technology sector is currently down 1.4%. The prominent Magnificent Seven stocks are mostly in the red, including a 2.8% decline in Apple (Nasdaq: AAPL) stock amid ongoing regulatory scrutiny of its proposed AI partnership with China&#8217;s Alibaba. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 44.18 (-0.10%) Nasdaq Composite: Down 103.54 (-0.54%) S&amp;P 500: Down 20.36 (-0.34%) Market Movers Walmart (NYSE: WMT) is down 2.3% after announcing potential price increases due to tariffs, a move countered by Treasury Secretary Scott Bessent&#8217;s suggestion that the retailer will &#8220;absorb some of the tariffs.&#8221; Palantir Technologies (Nasdaq: PLTR) has seen a 3.8% decline but remains close to its recent high of $130.18. Novavax (Nasdaq: NVAX) is a significant gainer, soaring 25.9% following regulatory approval for its COVID-19 vaccine. Reddit (NYSE: RDDT) shares are lower by 4.4% on the back of an analyst downgrade. Take-Two Interactive Software (Nasdaq: TTWO) is bucking the trend, climbing 3.7% after a price target increase from Wedbush Securities. The post S&#038;P 500 INDEX (SPX) Live: Markets Pare Losses in Face of Credit Downgrade appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/19/sp-500-index-spx-live-markets-pare-losses-in-face-of-credit-downgrade/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-20T13:30:05-04:00",
    "date_et": "2025-05-20"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-20 17:10:39",
    "publisher": "Investopedia",
    "title": "Walmart Is Raising Prices. What Will Its Competitors Do?",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-raising-prices-what-will-its-competitors-do-20250520.jpg",
    "site": "investopedia.com",
    "text": "Walmart plans to start increasing prices this month. Don't be surprised to see other retailers follow in its footsteps.",
    "url": "https://www.investopedia.com/walmart-is-raising-prices-what-will-its-competitors-do-tariffs-margins-trump-11738732",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-20T17:10:39-04:00",
    "date_et": "2025-05-20"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-20 17:23:59",
    "publisher": "InvestorPlace",
    "title": "Wall Street Has Mispriced This Risk",
    "image": "https://images.financialmodelingprep.com/news/wall-street-has-mispriced-this-risk-20250520.jpg",
    "site": "investorplace.com",
    "text": "Walmart should “eat” tariffs",
    "url": "https://investorplace.com/2025/05/wall-street-has-mispriced-this-risk/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-20T17:23:59-04:00",
    "date_et": "2025-05-20"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 05:30:02",
    "publisher": "Business Insider",
    "title": "4 factors that help explain why Walmart and Home Depot are sending opposite signals on price hikes",
    "image": "https://images.financialmodelingprep.com/news/4-factors-that-help-explain-why-walmart-and-home-20250521.jpg",
    "site": "businessinsider.com",
    "text": "Walmart said last week that it planned to raise prices over tariffs, opening the door for other retailers to follow suit. On Tuesday, Home Depot said it didn't plan to increase prices and would instead rely on other \"levers.",
    "url": "https://www.businessinsider.com/why-walmart-raising-prices-home-depot-not-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T05:30:02-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 06:15:00",
    "publisher": "The Motley Fool",
    "title": "Is Walmart Stock a Buy After Tough Tariff Talk?",
    "image": "https://images.financialmodelingprep.com/news/is-walmart-stock-a-buy-after-tough-tariff-talk-20250521.jpg",
    "site": "fool.com",
    "text": "You wouldn't know it from all the attention on the \"Magnificent Seven\" stocks, but Walmart (WMT -0.32%) has quietly trounced the market in recent years.",
    "url": "https://www.fool.com/investing/2025/05/21/is-walmart-stock-a-buy-after-tough-tariff-talk/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T06:15:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 08:15:00",
    "publisher": "The Motley Fool",
    "title": "Walmart vs. Costco: What's the Better Retail Stock to Buy Right Now?",
    "image": "https://images.financialmodelingprep.com/news/walmart-vs-costco-whats-the-better-retail-stock-to-20250521.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.32%) and Costco Wholesale (COST 0.23%) are two of the biggest names in retail. They are massive businesses that can use their strong positions in the market to command low prices from vendors, allowing them to provide good value for their customers.",
    "url": "https://www.fool.com/investing/2025/05/21/walmart-vs-costco-whats-the-better-retail-stock-to/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T08:15:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 10:30:57",
    "publisher": "247 Wallst",
    "title": "Live Nasdaq Composite: Markets Pull Back on Economic Jitters",
    "image": "https://images.financialmodelingprep.com/news/live-nasdaq-composite-markets-pull-back-on-economic-jitters-20250521.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Has Ended Snowflake Earnings Preview 12:54 pm by Gerelyn Terzo One stock that&#8217;s on the radar of Wall Street analysts is Snowflake (NYSE: SNOW) ahead of the company&#8217;s earnings this week. The cloud-based AI data storage company is largely expected to come through with flying colors. Firms like Jefferies, Goldman Sachs and Evercore ISI are all expecting Snowflake to outperform considering its resilience throughout the tariff era. Jefferies analysts aren&#8217;t wasting any time and have already raised their price target on the stock to $200 per share, reflecting 20.8% upside potential. The markets remain under pressure, including a 0.23% decline in the Nasdaq Composite. S&amp;P 500 Earnings Outlook 11:02 am by Gerelyn Terzo Most of the S&amp;P 500 companies have reported Q1 earnings already, and according to Factset data, the results are largely impressive. Of the companies that have reported already, over three-quarters (78%) of S&amp;P 500 companies have revealed a positive EPS surprise, while more than half (62%) of them have surprised to the upside on revenue. Nevertheless, JPMorgan CEO Jamie Dimon warned that Wall Street earnings estimates on S&amp;P 500 companies have further to fall amid persistent tariff uncertainty. Improved Market Sentiment 9:55 am by Gerelyn Terzo Bank of America published a report revealing that sentiment around the broader stock market has improved, with its equity risk-love indicator flipping from deep panic last month to a neutral reading most recently. If history is any indication, this improvement suggests stocks could soon revisit their record-high levels, despite today&#8217;s lackluster performance. The Nasdaq Composite is currently down 0.48%. This article will be updated throughout the day, so check back often for more daily updates. The markets came out of the gate lower across the board this morning after managing to eke out slight gains yesterday. Yesterday&#8217;s market performance marked the sixth straight day of gains for the S&amp;P 500, while the Nasdaq Composite and Dow Jones Industrial Average also moved higher. After Moody&#8217;s cut the U.S. debt rating by one notch, Deutsche Bank weighed in saying the U.S. economy is &#8220;suffering death by a thousand cuts.&#8221; The Wall Street firm&#8217;s Jim Reid wrote, &#8220;Yesterday felt like we were somewhere along the line of a ‘death by a thousand cuts’ with regards to the U.S. fiscal situation. Hard to know where in that thousand we are but probably much nearer a thousand than at zero even as yesterday saw an initial sell-off reverse as the session went on.&#8221; Tesla (Nasdaq: TSLA) is one of the gainers, rising 3% and helping to offset losses in the Nasdaq Composite and S&amp;P 500. CEO Elon Musk has committed to staying at the helm for the next five years. Dow stock Home Depot (NYSE: HD) has no plans to pass along tariff-related costs to customers, unlike fellow Dow component Walmart&#8217;s (NYSE: WMT), which had earlier plans to do so. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 50.53 (-0.12%) Nasdaq Composite: Down 81.77 (-0.43%) S&amp;P 500: Down 19.17 (-0.33%) Market Movers Quantum stocks have captured the spotlight after D-Wave Quantum (NYSE: QBTS) skyrocketed as much as 20% following the release of its newest quantum computing system. The company&#8217;s Advantage2 system is officially available via the cloud, representing its most powerful quantum offering to date, featuring greater energy and lower noise. Dominion Energy (NYSE: D) is tacking on 3.3% today as it climbs closer to its 52-week high level. Norwegian Cruise Line (NYSE: NCLH) is shaving off 3.2% of its value today. Airbnb (Nasdaq: ABNB) is off 3.1% after being ordered by Spain to remove tens of thousands of short-term rental listings. The post Live Nasdaq Composite: Markets Pull Back on Economic Jitters appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/20/live-nasdaq-composite-markets-pull-back-on-economic-jitters/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T10:30:57-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 10:30:57",
    "publisher": "247 Wallst",
    "title": "S&P 500 (NYSEARCA: SPY) Live: Markets Hold Back on Fiscal Outlook",
    "image": "https://images.financialmodelingprep.com/news/sp-500-nysearca-spy-live-markets-hold-back-on-20250521.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Has Ended SNOW Earnings Expectations 1:45 pm by Gerelyn Terzo As earnings season rolls on, Snowflake (Nasdaq: SNOW) is certainly on the radar of Wall Street analysts, with the cloud-based AI data storage firm set to report results this week. Expectations are largely high, anticipating a strong performance from the company. Analyst firms such as Jefferies, Goldman Sachs, and Evercore ISI are all forecasting an outperformance for Snowflake, citing its demonstrated resilience even amid the recent tariff challenges. Jefferies analysts, in particular, have already taken action, boosting their price target on the stock to $200 per share, indicating a potential 20.8% upside. This sense of bullishness comes as the broader markets remain under pressure, including a 0.24% decline in the SPY ETF. Earnings Roundup 11:35 am by Gerelyn Terzo With the first-quarter earnings season still unfolding, the performance of most S&amp;P 500 companies has proven notably robust. FactSet data illustrates this strength: a significant 78% of reporting S&amp;P 500 firms delivered a positive earnings per share (EPS) surprise, and over half (62%) also exceeded revenue forecasts. Despite these strong results, JPMorgan CEO Jamie Dimon sounded a cautionary note, suggesting that Wall Street&#8217;s current earnings estimates for S&amp;P 500 companies may still need to be adjusted downward amidst ongoing tariff uncertainty. The SPY ETF remains lower by 0.26% as of late morning trading. BofA: Stock Market Sentiment Is Looking Up 10:29 am by Gerelyn Terzo A recent report from Bank of America indicates a notable shift in broader stock market sentiment. The firm&#8217;s equity risk-love indicator has now transitioned from a state of deep panic recorded last month to a neutral reading in its latest assessment. Historically, such an improvement often signals that stocks may soon retest their previous record-high levels. The SPY ETF is currently down a slight 0.30%. This article will be updated throughout the day, so check back often for more daily updates. The markets opened on a subdued note across the board this morning, with all three of the major stock market averages edging lower. If the S&amp;P 500 can turn it around like it did yesterday, it will mark its seventh-straight winning session for the broader market index. The SPY ETF remains lower by a slight 0.30%. After Moody&#8217;s cut the U.S. debt rating by one notch, Deutsche Bank responded with its assessment that the U.S. economy is experiencing a &#8220;death by a thousand cuts.&#8221; But it&#8217;s not as bad as it sounds. Deutsche Bank&#8217;s Jim Reid wrote, “Yesterday felt like we were somewhere along the line of a ‘death by a thousand cuts’ with regards to the U.S. fiscal situation. Hard to know where in that thousand we are but probably much nearer a thousand than at zero even as yesterday saw an initial sell-off reverse as the session went on.” Despite the broader market&#8217;s struggles, Tesla (Nasdaq: TSLA) is an outlier, climbing 3% and offering some counterweight to the losses seen in the Nasdaq Composite and S&amp;P 500. Tesla boss Elon Musk vowed to remain at the helm of the EV maker for the next five years. On the Dow, Home Depot (NYSE: HD) has indicated it won&#8217;t pass tariff-related costs onto consumers, a different approach compared to fellow Dow component Walmart (NYSE: WMT), which had earlier signaled price increases. Here’s a look at the performance as of mid-morning trading: Dow Jones Industrial Average: Down 98.87 (-0.23%) Nasdaq Composite: Down 95.66 (-0.49%) S&amp;P 500: Down 20.48 (-0.33%) Market Movers Quantum computing stocks are capturing attention. D-Wave Quantum (Nasdaq: QBTS) surged as much as 20% this morning after launching its newest quantum computing system. The company&#8217;s Advantage2 system, now accessible via the cloud, represents its most powerful offering yet, boasting enhanced energy efficiency and reduced noise. Dominion Energy (NYSE: D) is adding 3.3% to its value today, nearing its 52-week high. Norwegian Cruise Line (NYSE: NCLH) is shedding 3.2% of its value, and Airbnb (Nasdaq: ABNB) is down 3.1% following an order from Spain to delist tens of thousands of short-term rental properties. The post S&#038;P 500 (NYSEARCA: SPY) Live: Markets Hold Back on Fiscal Outlook appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/20/sp-500-nysearca-spy-live-markets-hold-back-on-fiscal-outlook/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T10:30:57-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 10:30:57",
    "publisher": "247 Wallst",
    "title": "S&P 500 INDEX (SPX) Live: Markets Shun Risk Amid Economic Hurdles",
    "image": "https://images.financialmodelingprep.com/news/sp-500-index-spx-live-markets-shun-risk-amid-20250521.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Has Ended Q1 Earnings Surprises 12:32 pm by Gerelyn Terzo The bulk of S&amp;P 500 companies have now unveiled their Q1 earnings, and the consensus from FactSet data points to a largely impressive showing. Among those that have already reported, more than three-quarters (78%) of S&amp;P 500 companies posted a positive EPS surprise, while close to two-thirds (62%) also beat their revenue projections. This positive trend, however, is tempered by a warning from JPMorgan CEO Jamie Dimon, who cautions that Wall Street&#8217;s earnings estimates on S&amp;P 500 companies have further to decline given persistent tariff uncertainty. The SPX ETF remains lower by 0.42%. Stock Market Outlook: BofA 10:57 am by Gerelyn Terzo According to Bank of America, investor sentiment regarding the wider stock market has seen an uptick. The Wall Street firm&#8217;s equity risk-love indicator, which showed deep panic just last month, has most recently registered a neutral position. Should the pattern persist, this positive change suggests that equities could soon move to challenge their all-time highs. The SPX ETF remains lower by 0.35%. This article will be updated throughout the day, so check back often for more daily updates. Markets began the day on a weaker footing today, largely giving back the slight advances seen yesterday. Yesterday&#8217;s session was notable for extending the S&amp;P 500&#8217;s winning streak to six straight days, with both the Nasdaq Composite and Dow Jones Industrial Average also moving into positive territory. The SPX ETF is lower by 0.35% as of mid-morning trading. Moody&#8217;s downgraded the U.S. debt rating, prompting Deutsche Bank to declare the U.S. economy is experiencing a &#8220;death by a thousand cuts.&#8221; But the outlook also suggests the U.S. economy is at the tail end of that downward spiral. Deutsche Bank’s Jim Reid wrote in a note, “Yesterday felt like we were somewhere along the line of a ‘death by a thousand cuts’ with regards to the U.S. fiscal situation. Hard to know where in that thousand we are but probably much nearer a thousand than at zero even as yesterday saw an initial sell-off reverse as the session went on.” Amidst the overall declines, Tesla (Nasdaq: TSLA) stands out, gaining 3% and helping to cushion the drops in the Nasdaq Composite and S&amp;P 500. Dow component Home Depot (NYSE: HD) has signaled it won&#8217;t be passing on tariff-related expenses to customers, a contrasting strategy to Walmart (NYSE: WMT), another Dow component, which had previously indicated such plans before the White House urged them otherwise. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: Down 58.88 (-0.14%) Nasdaq Composite: Down 59.95 (-0.31%) S&amp;P 500: Down 12.18 (-0.20%) Market Movers The quantum computing sector is making headlines, driven by D-Wave Quantum (Nasdaq: QBTS), which saw its shares jump by up to 20%. This surge follows the release of its latest quantum computing system, the Advantage2, now available through the cloud. The company highlights this as its most potent quantum offering to date, featuring improved energy performance and lower operational noise. Dominion Energy (NYSE: D) is up 3.3% and inching closer to its 52-week high. Norwegian Cruise Line (NYSE: NCLH) is losing 3.2% of its value. Airbnb (Nasdaq: ABNB) is down 3.1% after Spanish authorities mandated the removal of numerous short-term rental listings. The post S&#038;P 500 INDEX (SPX) Live: Markets Shun Risk Amid Economic Hurdles appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/20/sp-500-index-spx-live-markets-shun-risk-amid-economic-hurdles/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T10:30:57-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 11:50:40",
    "publisher": "The Street",
    "title": "More retailers could raise prices after Walmart's tariff warning",
    "image": "https://images.financialmodelingprep.com/news/more-retailers-could-raise-prices-after-walmarts-tariff-warning-20250521.jpg",
    "site": "youtube.com",
    "text": "Experts say Walmart's tariff-driven price increase gives other retailers cover to follow suit. Full Video Transcript Below: SUCHARITA KODALI: I do expect other retailers to follow in Walmart's steps, in large part because once a large global retailer like Walmart is able to come up and say that this is what we are planning on doing and it is inevitable, it almost gives permission for the rest of the retail industry to do the same.",
    "url": "https://www.youtube.com/watch?v=QqRpXNE0D1U",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T11:50:40-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 15:35:38",
    "publisher": "CNBC",
    "title": "Walmart AI details leaked during Microsoft Build conference",
    "image": "https://images.financialmodelingprep.com/news/walmart-ai-details-leaked-during-microsoft-build-conference-20250521.jpg",
    "site": "cnbc.com",
    "text": "Microsoft AI security chief Neta Haiby showed a confidential Teams chat to a room full of people Tuesday night. The plans showed how Walmart is working with Microsoft on rolling out AI tools.",
    "url": "https://www.cnbc.com/2025/05/21/microsoft-ai-walmart.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T15:35:38-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 16:59:00",
    "publisher": "WSJ",
    "title": "Walmart to Cut 1,500 Jobs",
    "image": "https://images.financialmodelingprep.com/news/walmart-to-cut-1500-jobs-20250521.jpg",
    "site": "wsj.com",
    "text": "Walmart is planning layoffs in a restructuring aimed at managing its expenses and speeding up decision-making.",
    "url": "https://www.wsj.com/business/retail/walmart-layoffs-reorganization-2abd46eb",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T16:59:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 17:12:56",
    "publisher": "Reuters",
    "title": "Walmart plans job cuts in restructuring push to lower expenses",
    "image": "https://images.financialmodelingprep.com/news/walmart-plans-job-cuts-in-restructuring-push-to-lower-20250521.jpg",
    "site": "reuters.com",
    "text": "U.S. retail bellwether Walmart is planning to cut about 1,500 jobs as part of a restructuring push to lower expenses and simplify operations, according to a memo seen by Reuters.",
    "url": "https://www.reuters.com/sustainability/walmart-cut-1500-jobs-wall-street-journal-reports-2025-05-21/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T17:12:56-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 18:36:00",
    "publisher": "Market Watch",
    "title": "Along with price hikes, here's how else Walmart might maintain margins while navigating tariffs",
    "image": "https://images.financialmodelingprep.com/news/along-with-price-hikes-heres-how-else-walmart-might-20250521.jpg",
    "site": "marketwatch.com",
    "text": "Walmart Inc. plans to cut around 1,500 jobs, the Wall Street Journal reported on Wednesday, as the big-box chain tries to manage costs and accelerate decision-making amid broader efforts by retailers and consumers to navigate inflation and tariffs.",
    "url": "https://www.marketwatch.com/story/along-with-price-hikes-heres-how-else-walmart-might-maintain-margins-while-navigating-tariffs-707edcac",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T18:36:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 18:50:00",
    "publisher": "The Motley Fool",
    "title": "President Trump Thinks Walmart Can Absorb the Impact of Tariffs. Can It?",
    "image": "https://images.financialmodelingprep.com/news/president-trump-thinks-walmart-can-absorb-the-impact-of-20250521.jpg",
    "site": "fool.com",
    "text": "Tariffs are coming down, and the market is getting excited. Since the U.S. and China announced a tariff deal, the S&P 500 (^GSPC -1.61%) is up 5%, bringing it back into a year-to-date gain.",
    "url": "https://www.fool.com/investing/2025/05/21/president-trump-thinks-walmart-can-absorb-the-impa/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T18:50:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 19:45:10",
    "publisher": "Zacks Investment Research",
    "title": "A Closer Look at Retail Earnings",
    "image": "https://images.financialmodelingprep.com/news/a-closer-look-at-retail-earnings-20250521.jpg",
    "site": "zacks.com",
    "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>",
    "url": "https://www.zacks.com/commentary/2475654/a-closer-look-at-retail-earnings?cid=CS-STOCKNEWSAPI-FT-earnings_outlook-2475654",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T19:45:10-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 19:51:04",
    "publisher": "Zacks Investment Research",
    "title": "A Closer Look at Retail Earnings",
    "image": "https://images.financialmodelingprep.com/news/a-closer-look-at-retail-earnings-20250521.jpg",
    "site": "zacks.com",
    "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>",
    "url": "https://www.zacks.com/commentary/2475653/a-closer-look-at-retail-earnings?cid=CS-STOCKNEWSAPI-FT-earnings_trends-2475653",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T19:51:04-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 22:02:44",
    "publisher": "PYMNTS",
    "title": "Walmart Eliminating Roles on Technology and eCommerce Fulfillment Teams",
    "image": "https://images.financialmodelingprep.com/news/walmart-eliminating-roles-on-technology-and-ecommerce-fulfillment-teams-20250521.jpg",
    "site": "pymnts.com",
    "text": "Walmart plans to cut 1,500 corporate jobs in its technology, eCommerce fulfillment and advertising operations, The Wall Street Journal reported Thursday (May 21), citing unnamed sources. Reached by PYMNTS, a Walmart spokesperson declined to comment on the report.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-eliminating-roles-on-technology-and-ecommerce-fulfillment-teams/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T22:02:44-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-21 23:35:00",
    "publisher": "Seeking Alpha",
    "title": "Walmart Earnings Summary: Tariffs Not As Critical As Long-Term Flywheel Improvements",
    "image": "https://images.financialmodelingprep.com/news/walmart-earnings-summary-tariffs-not-as-critical-as-longterm-20250521.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart reported their fiscal Q1 '26 earnings results last Thursday morning, May 15th, 2025 and while actual EPS beat consensus by 5%. Ecommerce – now approaching 20% of total Walmart revenue – has finally turned profitable, which should definitely help margins over the next few years. Walmart Connect, the advertising business, grew 31% in the US and was up 50% “across markets” per the conference call.",
    "url": "https://seekingalpha.com/article/4789029-walmart-earnings-summary-tariffs-not-as-critical-as-long-term-flywheel-improvements",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-21T23:35:00-04:00",
    "date_et": "2025-05-21"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 04:22:33",
    "publisher": "Business Insider",
    "title": "Walmart says it's cutting roles to 'remove layers and complexity'",
    "image": "https://images.financialmodelingprep.com/news/walmart-says-its-cutting-roles-to-remove-layers-and-20250522.jpg",
    "site": "businessinsider.com",
    "text": "Walmart is laying off staff to \"remove layers and complexity\" in the company. In a memo to staff, executives said roles in the global tech team would be cut.",
    "url": "https://www.businessinsider.com/walmart-cutting-roles-remove-layers-complexity-2025-5",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T04:22:33-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 11:00:39",
    "publisher": "Investopedia",
    "title": "Walmart to Cut Jobs as It Focuses on 'Future of Retail'",
    "image": "https://images.financialmodelingprep.com/news/walmart-to-cut-jobs-as-it-focuses-on-future-20250522.jpg",
    "site": "investopedia.com",
    "text": "Walmart (WMT) is laying off workers as part of a U.S. restructuring the retailing giant said was designed to \"sharpen our focus\" in order to \"accelerate our progress delivering the experiences that will define the future of retail.\"",
    "url": "https://www.investopedia.com/walmart-to-cut-jobs-as-it-focuses-on-future-of-retail-11739925",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T11:00:39-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 11:09:08",
    "publisher": "247 Wallst",
    "title": "How I Plan to Save for My Parents’ Retirement – A Balancing Act of Family Responsibility",
    "image": "https://images.financialmodelingprep.com/news/how-i-plan-to-save-for-my-parents-retirement-20250522.jpg",
    "site": "https://247wallst.com",
    "text": "For many Millennials with parents approaching their late 60s and 70s, it&#8217;s time to start talking retirement planning. Undoubtedly, individuals are under no obligation to help finance their parents&#8217; retirement. But for those who have more than enough (and are perhaps already retired themselves), it can make sense to give them a bit of a boost or step in as a sort of caregiver. In this piece, we&#8217;ll check in on a specific Reddit case involving a Millennial couple who&#8217;s pulling in a respectable combined income of $160,000. With no kids in the equation, they&#8217;re effectively in the DINK (dual income, no kids) camp, with potentially enough financial flexibility to help the parents make up for lost time since they&#8217;re nearing the retirement finish line and coming up well short of an amount that&#8217;d be enough to fund a comfortable retirement. Though things can get tricky when balancing one&#8217;s own priorities with those of the parents, striving for balance can be a good thing. And in this piece, we&#8217;ll go over the Reddit user&#8217;s plan as well as pitfalls they should avoid as they attempt the ultimate balancing act of middle age. Key Points This Reddit user wants to help their parents retire. And they&#8217;re willing to do so at their own expense. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Taking the role of a retirement planner First up, our Reddit user is putting on their retirement planner hat by getting a better sense of their parents&#8217; broader financial situation. Indeed, crunching all the numbers (assets versus liabilities as well as cash inflows and outflows) and listening to wants, concerns, and expectations are all a must before lending a helping hand. After all, it&#8217;s hard to tell where one can improve their financial circumstances without carefully analyzing the balance sheet and cash flows. And though being 100% financially transparent with a child can seem like a stretch, it&#8217;s a necessary step. Otherwise, one would effectively be flying blind, and that&#8217;s never a good idea if one&#8217;s playing catch-up on retirement. Even if our Reddit user is financially literate, I think it still makes sense to bring on board a financial advisor. They can help in areas where our Reddit user can&#8217;t. Perhaps health insurance plans and investment asset allocation are areas where an advisor could bring value to the table. Trimming away at monthly expenses Our Reddit user has had all the right conversations and has decided to give their parents a bit of a financial boost well before a disaster (think a health expense) can happen. Before plowing a big chunk of one&#8217;s paycheck into the parents&#8217; retirement funds, though, I&#8217;d suggest exploring ways to trim away at monthly expenses. For many folks, housing is the loftiest expense. And it may be the one to trim away at first. If the retirement situation really is getting tight, perhaps moving the parents in (a multi-generational household) is a great way to free up extra cash to be invested in an S&amp;P 500 ETF or something of the sort for the retirement fund. If there are more generations under one household, added savings can be had from sharing a vehicle and buying in bulk at the local grocery store (think Costco). All considered, I think such a move is more of a must if our Reddit user is serious about helping their parents make up for lost time. Not compromising on one&#8217;s own retirement is vital. It&#8217;s a noble thing to help out one&#8217;s parents financially, especially if they&#8217;re due to come up short come retirement, even after Social Security and pensions are considered. That said, our Reddit user shouldn&#8217;t risk their own retirement, especially if they&#8217;re behind various milestones already. In any case, with a relatively high income and no kids to worry about, I do see the balance of saving for one&#8217;s own retirement and those of the parents as achievable, provided the right steps are taken to axe out unnecessary costs. In short, this Reddit user seems to be on the right track, but should ensure they&#8217;re not putting their parents above themselves or their partner. The post How I Plan to Save for My Parents&#8217; Retirement – A Balancing Act of Family Responsibility appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/personal-finance/2025/05/21/how-i-plan-to-save-for-my-parents-retirement-a-balancing-act-of-family-responsibility/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T11:09:08-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 11:19:29",
    "publisher": "Reuters",
    "title": "Walmart vs Target: tariffs highlight growing divide in fortunes",
    "image": "https://images.financialmodelingprep.com/news/walmart-vs-target-tariffs-highlight-growing-divide-in-fortunes-20250522.jpg",
    "site": "reuters.com",
    "text": "President Donald Trump's tariffs are widening the gap between market-leader Walmart and Target, the companies' latest quarterly reports show, underscoring missteps at the smaller U.S. retailer amid economic uncertainty.",
    "url": "https://www.reuters.com/business/walmart-vs-target-tariffs-highlight-growing-divide-fortunes-2025-05-22/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T11:19:29-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 11:56:47",
    "publisher": "Yahoo Finance",
    "title": "House passes Trump's 'big beautiful bill,' bitcoin record, Walmart vs Target",
    "image": "https://images.financialmodelingprep.com/news/house-passes-trumps-big-beautiful-bill-bitcoin-record-walmart-20250522.jpg",
    "site": "youtube.com",
    "text": "Morning Brief covers all the stories moving the markets on Thursday, May 22. Among the topics discussed: What happens now that the House has passed President Trump's \"big beautiful bill,\" what is driving bitcoin to a new record high, and how one former retail executive views the battle between Walmart and Target.",
    "url": "https://www.youtube.com/watch?v=qXZpwSF5eXI",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T11:56:47-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 12:37:57",
    "publisher": "Yahoo Finance",
    "title": "Target vs. Walmart: Former Toys R Us CEO weighs in",
    "image": "https://images.financialmodelingprep.com/news/target-vs-walmart-former-toys-r-us-ceo-weighs-20250522.jpg",
    "site": "youtube.com",
    "text": "Target cut its full-year sales outlook, warning tariffs could weigh on results, while Walmart maintained its guidance but flagged potential price hikes. Jerry Storch, CEO of Storch Advisors and former CEO of Toys R Us and Hudson's Bay, joins Morning Brief to explain why Target's strategy is off track and why Walmart is pulling ahead.",
    "url": "https://www.youtube.com/watch?v=2kCSCIRaQRA",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T12:37:57-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 16:06:29",
    "publisher": "New York Post",
    "title": "Walmart to cut about 1,500 corporate jobs",
    "image": "https://images.financialmodelingprep.com/news/walmart-to-cut-about-1500-corporate-jobs-20250522.jpg",
    "site": "nypost.com",
    "text": "Walmart — the nation's largest private employer — is cutting more than 1,000 corporate jobs as the company tries to lower its expenses and streamline decision-making as pressure from tariffs mounts.",
    "url": "https://nypost.com/2025/05/22/business/walmart-to-cut-about-1500-corporate-jobs/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T16:06:29-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 16:40:30",
    "publisher": "247 Wallst",
    "title": "Trader Joe’s Ranks No. 1 in Reputation Survey",
    "image": "https://images.financialmodelingprep.com/news/trader-joes-ranks-no-1-in-reputation-survey-20250522.jpg",
    "site": "https://247wallst.com",
    "text": "Many Americans have not heard of grocery retailer Trader Joe’s. However, it just topped the reputation ranking in the Axios Harris Poll 100 for 2025. Trader Joe’s, founded in 1967, has fewer than 600 locations. (Walmart has 4,600 in the United States, and it ranked 81st.) 24/7 Wall St. Key Points: Grocery retailer Trader Joe’s has topped the reputation ranking in the Axios Harris Poll 100 for 2025. It edged out Microsoft, Toyota, Costco, and others. Take this quiz to see if you’re on track to retire. (sponsored) The study&#8217;s methodology involved three waves of surveys. The first asked consumers to rank the best and worst companies. The second survey determined the 100 companies. The third asked about “contextual” issues, including opinions about brands and topics, including politics. These were in the field from January through mid-May. Following Trader Joe’s on the list were clothing company Patagonia, Microsoft, Toyota, and retail giant Costco. Trader Joe’s rose 12 spots from last year’s list. Trader Joe’s seems to have a cult following. It targets building local communities through grants to nonprofits, along with food and beverage donations, Trader Joe’s is known among its customers for an unusual level of transparency. This has to do with food prices, why some items are discontinued, and why prices differ from location to location. It also rarely sells products that carry another company’s brands Trader Joe’s also has several unique methods used to target customers. Its traditional direct marketing includes newsletters. Content in what it calls The Fearless Flyer is based on anecdotes and stories about products it sells. The theory behind it appears to be that it cements its relationship with shoppers. The company uses podcasts and recipes for similar reasons. Axios Harris Poll 100 produces non-traditional results. Trader Joe’s and Patagonia are niche companies. Microsoft, Toyota, and Costco are among the largest companies that do business in the United States, as well as among America’s most well-known brands. It also lists J.C. Penney, a company that is essentially out of business. Despite the quirks of the list, who would not want to finish first? Ford Stock Price Prediction and Forecast 2025-2030 The post Trader Joe&#8217;s Ranks No. 1 in Reputation Survey appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/companies-and-brands/2025/05/21/trader-joes-ranks-no-1-in-reputation-survey/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T16:40:30-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-22 18:27:26",
    "publisher": "CNBC Television",
    "title": "Final Trade: WMT, GILD, DECK, ROST",
    "image": "https://images.financialmodelingprep.com/news/final-trade-wmt-gild-deck-rost-20250522.jpg",
    "site": "youtube.com",
    "text": "The final trades of the day with CNBC's Melissa Lee and the Fast Money traders.",
    "url": "https://www.youtube.com/watch?v=luxyY9U-dDI",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-22T18:27:26-04:00",
    "date_et": "2025-05-22"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 04:05:00",
    "publisher": "The Motley Fool",
    "title": "Where Will Walmart Stock Be in 5 Years?",
    "image": "https://images.financialmodelingprep.com/news/where-will-walmart-stock-be-in-5-years-20250523.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.47%) stock has traded for more than half a century. It enriched numerous investors as it emerged from its roots in rural Arkansas to become the world's largest retailer, still managing to sell more than e-commerce giant Amazon.",
    "url": "https://www.fool.com/investing/2025/05/23/where-will-walmart-stock-be-in-5-years/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T04:05:00-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 07:16:15",
    "publisher": "Finbold",
    "title": "3 stocks to hold through any market crash",
    "image": "https://images.financialmodelingprep.com/news/3-stocks-to-hold-through-any-market-crash-20250523.jpg",
    "site": "finbold.com",
    "text": "J.P. Morgan research suggests the probability of a U.S. recession in 2025 is dropping below 50% from its 60% peak, now that the Trump administration is pulling punches on some of its more aggressive tariff policies, allowing the S&P 500 to rebound after dipping into correction territory back in March. However, the risk is still high.",
    "url": "https://finbold.com/3-stocks-to-hold-through-any-market-crash/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T07:16:15-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 07:21:14",
    "publisher": "Fast Company",
    "title": "Walmart layoffs: Memo cites rapid technological changes as 1,500 corporate workers lose their jobs",
    "image": "https://images.financialmodelingprep.com/news/walmart-layoffs-memo-cites-rapid-technological-changes-as-1500-20250523.jpg",
    "site": "fastcompany.com",
    "text": "Walmart Inc. is laying off approximately 1,500 employees in the United States in a bid to restructure as it works to keep up with fast-moving technological changes. The job cuts will impact corporate staff at the company's headquarters in Bentonville, Arkansas, and other offices.",
    "url": "https://www.fastcompany.com/91339414/walmart-layoffs-today-corporate-job-loses-technological-change-memo",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T07:21:14-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 08:09:24",
    "publisher": "The Motley Fool",
    "title": "Should Stock Market Investors Buy Walmart Stock?",
    "image": "https://images.financialmodelingprep.com/news/should-stock-market-investors-buy-walmart-stock-20250523.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.47%) has gained significant market share across e-commerce and grocery in recent years.",
    "url": "https://www.fool.com/investing/2025/05/23/should-stock-market-investors-buy-walmart-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T08:09:24-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 08:15:00",
    "publisher": "Seeking Alpha",
    "title": "Avoid These Dividend Disasters Before It's Too Late",
    "image": "https://images.financialmodelingprep.com/news/avoid-these-dividend-disasters-before-its-too-late-20250523.jpg",
    "site": "seekingalpha.com",
    "text": "Dividend stocks are facing many big risks. The high interest rates, trade war, and AI revolution could lead to many dividend cuts. I discuss what this all means for dividend investors.",
    "url": "https://seekingalpha.com/article/4788550-avoid-these-dividend-disasters-before-too-late",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T08:15:00-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 09:31:28",
    "publisher": "Patch",
    "title": "Missing Crest Hill Woman Wendy Gessing's Son Arrested Once Again",
    "image": "https://images.financialmodelingprep.com/news/missing-crest-hill-woman-wendy-gessings-son-arrested-once-20250523.png",
    "site": "https://www.patch.com",
    "text": "JOLIET, IL — June 12 will mark the four-year anniversary since 50-year-old Wendy Gessing, who worked at the Crest Hill Pizzas By Marchelloni, vanished during her Saturday night work shift at the pizza parlor on Theodore Street and Raynor Avenue. She has never been seen alive since her disapperance. This week, in an unrelated investigation, Joliet police arrested her 28-year-old son, Joshua \"Josh\" Gessing, who now lives in Wilmington, according to the arrest report. Josh Gessing continues to have run-ins with Joliet police and area law enforcement in recent years. He was jailed by Joliet police for four days in 2023 in connection with driving under the influence charges. According to Joliet police spokesman Dwayne English, the 28-year-old Gessing was captured on Tuesday and put into the Will County Jail for having an outstanding Will County arrest warrant. On Tuesday, at 12:45 p.m., Joliet's officers responded to the Walmart at 2424 W. Jefferson St. regarding a retail theft investigation. Upon arrival, the officers learned that the Walmart staff had initially detained a man as part of a retail theft investigation, but determined no charges would be pursued. Officers identified the man as Gessing and determined he held an active Will County arrest warrant for possession of controlled substances, according to English. Gessing was placed into custody without incident, English noted. Will County Jail indicate the Gessing was released from the jail on Wednesday afternoon. Back in October 2021, Gessing was the subject of a Joliet Patch crime story headlined, \"Criminal Charges Dropped Against Crest Hill's Joshua Gessing.\" At that time, he was 25 years old. Patch reported that Josh Gessing spent four days in the Will County jail in connection with allegations he attacked a 44-year-old male relative late on a Friday night at a house on Joliet's west side. Joliet police officers arrested Josh Gessing on charges of aggravated domestic battery causing great bodily harm. During a short phone interview at that time, Josh Gessing told Joliet Patch he was the victim of a wrongful arrest by the Joliet Police Department. \"It was a wrongful arrest,\" he said. \"I was the victim, and he was the aggressor.\"",
    "url": "https://www.patch.com/illinois/joliet/missing-crest-hill-woman-wendy-gessings-son-arrested-once-again",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T09:31:28-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 10:00:52",
    "publisher": "247 Wallst",
    "title": "PayPal (NASDAQ: PYPL) Price Prediction and Forecast 2025-2030 (May 2025)",
    "image": "https://images.financialmodelingprep.com/news/paypal-nasdaq-pypl-price-prediction-and-forecast-20252030-may-20250523.jpg",
    "site": "https://247wallst.com",
    "text": "Shares of PayPal Holdings, Inc. (NASDAQ: PYPL) gained 16.64% over the past month, joining in the broad market&#8217;s rally that has been propelled by the announcement of a 90-day tariff pause between the U.S. and China. However, the stock is still struggling longer-term, with a year-to-date loss of 16.85% and a nearly 22% loss since hitting its one-year high on Jan. 17, 2025. Long before there was Venmo and Cash App, there was PayPal. The pioneer of online payments was founded in 1998 in San Jose, Calf. Four years later, it went public and was then acquired by eBay, Inc. (NASDAQ: EBAY) later in 2022. But in 2015, eBay spun the company off to its shareholders, and PayPal has been an independent company ever since. Since then, the company&#8217;s online payments services have exploded in popularity, with its market cap peaking at $356.75 billion in July 2021. That coincided with the stock reaching its all-time high of $308.53. However, the company has endured some growing pains since then, which have resulted in its market cap being reduced to the current $60.96 billion and shares having fallen more than -80% from their all-time high in July 2021. But for prospective investors looking for growth opportunity, PayPal sits in the midst of an industry undergoing explosive growth. According to Grand View Research, the global fintech service market is forecast to grow at a compound annual growth rate (CAGR) of 17.5% from 2023 to 2030. This expected industry growth bodes very well for shareholders. And despite the stock being down significantly from its all-time high, PayPal has gained 43.68% in 2024, outpacing the S&amp;P 500 over the same period. 24/7 Wall Street has performed an analysis that suggests there is still a big-time upside potential for the fintech company before the end of the decade. Here is where prospective investors and current shareholders might expect from PayPal over the course of the next five years. Key Points in This Article: Globally, the fintech service market is expected to grow at a CAGR of 17.5% from 2023 to 2030, and in the U.S. alone, that growth is forecast for 16.6% over the same time. PayPal isn&#8217;t simply processing payments between friends or businesses, but participating in a major shift that involves &#8220;fintech solution providers that consistently introduce novel technologies like AI, blockchain and data analytics, with the potential to reshape financial services and streamline operational effectiveness,&#8221; according to Grand View Research. Online payments is a segment seeing exponential growth, and that has translated into a series of successive earnings beats for PayPal, which are likely to continue as the company gains more market share. Payment service providers, or PSPs, are now being tasked with with expanded service demands, like fraud mitigation, improving collection processes and reconsidering markets where profitable growth may be possible but has previously exceeded most institutions’ risk appetite, such as the gaming industry, according to consultancy firm McKinsey &amp; Co. If you’re looking for a megatrend with massive potential, make sure to grab a complimentary copy of our “The Next NVIDIA” report. This report breaks down AI stocks with 10x potential and will give you a huge leg up on profiting from this massive sea change. PayPal&#8217;s Recent Stock Success Since officially being spun off from eBay on July 10, 2015, shares of PayPal enjoyed an incredible run before hitting their all-time high in July 2021, gaining over 789%. That surge was largely fueled from the arrival of COVID-19, which saw a dramatic shift to online buying. From its pandemic low on $86.68 on March 20, 2020, the stock rewarded shareholders with gains of 256% over the subsequent six quarters. However, the end of the pandemic coupled with increased competition began to erode the company&#8217;s market share since, which has forced PayPal to begin diversifying its business segments in order to expand customer services and differentiate itself from newcomers like Stripe, Amazon Pay, Apple Pay and Square. Year Share Price Revenue* Net Income* 2015 $36.20 $9.192 $1.551 2016 $39.47 $10.839 $1.816 2017 $73.62 $12.983 $2.281 2018 $83.26 $15.460 $2.883 2019 $109.40 $17.750 $3.654 2020 $234.20 $21.418 $4.519 2021 $188.58 $25.349 $5.466 2022 $71.22 $27.500 $4.722 2023 $61.41 $29.614 $5.521 *Revenue and net income in $billions Since 2015 when PayPal was again a publicly traded company, its total annual revenue grew by more than 222% through 2023. However, the two aforementioned headwinds beginning in 2021 — increased competition and the end of the pandemic — saw its share price careen despite steadily increased revenue and consistent net income. At the same time, PayPal became mired in debt repayment, which jumped from $361 million in 2021 to $1.05 billion in 2023. Nonetheless, as the Silicon Valley fixture looks towards the second half of the decade, 24/7 Wall Street has identified three key drivers that are likely to positively impact PayPal’s growth metrics and stock performance through 2030. Key Drivers of PayPal&#8217;s Stock Performance 1. Demand for Digital Payments Is Exploding. Data from Statista indicates that digital payments from PSPs has exploded from $6.25 trillion in 2017 to $15.46 trillion in 2023 — a 147% increase. That figure is forecast to reach $36.75 trillion in 2029, $23.50 trillion of which will be made in mobile payments alone. PayPal&#8217;s seamless integration, which is used in 200 countries and regions and with 25 different currencies, is likely to face increased demand as merchants who rely on it look to capitalize on rapid customer onboarding and user-friendliness, both of which are expected to drive the digital payments market in the near and medium terms. The company is already well-positioned, with its digital financial network accounting for 220 million active customers each month, making it one of the world’s largest PSP in the world. 2. Strong Earnings and Revenue Has Continued. Despite the stock&#8217;s slide since midway 2021, PayPal has time and again posted strong quarterly earnings and revenue. Since the fourth quarter of 2020, the company has beat on earnings 16 out of 19 quarters. It is a similar story for reported quarterly revenue over that period. That has left the company with a healthy cash position, with free cash flow exploding in growth from $3.37 billion in 2019 to a current trailing 12-month (TTM) position of $6.71 billion. That is good for an increase of more than 99% in five years. 3. PayPal Credit and Buy Now, Pay Later Is Expanding the Company&#8217;s Breadth. Beyond being a PSP, PayPal has branched out to other business sectors that are likely to bolster revenue as they experience similar CAGRs: credit and buy now, pay later. These services are already offered at major retailers and online merchants, like Walmart Inc. (NYSE: WMT), Home Depot, Inc. (NYSE: HD), Temu and eBay, for example. The site provides consumers with a line of revolving credit through Synchrony Financial (NYSE: SYF). In 2023, of PayPal&#8217;s nearly $30 billion in revenue, $27 billion came from transaction revenues, with PSP transactions representing more than 90% of the company&#8217;s total revenue. Meanwhile, revenues from its other business segments — including interest and fees through its credit offerings — were over $2.91 billion, which represented roughly 9% of the company&#8217;s revenue. However, Grand View Research projects the buy now, pay later industry to undergo CAGR of 24.3% from 2023 to 2030, meaning this business segment for PayPal could see its revenue growth outpace the company&#8217;s traditional PSP offerings by the end of this decade. PayPal (PYPL) Stock Prediction in 2025 The current median one-year price target for PayPal is $82.48, representing upside potential of 15.13% over the next 12 months from its current share price. Of the 33 analysts covering PayPal, the stock receives a consensus rating of &#8220;Moderate Buy,&#8221; with 15 analysts assigning it a &#8220;Buy&#8221; rating, 16 assigning it a &#8220;Hold&#8221; rating and two assigning it a &#8220;Sell&#8221; rating. By the end of 2025, 24/7 Wall St.&#8216;s forecast for shares of PYPL is $81.15, good for 13.27% upside potential based on an annualized EPS estimate of $4.93 and a price-to-earnings (P/E) ratio estimate of 16. PayPal (PYPL) Stock Forecast 2025–2030 Year Revenue* EPS 2025 $33.663 $4.93 2026 $36.048 $5.44 2027 $39.631 $6.96 2028 $42.668 $7.37 2029 $48.195 $8.09 2030 $52.076 $9.59 *Revenue in $billions PayPal&#8217;s (PYPL) Price Target for 2025–2030 By the conclusion of 2030, 24/7 Wall Street estimates PayPal&#8217;s stock to be trading for $134.26 per share, representing a 73.80% increase from its current price, based on revenue of $52.076 billion and an annualized EPS of $9.59. Year Price Target %Change From Current Price 2025 $81.15 13.27% 2026 $89.76 25.29% 2027 $102.37 42.89% 2028 $110.88 54.77% 2029 $132.16 84.47% 2030 $141.00 96.81% The post PayPal (NASDAQ: PYPL) Price Prediction and Forecast 2025-2030 (May 2025) appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/forecasts/2025/05/22/paypal-pypl-price-prediction-and-forecast-2025-2030/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T10:00:52-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-23 13:22:24",
    "publisher": "PYMNTS",
    "title": "Walmart Expands Network of Automated, Centralized Prescription Fulfillment Facilities",
    "image": "https://images.financialmodelingprep.com/news/walmart-expands-network-of-automated-centralized-prescription-fulfillment-facilities-20250523.jpg",
    "site": "pymnts.com",
    "text": "Walmart said Thursday (May 22) that it opened its largest centralized prescription fulfillment facility and plans to add two more. The new Central Fill pharmacy location is in Frederick, Maryland, and two other facilities are expected to open in 2026 in Phoenix, Arizona, and Republic, Missouri, the company said in a Thursday press release.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-expands-network-of-automated-centralized-prescription-fulfillment-facilities/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-23T13:22:24-04:00",
    "date_et": "2025-05-23"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-24 08:07:41",
    "publisher": "24/7 Wall Street",
    "title": "Walmart Sounds the Alarm: Tariffs Will Hit American Consumers Hard",
    "image": "https://images.financialmodelingprep.com/news/walmart-sounds-the-alarm-tariffs-will-hit-american-consumers-20250524.jpg",
    "site": "247wallst.com",
    "text": "[00:00:04] Doug McIntyre: So, you had a funny rumor last week.",
    "url": "https://247wallst.com/investing/2025/05/24/walmart-sounds-the-alarm-tariffs-will-hit-american-consumers-hard/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-24T08:07:41-04:00",
    "date_et": "2025-05-24"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-24 11:12:17",
    "publisher": "The Motley Fool",
    "title": "What's Going On With Walmart Stock?",
    "image": "https://images.financialmodelingprep.com/news/whats-going-on-with-walmart-stock-20250524.jpg",
    "site": "fool.com",
    "text": "Because of its massive size, Walmart's (WMT 0.62%) results are essential for every stock market investor to evaluate.",
    "url": "https://www.fool.com/investing/2025/05/24/whats-going-on-with-walmart-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-24T11:12:17-04:00",
    "date_et": "2025-05-24"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-24 11:27:00",
    "publisher": "The Motley Fool",
    "title": "Here's Why Walmart Continues to Crush the S&P 500 (and if the Dividend Stock Is a Buy Now)",
    "image": "https://images.financialmodelingprep.com/news/heres-why-walmart-continues-to-crush-the-sp-500-20250524.jpg",
    "site": "fool.com",
    "text": "Last year, Walmart (WMT 0.62%) soared 71.9%, making it one of the best performers in the S&P 500 and the second-best performing component in the Dow Jones Industrial Average (behind only Nvidia).",
    "url": "https://www.fool.com/investing/2025/05/24/heres-why-walmart-continues-to-crush-the-sp-500-an/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-24T11:27:00-04:00",
    "date_et": "2025-05-24"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-25 05:15:00",
    "publisher": "The Motley Fool",
    "title": "The Most Urgent Challenge for Walmart Stock Investors!",
    "image": "https://images.financialmodelingprep.com/news/the-most-urgent-challenge-for-walmart-stock-investors-20250525.jpg",
    "site": "fool.com",
    "text": "Tariffs and their broad implications are the most difficult challenge for Walmart (WMT 0.62%).",
    "url": "https://www.fool.com/investing/2025/05/25/the-most-urgent-challenge-for-walmart-stock-invest/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-25T05:15:00-04:00",
    "date_et": "2025-05-25"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-25 06:02:00",
    "publisher": "The Motley Fool",
    "title": "Best Dividend Stock to Buy? Walmart Stock vs.",
    "image": "https://images.financialmodelingprep.com/news/best-dividend-stock-to-buy-walmart-stock-vs-20250525.jpg",
    "site": "fool.com",
    "text": "For decades, Walmart (WMT 0.62%) and Target (TGT -0.79%) have offered steadily increasing dividend payments to investors in dividend stock.",
    "url": "https://www.fool.com/investing/2025/05/25/best-dividend-stock-to-buy-walmart-stock-vs-target/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-25T06:02:00-04:00",
    "date_et": "2025-05-25"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-25 06:02:08",
    "publisher": "247 Wallst",
    "title": "If You Invested $15,000 In Vanguard’s VIG 5 Years Ago, This Is How Much Cash From Dividends You Would Have Today",
    "image": "https://images.financialmodelingprep.com/news/if-you-invested-15000-in-vanguards-vig-5-years-20250525.jpg",
    "site": "https://247wallst.com",
    "text": "Risk tolerance is a very subjective topic. It is a necessary qualifying component of the KYC (Know Your Customer) protocols for financial professionals, and is implemented to establish levels of investment risk that a new customer is comfortable taking. While the ideal investment delivers big capital appreciation and AAA principal safety, the maxim “no guts no glory” applies also to investing, where the largest returns are generally the ones that are the riskiest ventures. Exchange Traded Funds (ETF) are a popular vehicle for diversified investments, as they can be bought and sold online with ease and are usually subject to lower fees than mutual funds. ETFs come in a wide range of configurations, and are generally passively managed and designed to mimic the performance of designated market indexes. Key Points Dividend growth, in the majority of cases, is a stock indicator of a company’s business success, since dividend growth usually is commensurate with profit growth. The Vanguard Dividend Appreciation Index Fund ETF is a popular ETF platform for investors to avail themselves of blue chip companies with a steady track record for both dividend increases and price appreciation growth. Deployment of a dividend reinvestment protocol can substantially boost overall ROI for investments in an ETF such as Vanguard Dividend Appreciation Index Fund ETF. Calculating retirement objectives and risks can be intimidating. Are you ahead or behind on your retirement plans? SmartAsset’s free tool can match you with a trained financial advisor in minutes to help you answer your questions today. Each advisor has been carefully vetted to analyze your needs and advise actions to best achieve your portfolio goals with your best interests in mind. Don’t waste another minute – get started by clicking here.(Sponsor) For those investors who have found the S&amp;P 500 Index too volatile for their liking, there is another index that offers steady growth, albeit at a slower pace, combined with a strong income component and lower volatility. The S&amp;P U.S. Dividend Growers Index is one such benchmark. Containing Dividend Kings (50 or more consecutive years of increased dividends) and Dividend Aristocrats (25 or more years in a row of increased dividends), this index contains Fortune 500 companies whose businesses are historically profitable enough that they can afford to continue higher dividend payouts year after year. The Vanguard Dividend Appreciation Index Fund ETF (NYSE: VIG) is a popular ETF with a portfolio reflecting this exact index. Founded in 2006, the Vanguard Dividend Appreciation Index Fund ETF strives for a mix of capital appreciation and income from dividend growth companies, i.e. those with a history of dividend increases accompanying growth. Its yield is 1.87% and it has a 0.05% expense ratio. The dividend increases have to be consistent for a minimum of 10 years to warrant inclusion. Surprisingly, the top 25% companies with the highest yields are excluded from the 330+ stocks on the VIG roster. VIG has a Morningstar gold ETF ranking. It had $101.79 billion assets under management (AUM) as of the time of this writing. A look at VIG’s top 10 holdings shows how its criteria differ from S&amp;P 500 Index ETFs, which are usually led by Magnificent 7 stocks, based on market cap size: Broadcom Microsoft Apple Eli Lilly JP Morgan Chase Visa, Inc. Exxon Mobil MasterCard Costco Wholesale Walmart The VIG Dividend Difference As the calculator demonstrates, a $15,000 investment in VIG back in January, 2020 would be worth $25,833.91 today, at the time of this writing, which equates to a 72.23% ROI. The total return would be $10,833.91. The annualized return equates to 10.62%. This calculation also includes compounding through reinvested dividends. The reinvested dividend value is $2,425.58. The actual cash dividends paid out from the initial 119.67 shares equates to $1,849.45. If the dividends are not reinvested, the total return would be $8,408.33. Therefore, reinvesting the dividends enabled an additional return differential of $2,425.58 over the 5 year span. The Dividend Reinvestment Advantage For Safer Returns Dividend stocks with annual payout growth can boost capital appreciation through compounding, or provide extra income in the case of emergencies. As the charts demonstrate, reinvesting dividends contributed a 22% boost to ROI, while overall capital appreciation growth still averaged over 10% annually. Dividend Reinvestment Programs (DRIP) can automatically implement purchases of additional shares without additional fees or order entries, if one is so inclined. In the case of an ETF such as VIG, investors with weaker stomachs for volatility can sleep more easily, knowing that their portfolios are still growing albeit without the roller coaster ride delivered by Nvidia, for example. Another plus to VIG is that since it contains both current and potential future Dividend King and Dividend Aristocrat stocks, the dividend amounts will continue to grow with each passing year. This will, in turn, increase the amount of additional shares that can be obtained under a DRIP agreement. This is a classic compounding model for health building that can work for the benefit of many investors. On the contingency side, the investor can always cancel the DRIP agreement if there is an emergency need for the dividend income pending, since it can always be renewed at a later date after the crisis has passed. The post If You Invested $15,000 In Vanguard&#8217;s VIG 5 Years Ago, This Is How Much Cash From Dividends You Would Have Today appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/23/if-you-invested-15000-in-vanguards-vig-5-years-ago-this-is-how-much-cash-from-dividends-you-would-have-today/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-25T06:02:08-04:00",
    "date_et": "2025-05-25"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-26 04:30:00",
    "publisher": "The Motley Fool",
    "title": "Better Buy: Walmart vs. Target Stock",
    "image": "https://images.financialmodelingprep.com/news/better-buy-walmart-vs-target-stock-20250526.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT 0.62%) and Target (TGT -0.79%) both survived the retail apocalypse that wiped out many brick-and-mortar retailers over the past 15 years. Both of these superstore chains kept growing by staying away from dying malls, renovating their stores, expanding their e-commerce marketplaces, and using their brick-and-mortar stores to fulfill online orders.",
    "url": "https://www.fool.com/investing/2025/05/26/better-buy-walmart-vs-target-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-26T04:30:00-04:00",
    "date_et": "2025-05-26"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-26 10:05:53",
    "publisher": "The Motley Fool",
    "title": "Huge News for Walmart Stock Investors",
    "image": "https://images.financialmodelingprep.com/news/huge-news-for-walmart-stock-investors-20250526.jpg",
    "site": "fool.com",
    "text": "Walmart's (WMT 0.62%) management team delivered insights that investors will not want to miss.",
    "url": "https://www.fool.com/investing/2025/05/26/huge-news-for-walmart-stock-investors/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-26T10:05:53-04:00",
    "date_et": "2025-05-26"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-26 11:34:36",
    "publisher": "Proactive Investors",
    "title": "Walmart, Amazon draw criticism from Trump over tariff response",
    "image": "https://images.financialmodelingprep.com/news/walmart-amazon-draw-criticism-from-trump-over-tariff-response-20250526.jpg",
    "site": "proactiveinvestors.com",
    "text": "Walmart Inc (NYSE:WMT, ETR:WMT) and Amazon.com Inc (NASDAQ:AMZN) are facing criticism from the White House over their responses to new global tariffs, with President Donald Trump accusing large retailers of using the tariffs as an excuse to raise prices. Critics of Trump's trade strategy argue the situation is self-inflicted, stemming from policies his administration implemented, according to a Globe and Mail report on Monday.",
    "url": "https://www.proactiveinvestors.com/companies/news/1071856",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-26T11:34:36-04:00",
    "date_et": "2025-05-26"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-26 12:51:07",
    "publisher": "Zacks Investment Research",
    "title": "Walmart vs. Target: Which Retail Giant is Poised to Outperform?",
    "image": "https://images.financialmodelingprep.com/news/walmart-vs-target-which-retail-giant-is-poised-to-20250526.jpg",
    "site": "zacks.com",
    "text": "Walmart gains ground with rising ad and membership revenues, while Target faces sales decline and margin pressure amid weak discretionary demand.",
    "url": "https://www.zacks.com/stock/news/2477326/walmart-vs-target-which-retail-giant-is-poised-to-outperform?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2477326",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-26T12:51:07-04:00",
    "date_et": "2025-05-26"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-27 08:17:00",
    "publisher": "The Motley Fool",
    "title": "\"If Walmart Is Under Pressure to Raise Prices, It's Going to Have Broader Effects on the Economy.\"",
    "image": "https://images.financialmodelingprep.com/news/if-walmart-is-under-pressure-to-raise-prices-its-20250527.jpg",
    "site": "fool.com",
    "text": "In this podcast, Motley Fool analyst Tim Beyers and host Ricky Mulvey discuss:",
    "url": "https://www.fool.com/investing/2025/05/27/if-walmart-is-under-pressure-to-raise-prices-its-g/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-27T08:17:00-04:00",
    "date_et": "2025-05-27"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-27 12:58:36",
    "publisher": "CNBC",
    "title": "Walmart fined for shipping realistic toy guns to New York, violating state law",
    "image": "https://images.financialmodelingprep.com/news/walmart-fined-for-shipping-realistic-toy-guns-to-new-20250527.jpg",
    "site": "cnbc.com",
    "text": "Walmart agreed to pay a small fine and promised to ensure its third-party resellers are unable to sell imitation toy guns to buyers in New York. New York Attorney General Letitia James said that the retail giant's online store shipped at least nine such toys to the state.",
    "url": "https://www.cnbc.com/2025/05/27/walmart-fined-shipping-toy-guns-new-york.html",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-27T12:58:36-04:00",
    "date_et": "2025-05-27"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-27 13:33:00",
    "publisher": "The Motley Fool",
    "title": "Walmart's Warning; Money Tips for 2025 Grads",
    "image": "https://images.financialmodelingprep.com/news/walmarts-warning-money-tips-for-2025-grads-20250527.jpg",
    "site": "fool.com",
    "text": "In this podcast, Motley Fool analysts David Meier and Andy Cross join host Dylan Lewis to discuss:",
    "url": "https://www.fool.com/investing/2025/05/27/walmarts-warning-money-tips-for-2025-grads/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-27T13:33:00-04:00",
    "date_et": "2025-05-27"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-27 16:06:24",
    "publisher": "247 Wallst",
    "title": "I have invested in dividends for 10 years—These are the blue-chip dividend payers I swear by",
    "image": "https://images.financialmodelingprep.com/news/i-have-invested-in-dividends-for-10-yearsthese-are-20250527.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points I swear by these three blue-chip dividend kings that have generated regular income for me. These are rock-solid businesses with the ability to increase their dividends in the future. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) I started my investment journey at a young age and my secret to investing is to buy blue-chip dividend stocks. All I wanted was steady passive income and I built a portfolio of some of the Dividend Aristocrats that never let me down. No matter where you are in your investment journey, if your goal is to make money through investments, pick dividend companies. Choose companies that have a history of rewarding shareholders and you will always have income flowing into your bank account. I’ve invested in these three dividend stocks for a decade and I’ve managed to build a resilient portfolio through dividend reinvestment. Coca-Cola A blue-chip dividend stock, Coca-Cola is a globally recognized brand. Over 100 years old, the company has expanded its offerings keeping the changing consumer preferences in mind. It owns some of the most famous brands including Coke, Minute Maid, Sprite, and Fanta. The company has a long-term growth strategy driven by successful marketing, innovation, and brand strength. In the first quarter, it reported a 6% rise in organic revenue and a 5% jump in price/mix. Coca-Cola has the pricing power to remain resilient even in times of geopolitical uncertainty. Exchanging hands for $71, KO stock is up 14% year-to-date and 11% in six months. The stock’s current dividend yield is 2.87% and it has increased dividends for 63 consecutive years which speaks a lot about the management. It has an annual dividend growth rate of 5.36% and a five-year growth rate of 4.07%. Coca-Cola’s 10-year dividend growth rate is 4.67%. When I bought the stock a decade ago, its annual dividend yield was 4.12% which remained steady until 2019. Since 2019, it has remained below 4% while the annual payout has steadily increased. The annual payout amount is currently the highest in the decade at $1.94 and the annual year-over-year payout growth is 5.43% Coca-Cola has a history of delivering steady gains despite market ups and downs. The company has remained resilient in times of a pandemic, and geopolitical tensions which makes it my top choice. Walmart Inc. When I invested in Walmart in 2015, it was the most convenient way to shop. With over 4,600 locations in the U.S., I could always find a Walmart near me. Founded 8 decades ago, the company is one of the largest retailers in terms of revenue. A blue-chip stock, Walmart has never disappointed. Despite the growing popularity of e-commerce, Walmart has retained its top spot. The company has paid a regular quarterly dividend for 51 years and it has a payout ratio of 51.04% which shows that the company is reinvesting the remaining of its earnings in the business. This also means there is a potential for a higher dividend in the coming years. Walmart’s dividend yield is 0.98% and its five-year dividend growth rate is 4.41%. Its 4-year average dividend yield is 1.39%. WMT stock’s 10-year dividend growth rate is 3.26% which is lower than the sector median of 5.93% but I like the stability Walmart brings to my investment portfolio. The Dividend King boosted the dividend by 13% recently. Exchanging hands for $95, the stock is up 6.5% year to date and 47% in the year. In the first quarter, it saw a 4.5% year-over-year jump in same-store sales, and advertising sales were up 50%. Walmart is investing in e-commerce and advertising which has helped with revenue growth. Truist Securities analyst has a price target of $111 per share and a buy rating. The business is stronger than ever and I’d hold on to the stock for at least another five years. Chevron Corporation I’ve always believed that the oil and gas sector is one of the most prominent sectors of the economy. There will never be a time when the world will not need oil and this means Chevron Corporation will never run out of business. Yes, the energy industry is volatile and the changing crude oil prices impact the stock but Chevron has managed to remain steady amid the volatility. A dividend stock, the company has increased dividends for 38 consecutive years. It has an attractive dividend yield of 4.8%, higher than the industry average of 3.6%. The company has a dividend payout ratio of 70.97% showing the management’s commitment towards rewarding shareholders. The quarterly dividends have gone from $1.07 in 2015 to $1.71 in 2025. Its 10-year dividend growth rate is 4.55% while the 3-year dividend growth rate is 6.56%. Chevron stock has never disappointed. It is up 49% in 5 years but the current market volatility and the drop in crude oil prices have impacted the stock which has lost 7.78% value year-to-date. Trading for $135, the stock is very close to the 52-week low of $132 and I consider this a solid chance to buy. Crude oil prices will rise and there will always be oil demand. Chevron has several assets that will keep generating revenue, one of the most prominent ones in the Permian basin. It is a rock-solid business with an attractive balance sheet and a steady dividend payout. The post I have invested in dividends for 10 years—These are the blue-chip dividend payers I swear by appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/26/i-have-invested-in-dividends-for-10-years-these-are-the-blue-chip-dividend-payers-i-swear-by/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-27T16:06:24-04:00",
    "date_et": "2025-05-27"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 07:05:04",
    "publisher": "Forbes",
    "title": "Fear Walmart At $96?",
    "image": "https://images.financialmodelingprep.com/news/fear-walmart-at-96-20250528.jpg",
    "site": "forbes.com",
    "text": "Walmart (NYSE: WMT) proved to be a powerhouse last year, surging 75% and securing a prominent position in the S&P 500, coming in second only to Nvidia (NASDAQ:NVDA) in the Dow. And the momentum isn't slowing down: the stock has added another 7% in 2025, even as the overall market falters.",
    "url": "https://www.forbes.com/sites/greatspeculations/2025/05/28/fear-walmart-at-96/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T07:05:04-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 09:30:00",
    "publisher": "Business Wire",
    "title": "GLIDDEN Brand Refreshes Walmart Paint Aisle With New Products",
    "image": "https://images.financialmodelingprep.com/news/glidden-brand-refreshes-walmart-paint-aisle-with-new-products-20250528.jpg",
    "site": "businesswire.com",
    "text": "CRANBERRY TOWNSHIP, Pa.--(BUSINESS WIRE)-- #PittsburghPaints--GLIDDEN paint is transforming the paint aisle at Walmart with new paints, colors and caulking.",
    "url": "https://www.businesswire.com/news/home/20250528099048/en/GLIDDEN-Brand-Refreshes-Walmart-Paint-Aisle-With-New-Products/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T09:30:00-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 10:00:00",
    "publisher": "Business Wire",
    "title": "Walmart Is Helping Medicare Advantage Customers Seamlessly Use Their Supplemental Health Benefits for Everyday Wellness Purchases",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-helping-medicare-advantage-customers-seamlessly-use-their-20250528.jpg",
    "site": "businesswire.com",
    "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)--Walmart is transforming the healthcare shopping experience with new digital innovations to help customers maximize their Medicare Advantage supplemental benefits. For the first time in retail, select customers can easily identify plan-specific, benefits-eligible products while shopping on Walmart.com and the Walmart app. They can track their benefits spending in real time and check out with a mixed basket of healthy food, over the counter (OTC) products and g.",
    "url": "https://www.businesswire.com/news/home/20250528476777/en/Walmart-Is-Helping-Medicare-Advantage-Customers-Seamlessly-Use-Their-Supplemental-Health-Benefits-for-Everyday-Wellness-Purchases/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T10:00:00-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 11:04:47",
    "publisher": "Seeking Alpha",
    "title": "Walmart Inc. (WMT) Presents at Bernstein 41st Annual Strategic Decisions Conference (Transcript)",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-presents-at-bernstein-41st-annual-strategic-20250528.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart Inc. (NYSE:WMT ) Bernstein 41st Annual Strategic Decisions Conference May 28, 2025 8:01 AM ET Company Participants Kath McLay - EVP, President and CEO Conference Call Participants Zhihan Ma - Bernstein Zhihan Ma All right. Good morning, everyone.",
    "url": "https://seekingalpha.com/article/4790511-walmart-inc-wmt-presents-at-bernstein-41st-annual-strategic-decisions-conference-transcript",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T11:04:47-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 12:03:48",
    "publisher": "The Motley Fool",
    "title": "Why Is Everyone Talking About Walmart Stock?",
    "image": "https://images.financialmodelingprep.com/news/why-is-everyone-talking-about-walmart-stock-20250528.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.13%) is generating buzz in the investor community due to its success in e-commerce.",
    "url": "https://www.fool.com/investing/2025/05/28/why-is-everyone-talking-about-walmart-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T12:03:48-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 14:06:21",
    "publisher": "247 Wallst",
    "title": "Amazon (NASDAQ: AMZN) Stock Price Prediction for 2025: Where Will It Be in 1 Year",
    "image": "https://images.financialmodelingprep.com/news/amazon-nasdaq-amzn-stock-price-prediction-for-2025-where-20250528.jpg",
    "site": "https://247wallst.com",
    "text": "Shares of Amazon.com Inc. (NASDAQ:AMZN) lost 2.29% over the past five trading sessions, halting a rally that has seen the stock gain 23.16% since its year-to-date low of $167.32 on April 21. On the year, the e-commerce giant has seen its stock lose 6.42% despite beating on EPS and revenue by 16.77% and 0.35%, respectively, in Q1. Tempered forward guidance due to President Trump&#8217;s tariffs continues to cloud Amazon&#8217;s outlook. However, with the U.S. and China agreeing to a 90-day reduction in tariffs on May 11, there is renewed hope for the consumer discretionary mainstay, who has seen its one-year gain diminished to 12.28%. In its recent earnings call, Amazon reported that Q1 revenue growth and an operating income increase. Amazon Ads generated $13.9 billion in revenue alone, representing a 19% year-over-year increase, while AWS grew by 17% year-over-year to an annualized revenue run rate of $117 billion. Still, the stock remains down nearly 15% in 2025, with its one-year gain having been erased in Q1, which now stands at a 0.79% loss. In early April, Piper Sandler lowered its price target for Amazon to $215 from $265; however, the firm maintained its &#8220;Overweight&#8221; rating saying it is looking for Q1 revenue of $153B and within the $151B–$155B guidance range. Piper forecasts AWS growth of 17% year-over-year. For Q2, the firm anticipates a guidance range of $157B–$162B and op income guidance of $14B–$18B. Piper lowered its 2025 ads revenue growth by about 1% and online stores and 3P services. Still, while there can be little doubt about its current financial health, investors and potential investors may be right to wonder whether growth can continue at Amazon&#8217;s historic pace, and whether the stock is safe as a long-term holding. Let&#8217;s take a look at where the share price could be headed. Key Points in This Article: Amazon is facing substantial headwinds this year, but the stock remains fundamentally sound with a &#8220;Strong Buy&#8221; rating. AWS, AI and ad sales continue to be major drivers for the Magnificent Seven stock. If you’re looking for a megatrend with massive potential, make sure to grab a complimentary copy of our “The Next NVIDIA” report. This report breaks down AI stocks with 10x potential and will give you a huge leg up on profiting from this massive sea change. Why Invest in Amazon? In the past 20 years, Amazon&#8217;s stock is up more than 9,188%. The company has been called one of the most influential economic and cultural forces in the world, and its brand is one of the world&#8217;s most valuable. Though the stock tumbled as the COVID-19 pandemic waned and lockdowns ended (along with the broader markets), it has more than recovered. Shares of this Magnificent Seven member hit an all-time high on Feb. 4, 2025, but with the Nasdaq briefly entering bear market territory in March, it had been downhill for Amazon in 2025. There have been signs of hope recently, with AMZN rebounding along with the broad market. It is hard to imagine that the company or its share price will collapse any time soon, but analysts and investors may see the stock as overbought. Let&#8217;s see what Wall Street expects. Amazon as a Company The company engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores internationally. It also manufactures and sells electronic devices and develops and produces media content. Amazon Web Services (AWS) provides compute, storage, database, analytics, machine learning, and other services. And Amazon Prime is the company&#8217;s membership program. Amazon is based in Seattle. It was founded in 1994 by Jeff Bezos, the former chief executive officer and now executive board chair. Amazon went public in May 1997. Its retail competitors include Alibaba Group Holding Ltd. (NYSE:BABA), Kroger Co. (NYSE:KR) and Walmart Inc. (NYSE:WMT). It also competes with the likes of Netflix Inc. (NASDAQ:NFLX) and Microsoft Corp. (NASDAQ:MSFT). The company continues its push into artificial intelligence with an update of its Alexa feature to Alexa+. AWS investments in cloud computing and AI also continue, with the former being the world&#8217;s largest cloud services provider and the latter nearing its debut of its &#8220;Nova&#8221; chatbot, which will compete in price with ChatGPT. Additionally, Amazon has been expanding its same-day delivery services, and its entertainment division has secured the James Bond franchise with the acquisition of MGM Studios. Headwinds include ongoing labor issues. The most recent quarterly results showed strong performance, with AWS as a major growth driver. Amazon as a Stock Since hitting its all-time high on Feb. 4, the stock has sunk 15.15%. Note that Wall Street analysts&#8217; $240.62 consensus price target is just shy of Amazon&#8217;s all-time high share price seen earlier this year. Of the 48 analysts covering AMZN, all but one assign it a &#8220;Buy&#8221; rating, with the other assigning it a &#8220;Hold&#8221; rating. Overall, the stock receives a consensus &#8220;Strong Buy&#8221; rating. Loop Capital and Wells Fargo recently reiterated buy-equivalent ratings, and with 64.01% of shares held by institutional investors — including notable stakes from the three largest asset management companies, Vanguard, BlackRock and State Street — the stock is popular among Wall Street&#8217;s sell-side firms. Institutional holdings of Amazon have seen net increase with 2,927 position increases versus 2,426 position decreases. Wall Street expectations for where the stock goes in the next 52 weeks vary. While analysts overall anticipate healthy upside, the lowest price target indicates a decline in the share price. The consensus projection signals strong upside potential for the next 52 weeks, based on strong forward guidance for business segments like AWS and Prime Video&#8217;s ad sales, which saw enormous year-over-year increases as the platform now hosts the NFL&#8217;s Thursday Night Football programming. Estimate Price Target %Change From Current Price Low $195.00 -5.02% Median $240.62 17.19% High $305.00 48.55% Amazon does face some headwinds and risks in addition to those mentioned above. Consumers appear to be pulling back on spending due to ongoing inflation, contracting GDP in Q1 and the possibility of a recession in 2025. Over the past month, however, the consumer discretionary sector of the S&amp;P 500 — into which Amazon falls — has performed admirably, posting a gain of 18.14%, second only to tech&#8217;s gain of 21.31% over the same period. That rebound represents a stark difference from the sector&#8217;s last-place performance among the S&amp;P 500&#8217;s 11 sectors through Q1 2025. While the company dominates in the retail space and is a tech leader, competition in neither category is likely to go away anytime soon. All these things could have a huge impact on profitability. Despite some skeptics, the prospects for Amazon are optimistic overall, especially in the short term. Wall Street&#8217;s &#8220;Strong Buy&#8221; consensus rating and the upside potential far outweigh the downside potential shares of AMZN face. The post Amazon (NASDAQ: AMZN) Stock Price Prediction for 2025: Where Will It Be in 1 Year appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/28/amazon-stock-price-prediction-where-will-it-be-in-1-year/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T14:06:21-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-28 16:42:34",
    "publisher": "PYMNTS",
    "title": "Walmart Launches Digital Tools to Help Customers Find Benefits-Eligible Products",
    "image": "https://images.financialmodelingprep.com/news/walmart-launches-digital-tools-to-help-customers-find-benefitseligible-20250528.jpg",
    "site": "pymnts.com",
    "text": "Walmart added digital tools on its website and app that are designed to help select customers identify over-the-counter (OTC), food and wellness products that can be purchased with their Medicare Advantage supplemental benefits.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-launches-digital-tools-help-customers-find-benefits-eligible-products/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-28T16:42:34-04:00",
    "date_et": "2025-05-28"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 04:00:05",
    "publisher": "PYMNTS",
    "title": "Amazon and Walmart Hit the Wall as Shoppers Shift Spending",
    "image": "https://images.financialmodelingprep.com/news/amazon-and-walmart-hit-the-wall-as-shoppers-shift-20250529.jpg",
    "site": "pymnts.com",
    "text": "The intense rivalry between eCommerce titan Amazon and brick-and-mortar giant Walmart has long pitted the two companies against each other. Now, both retailers have a new challenge: Shoppers themselves.",
    "url": "https://www.pymnts.com/news/retail/2025/amazon-and-walmart-hit-the-wall-as-shoppers-shift-spending/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-29T04:00:05-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 06:09:00",
    "publisher": "The Motley Fool",
    "title": "How Walmart Stock Investors Are Impacted by President Donald Trump's Tariff Policy",
    "image": "https://images.financialmodelingprep.com/news/how-walmart-stock-investors-are-impacted-by-president-donald-20250529.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.40%) imports a large percentage of its products, which makes it vulnerable to a higher tariff policy.",
    "url": "https://www.fool.com/investing/2025/05/29/how-walmart-stock-investors-are-impacted-by-presid/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-29T06:09:00-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 07:00:00",
    "publisher": "Business Wire",
    "title": "NationsBenefits® and Walmart are Revolutionizing Health Plan Member Engagement with Technology, Retail and Nutrition Integrations",
    "image": "https://images.financialmodelingprep.com/news/nationsbenefits-and-walmart-are-revolutionizing-health-plan-member-engagement-20250529.jpg",
    "site": "businesswire.com",
    "text": "PLANTATION, Fla. & BENTONVILLE, Ark.--(BUSINESS WIRE)-- #NationsBenefits--NationsBenefits®, the leading healthcare fintech, supplemental benefits, and outcomes platform, and Walmart, the world's largest retailer, today announced they are continuing to work together to transform how health plan members access essential benefits through tech-powered tools. This collaboration includes NationsBenefits' proprietary Basket Analyzer Service (BAS) as well as the Walmart Everyday Health Signals™ program, which leverages o.",
    "url": "https://www.businesswire.com/news/home/20250529492434/en/NationsBenefits%C2%AE-and-Walmart-are-Revolutionizing-Health-Plan-Member-Engagement-with-Technology-Retail-and-Nutrition-Integrations/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-29T07:00:00-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 08:52:18",
    "publisher": "24/7 Wall Street",
    "title": "Prediction: Walmart (WMT) Will be the Next $1 Trillion Stock",
    "image": "https://images.financialmodelingprep.com/news/prediction-walmart-wmt-will-be-the-next-1-trillion-20250529.jpg",
    "site": "247wallst.com",
    "text": "Walmart's (WMT) dominance in retail, spanning physical stores, e-commerce, and high-margin advertising, positions it for significant growth in a cost-conscious market.",
    "url": "https://247wallst.com/investing/2025/05/29/prediction-walmart-wmt-will-be-the-next-1-trillion-stock/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-29T08:52:18-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 09:05:00",
    "publisher": "Business Wire",
    "title": "Walmart Family Mobile Introduces Most Affordable Plans Yet with New Features to Support Families During Economic Challenges",
    "image": "https://images.financialmodelingprep.com/news/walmart-family-mobile-introduces-most-affordable-plans-yet-with-20250529.jpg",
    "site": "businesswire.com",
    "text": "NEW YORK--(BUSINESS WIRE)--Walmart Family Mobile, a leading prepaid brand powered by Verizon's award-winning network and available exclusively at Walmart, is proud to introduce its most affordable plans yet, designed to help families stay connected without compromising their budget. With inflation continuing to impact household finances across the country, Walmart Family Mobile helps families save money during times of financial uncertainty. New Plans and Features: New $19.88 Plan: Introducing.",
    "url": "https://www.businesswire.com/news/home/20250529714684/en/Walmart-Family-Mobile-Introduces-Most-Affordable-Plans-Yet-with-New-Features-to-Support-Families-During-Economic-Challenges/",
    "ticker": "WMT",
    "event_date": "2025-05-15",
    "window_start": "2025-05-08",
    "window_end": "2025-05-29",
    "publishedDateET": "2025-05-29T09:05:00-04:00",
    "date_et": "2025-05-29"
  }
]