[
  {
    "symbol": "MA",
    "publishedDate": "2022-07-14 10:07:15",
    "publisher": "Zacks Investment Research",
    "title": "Is Most-Watched Stock Mastercard Incorporated (MA) Worth Betting on Now?",
    "image": "https://images.financialmodelingprep.com/news/is-mostwatched-stock-mastercard-incorporated-ma-worth-betting-on-20220714.jpg",
    "site": "zacks.com",
    "text": "MasterCard (MA) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
    "url": "https://www.zacks.com/stock/news/1952231/is-most-watched-stock-mastercard-incorporated-ma-worth-betting-on-now",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-14T10:07:15-04:00",
    "date_et": "2022-07-14"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-14 13:57:36",
    "publisher": "PYMNTS",
    "title": "UK Parliament Asks Visa, Mastercard to Explain Swipe Fees Hike",
    "image": "https://images.financialmodelingprep.com/news/uk-parliament-asks-visa-mastercard-to-explain-swipe-fees-20220714.jpg",
    "site": "pymnts.com",
    "text": "On Wednesday (July 13), the Treasury Committee at the U.K. Parliament sent letters to Visa and Mastercard requesting them to explain their increases in cross-border interchange fees after the U.K. left the European Union. The companies have until July 27 to respond.",
    "url": "https://www.pymnts.com/news/regulation/2022/uk-parliament-asks-visa-mastercard-to-explain-swipe-fees-hike/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-14T13:57:36-04:00",
    "date_et": "2022-07-14"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-14 19:40:15",
    "publisher": "InvestorPlace",
    "title": "7 Best S&P 500 Stocks to Buy in July",
    "image": "https://images.financialmodelingprep.com/news/7-best-sp-500-stocks-to-buy-in-july-20220714.jpg",
    "site": "investorplace.com",
    "text": "A number of S&P 500 stocks offer a compelling buying opportunity for investors with a long-term mindset. The post 7 Best S&P 500 Stocks to Buy in July appeared first on InvestorPlace.",
    "url": "https://investorplace.com/best-sp-500-stocks/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-14T19:40:15-04:00",
    "date_et": "2022-07-14"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-16 09:00:00",
    "publisher": "Seeking Alpha",
    "title": "10 Dividend Growth Stocks For July 2022",
    "image": "https://images.financialmodelingprep.com/news/10-dividend-growth-stocks-for-july-2022-20220716.jpg",
    "site": "seekingalpha.com",
    "text": "This monthly series ranks a selection of dividend growth stocks in Dividend Radar and presents the ten top-ranked stocks for consideration. To rank stocks, I use DVK Quality Snapshots to obtain quality scores, sort them in descending order, and break ties with additional metrics.",
    "url": "https://seekingalpha.com/article/4523702-10-dividend-growth-stocks-july-2022",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-16T09:00:00-04:00",
    "date_et": "2022-07-16"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-18 07:00:00",
    "publisher": "Business Wire",
    "title": "D-Wave and Mastercard Take Quantum Leap into Future of Financial Services",
    "image": "https://images.financialmodelingprep.com/news/dwave-and-mastercard-take-quantum-leap-into-future-of-financial-20220718.jpg",
    "site": "businesswire.com",
    "text": "PALO ALTO, Calif. & BURNABY, British Columbia & PURCHASE, N.Y.--(BUSINESS WIRE)--D-Wave Systems Inc. (“D-Wave”), a leader in quantum computing systems, software, and services, and the only company building both quantum annealing and gate-based quantum computers, and Mastercard (NYSE: MA) today announced a multi-year strategic alliance to champion the acceleration and adoption of quantum computing solutions. Mastercard and D-Wave will collaborate on the research and development of quantum-hybrid applications in areas such as consumer loyalty and rewards, cross-border settlement and fraud management. The collaboration will use D-Wave’s annealing quantum computers and quantum hybrid solvers through the Leap™ quantum cloud service to deliver real-time access to quantum applications safely and securely powered by Mastercard’s network. “We are heralding in the next wave of computing. Just like the creation of the PC, the emergence of the internet and the proliferation of smartphones and voice assistants, it is our belief that quantum will have far-reaching and industry-disrupting impact, especially in the financial services sector,” said Alan Baratz, CEO of D-Wave. “D-Wave and Mastercard have a shared vision of harnessing the power of technology to positively affect business and society. This alliance supports that vision by delivering quantum innovation that will tackle increasingly complex problem sets across applications like optimized loyalty programs, fraud management and anti-money laundering in financial services and, ultimately, unlock more value for customers.” “People expect hyper-personalized experiences. Quantum computing’s unique ability to analyze huge numbers of potential combinations can deliver optimal solutions that will improve efficiency and provide choice,” said Ken Moore, Chief Innovation Officer at Mastercard. “Our work with D-Wave will explore the endless applications of quantum computing for practical, real-world financial services applications.” A video overview of D-Wave and Mastercard’s new alliance can be viewed here. About D-Wave Systems Inc. D-Wave is a leader in the development and delivery of quantum computing systems, software, and services, the world’s first commercial supplier of quantum computers and the only company building both annealing quantum computers and gate-model quantum computers. Our mission is to unlock the power of quantum computing for business and society, today. We do this by delivering customer value with practical quantum applications for problems as diverse as logistics, artificial intelligence, materials sciences, drug discovery, scheduling, cybersecurity, fault detection, and financial modeling. D-Wave’s systems are being used by some of the world’s most advanced organizations, including NEC Corporation, Volkswagen, DENSO, Lockheed Martin, University of Southern California, Forschungszentrum Jülich and Los Alamos National Laboratory. With headquarters near Vancouver, Canada, D-Wave’s US operations are based in Palo Alto, CA. D-Wave has a blue-chip investor base that includes PSP Investments, Goldman Sachs, BDC Capital, NEC Corp., Aegis Group Partners, and In-Q-Tel. About Mastercard Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com Important Information About the Proposed Transaction between D-Wave and DPCM Capital, Inc. (“DPCM Capital”) and Where to Find It: A full description of the terms of the proposed business combination transaction between D-Wave and DPCM Capital (the “Proposed Transaction”) is provided in a registration statement on Form S-4, as amended, filed with the SEC by D-Wave Quantum Inc. that includes a prospectus with respect to the combined company’s securities, to be issued in connection with the Proposed Transaction and a proxy statement with respect to the stockholder meeting of DPCM Capital to vote on the Proposed Transaction. D-Wave Quantum Inc. and DPCM Capital urge investors, stockholders, and other interested persons to read the proxy statement/ prospectus, as well as other documents filed with the SEC, because these documents contain important information about D-Wave Quantum Inc., DPCM Capital, D-Wave, and the Proposed Transaction. DPCM Capital commenced mailing the definitive proxy statement/prospectus to its stockholders on or about July 13, 2022 in connection with the transaction. Stockholders also may obtain a copy of the registration statement on Form S-4, as amended—including the proxy statement/prospectus and other documents filed with the SEC without charge—by directing a request to: D-Wave Quantum Inc., 3033 Beta Avenue, Burnaby, BC V5G 4M9 Canada, or via email at shareholdercomm@dwavesys.com and DPCM Capital, 382 NE 191 Street, #24148, Miami, Florida 33179, or via email at mward@hstrategies.com. The definitive proxy statement/prospectus included in the registration statement, can also be obtained, without charge, at the SEC’s website (www.sec.gov). Forward-Looking Statements This press release contains forward-looking statements that are based on beliefs and assumptions, and on information currently available. In some cases, you can identify forward-looking statements by the following words: “may,” “will,” “could,” “would,” “should,” “expect,” “intend,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “project,” “potential,” “continue,” “ongoing,” or the negative of these terms or other comparable terminology, although not all forward-looking statements contain these words. These statements involve risks, uncertainties, and other factors that may cause actual results, levels of activity, performance, or achievements to be materially different from the information expressed or implied by these forward-looking statements. We caution you that these statements are based on a combination of facts and factors currently known by us and our projections of the future, which are subject to a number of risks. Forward-looking statements in this press release include, but are not limited to, statements regarding the anticipated benefits of the collaboration with Mastercard and the increased adoption of quantum computing solutions and expansion of related use cases. We cannot assure you that the forward-looking statements in this press release will prove to be accurate. These forward-looking statements are subject to a number of risks and uncertainties, including, among others, various factors beyond management’s control, including risks relating to general economic conditions, risks relating to the immaturity of the quantum computing market and other risks, uncertainties and factors set forth in the sections entitled “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” in DPCM Capital’s Annual Report on Form 10-K, as amended, originally filed with the SEC on March 31, 2021, and in the proxy statement/prospectus filed by D-Wave Quantum Inc. in connection with the Proposed Transaction, and other filings with the SEC. Furthermore, if the forward-looking statements prove to be inaccurate, the inaccuracy may be material. In addition, you are cautioned that past performance may not be indicative of future results. In light of the significant uncertainties in these forward-looking statements, you should not rely on these statements in making an investment decision or regard these statements as a representation or warranty by any person that D-Wave Quantum Inc., DPCM Capital, or D-Wave will achieve our objectives and plans in any specified time frame, or at all. The forward-looking statements in this press release represent our views as of the date of this press release. We anticipate that subsequent events and developments will cause our views to change. However, while we may elect to update these forward-looking statements at some point in the future, we have no current intention of doing so except to the extent required by applicable law. You should, therefore, not rely on these forward-looking statements as representing our views as of any date subsequent to the date of this press release. No Offer or Solicitation This communication is for informational purposes only and does not constitute an offer or invitation for the sale or purchase of securities, assets, or the business described herein or a commitment to D-Wave Quantum Inc., DPCM Capital, or D-Wave, nor is it a solicitation of any vote, consent, or approval in any jurisdiction pursuant to or in connection with the Proposed Transaction or otherwise, nor shall there be any sale, issuance, or transfer of securities in any jurisdiction in contravention of applicable law. Participants in Solicitation D-Wave Quantum Inc., DPCM Capital, and D-Wave, and their respective directors and executive officers, may be deemed participants in the solicitation of proxies of DPCM Capital’s stockholders in respect of the Proposed Transaction. Information about the directors and executive officers of DPCM Capital is set forth in DPCM Capital’s filings with the SEC. Information about the directors and executive officers of D-Wave Quantum Inc. and more detailed information regarding the identity of all potential participants, and their direct and indirect interests by security holdings or otherwise, is set forth in the definitive proxy statement/prospectus for the Proposed Transaction. Additional information regarding the identity of all potential participants in the solicitation of proxies to DPCM Capital’s stockholders in connection with the Proposed Transaction and other matters to be voted upon at the special meeting, and their direct and indirect interests, by security holdings or otherwise, is included in the definitive proxy statement/prospectus.",
    "url": "https://www.businesswire.com/news/home/20220718005216/en/D-Wave-and-Mastercard-Take-Quantum-Leap-into-Future-of-Financial-Services",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-18T07:00:00-04:00",
    "date_et": "2022-07-18"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-18 07:00:00",
    "publisher": "Business Wire",
    "title": "D-Wave and Mastercard Take Quantum Leap into Future of Financial Services",
    "image": "https://images.financialmodelingprep.com/news/dwave-and-mastercard-take-quantum-leap-into-future-of-20220718.jpg",
    "site": "businesswire.com",
    "text": "PALO ALTO, Calif. & BURNABY, British Columbia & PURCHASE, N.Y.--(BUSINESS WIRE)--D-Wave Systems Inc. and Mastercard announced a multi-year strategic alliance to champion the acceleration and adoption of quantum-hybrid applications.",
    "url": "https://www.businesswire.com/news/home/20220718005216/en/D-Wave-and-Mastercard-Take-Quantum-Leap-into-Future-of-Financial-Services/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-18T07:00:00-04:00",
    "date_et": "2022-07-18"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-18 13:41:24",
    "publisher": "PYMNTS",
    "title": "Mastercard Teams with D-Wave to Advance Quantum-Hybrid Solutions",
    "image": "https://images.financialmodelingprep.com/news/mastercard-teams-with-dwave-to-advance-quantumhybrid-solutions-20220718.jpg",
    "site": "pymnts.com",
    "text": "Mastercard and D-Wave Systems are collaborating to accelerate the adoption of quantum computing solutions and are working to develop quantum-hybrid applications across numerous areas in financial services.",
    "url": "https://www.pymnts.com/partnerships/2022/mastercard-teams-with-d-wave-to-advance-quantum-hybrid-solutions/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-18T13:41:24-04:00",
    "date_et": "2022-07-18"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-19 05:21:00",
    "publisher": "The Motley Fool",
    "title": "4 No-Brainer Stocks to Buy if the U.S. Dips Into a Recession",
    "image": "https://images.financialmodelingprep.com/news/4-nobrainer-stocks-to-buy-if-the-us-dips-20220719.jpg",
    "site": "fool.com",
    "text": "A first-quarter GDP retracement and the Atlanta Fed's latest GDP estimate for the second quarter signals we may already be in a recession.",
    "url": "https://www.fool.com/investing/2022/07/19/4-no-brainer-stocks-buy-if-us-dips-into-recession/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-19T05:21:00-04:00",
    "date_et": "2022-07-19"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-20 07:45:00",
    "publisher": "The Motley Fool",
    "title": "Bear Market Buys: Where to Invest $5,000 Right Now",
    "image": "https://images.financialmodelingprep.com/news/bear-market-buys-where-to-invest-5000-right-now-20220720.jpg",
    "site": "fool.com",
    "text": "These stocks are all trading near their 52-week lows.",
    "url": "https://www.fool.com/investing/2022/07/20/bear-market-buys-where-to-invest-5000-right-now/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-20T07:45:00-04:00",
    "date_et": "2022-07-20"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-21 19:43:09",
    "publisher": "PYMNTS",
    "title": "Mastercard Taps Amex Exec Vivian Zhou as Corporate Treasurer",
    "image": "https://images.financialmodelingprep.com/news/mastercard-taps-amex-exec-vivian-zhou-as-corporate-treasurer-20220721.jpg",
    "site": "pymnts.com",
    "text": "Mastercard has named 16-year American Express veteran Vivian Zhou as its new corporate treasurer, effective Aug. 15, according to a company blog post Thursday (July 21). Zhou will be taking over for Alfred Kibe, who will become the new chief financial officer for Mastercard in North America.",
    "url": "https://www.pymnts.com/personnel/2022/mastercard-taps-amex-exec-vivian-zhou-as-corporate-treasurer/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-21T19:43:09-04:00",
    "date_et": "2022-07-21"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-22 08:25:58",
    "publisher": "Seeking Alpha",
    "title": "Mastercard: Continued Momentum Onward",
    "image": "https://images.financialmodelingprep.com/news/mastercard-continued-momentum-onward-20220722.jpg",
    "site": "seekingalpha.com",
    "text": "The thesis I put forth in my October 2021 article - that Mastercard has superb defensive, growth, and operating leverage characteristics - continues to hold. The company's gross dollar volume (GDV) exceeded pre-COVID highs by 40% in the fourth quarter of 2021, and I expect it to continue benefiting from multiple tailwinds.",
    "url": "https://seekingalpha.com/article/4525095-mastercard-continued-momentum-onward",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-22T08:25:58-04:00",
    "date_et": "2022-07-22"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-25 05:06:00",
    "publisher": "The Motley Fool",
    "title": "15 Stocks Warren Buffett Has Held for at Least 10 Years",
    "image": "https://images.financialmodelingprep.com/news/15-stocks-warren-buffett-has-held-for-at-least-20220725.jpg",
    "site": "fool.com",
    "text": "Patience plays a big role in the Oracle of Omaha's investing philosophy.",
    "url": "https://www.fool.com/investing/2022/07/25/15-stocks-warren-buffett-has-held-for-10-years/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-25T05:06:00-04:00",
    "date_et": "2022-07-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-25 05:45:00",
    "publisher": "The Motley Fool",
    "title": "Wise Shows Once Again Why It Is a Must-Own for Disruptive Fintech Investors",
    "image": "https://images.financialmodelingprep.com/news/wise-shows-once-again-why-it-is-a-mustown-20220725.jpg",
    "site": "fool.com",
    "text": "The digital remittance company just put up another stellar earnings report.",
    "url": "https://www.fool.com/investing/2022/07/25/wise-shows-once-again-why-it-is-a-must-own-for-dis/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-25T05:45:00-04:00",
    "date_et": "2022-07-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-25 16:42:43",
    "publisher": "PYMNTS",
    "title": "HP Exec Ellen Jackowski Joins Mastercard as Chief Sustainability Officer",
    "image": "https://images.financialmodelingprep.com/news/hp-exec-ellen-jackowski-joins-mastercard-as-chief-sustainability-20220725.jpg",
    "site": "pymnts.com",
    "text": "Ellen Jackowski joined Mastercard on Monday (July 25) as the company's chief sustainability officer, responsible for “further integrating Mastercard's environmental, social and governance (ESG) strategy into the organization,” according to the company press release.",
    "url": "https://www.pymnts.com/personnel/2022/hp-exec-ellen-jackowski-joins-mastercard-as-chief-sustainability-officer/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-25T16:42:43-04:00",
    "date_et": "2022-07-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-26 07:00:00",
    "publisher": "Forbes",
    "title": "Mastercard Stock To Top The Consensus In Q2?",
    "image": "https://images.financialmodelingprep.com/news/mastercard-stock-to-top-the-consensus-in-q2-20220726.jpg",
    "site": "forbes.com",
    "text": "Mastercard (NYSE: MA) is scheduled to report its fiscal Q2 2022 results on Thursday, July 28. We expect Mastercard to top the consensus estimates of revenues and earnings.",
    "url": "https://www.forbes.com/sites/greatspeculations/2022/07/26/mastercard-stock-to-top-the-consensus-in-q2/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-26T07:00:00-04:00",
    "date_et": "2022-07-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-26 14:45:06",
    "publisher": "Zacks Investment Research",
    "title": "Mastercard (MA) Gears Up for Q2 Earnings: What to Expect?",
    "image": "https://images.financialmodelingprep.com/news/mastercard-ma-gears-up-for-q2-earnings-what-to-20220726.jpg",
    "site": "zacks.com",
    "text": "Mastercard's (MA) second-quarter results are likely to reflect higher GDV and cross-border volumes.",
    "url": "https://www.zacks.com/stock/news/1958219/mastercard-ma-gears-up-for-q2-earnings-what-to-expect",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-26T14:45:06-04:00",
    "date_et": "2022-07-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-27 13:46:46",
    "publisher": "Market Watch",
    "title": "Visa, Mastercard stocks turn lower after WSJ says senators preparing bill targeting credit fees",
    "image": "https://images.financialmodelingprep.com/news/visa-mastercard-stocks-turn-lower-after-wsj-says-senators-20220727.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Mastercard Inc. MA, -0.52% and Visa Inc. V, -2.48% turned lower in Wednesday afternoon trading after The Wall Street Journal reported that two members of the U.S. Senate were working on a bill that would let merchants process Mastercard and Visa credit cards over unaffiliated networks. The report indicated that the bill could be debuted as early as this week and that it features bipartisan authorship, with Sen.",
    "url": "https://www.marketwatch.com/story/visa-mastercard-stocks-turn-lower-after-wsj-says-senators-preparing-bill-targeting-credit-fees-2022-07-27",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-27T13:46:46-04:00",
    "date_et": "2022-07-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-27 14:16:00",
    "publisher": "Market Watch",
    "title": "Senate bill takes aim at Visa and Mastercard rising credit card fees for merchants",
    "image": "https://images.financialmodelingprep.com/news/senate-bill-takes-aim-at-visa-and-mastercard-rising-20220727.jpg",
    "site": "marketwatch.com",
    "text": "Two U.S. senators are preparing legislation that would give merchants power to process many Visa Inc. V, -2.69%  and Mastercard Inc. MA, -0.48%  credit cards over different networks.",
    "url": "https://www.marketwatch.com/story/senate-bill-takes-aim-at-visa-and-mastercard-rising-credit-card-fees-for-merchants-11658945790",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-27T14:16:00-04:00",
    "date_et": "2022-07-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-27 14:16:33",
    "publisher": "PYMNTS",
    "title": "Bill Targets Visa, Mastercard Fees",
    "image": "https://images.financialmodelingprep.com/news/bill-targets-visa-mastercard-fees-20220727.jpg",
    "site": "pymnts.com",
    "text": "A pair of U.S. senators are preparing a bill that would give merchants the ability to process many Mastercard and Visa credit cards over different networks.",
    "url": "https://www.pymnts.com/legal/2022/bill-targets-visa-mastercard-fees/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-27T14:16:33-04:00",
    "date_et": "2022-07-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-27 20:21:00",
    "publisher": "Market Watch",
    "title": "What possible credit legislation could mean for Visa, Mastercard — and you",
    "image": "https://images.financialmodelingprep.com/news/what-possible-credit-legislation-could-mean-for-visa-mastercard-20220727.jpg",
    "site": "marketwatch.com",
    "text": "Credit-card companies look to be under a political microscope once again as the Wall Street Journal reported Wednesday that senators are working on a new bill that would target Visa Inc. and Mastercard Inc.",
    "url": "https://www.marketwatch.com/story/what-possible-credit-legislation-could-mean-for-visa-mastercard-and-you-11658967695",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-27T20:21:00-04:00",
    "date_et": "2022-07-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 07:39:23",
    "publisher": "InvestorPlace",
    "title": "7 S&P 500 Stocks to Buy on the Dip",
    "image": "https://images.financialmodelingprep.com/news/7-sp-500-stocks-to-buy-on-the-dip-20220728.png",
    "site": "investorplace.com",
    "text": "S&P 500 stocks to buy on the dip is our topic today. Unrelenting inflation and the potential response from the Federal Reserve have been of particular concern to investors.",
    "url": "https://investorplace.com/sp-500-stocks-to-buy-on-the-dip/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T07:39:23-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 08:03:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Second Quarter 2022 Financial Results Available on Company's Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-second-quarter-2022-financial-results-available-on-companys-20220728.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard (NYSE: MA) today announced its second quarter 2022 financial results through an earnings release available at investor.mastercard.com.",
    "url": "https://www.businesswire.com/news/home/20220728005553/en/Mastercard-Incorporated-Second-Quarter-2022-Financial-Results-Available-on-Company%E2%80%99s-Website/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T08:03:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 08:03:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Second Quarter 2022 Financial Results Available on Company’s Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-second-quarter-2022-financial-results-available-on-companys-website-20220728.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its second quarter 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.",
    "url": "https://www.businesswire.com/news/home/20220728005553/en",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T08:03:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 08:03:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Second Quarter 2022 Financial Results Available on Company’s Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-second-quarter-2022-financial-results-available-on-20220728.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its second quarter 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.",
    "url": "https://www.businesswire.com/news/home/20220728005553/en/Mastercard-Incorporated-Second-Quarter-2022-Financial-Results-Available-on-Company%E2%80%99s-Website",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T08:03:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 08:14:00",
    "publisher": "Market Watch",
    "title": "Mastercard earnings top expectations amid ‘robust' spending",
    "image": "https://images.financialmodelingprep.com/news/mastercard-earnings-top-expectations-amid-robust-spending-20220728.jpg",
    "site": "marketwatch.com",
    "text": "Mastercard Inc. became the latest payments company to signal upbeat spending trends as the card giant posted a sizable earnings beat and said it had yet to see notable impacts from inflation on its volumes.",
    "url": "https://www.marketwatch.com/story/mastercard-earnings-top-expectations-amid-robust-spending-11659010475",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T08:14:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 09:06:00",
    "publisher": "Barron's",
    "title": "Mastercard Earnings Top Expectations Thanks to a 'Robust' Consumer",
    "image": "https://images.financialmodelingprep.com/news/mastercard-earnings-top-expectations-thanks-to-a-robust-consumer-20220728.jpg",
    "site": "barrons.com",
    "text": "The credit card company saw a 58% increase in cross-border transaction volumes in the second quarter.",
    "url": "https://www.barrons.com/articles/mastercard-stock-earnings-consumer-spending-51659013528",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T09:06:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 10:15:00",
    "publisher": "Business Wire",
    "title": "Mastercard Installments Gains Traction with New Global Partners and Support for Small Businesses",
    "image": "https://images.financialmodelingprep.com/news/mastercard-installments-gains-traction-with-new-global-partners-and-20220728.png",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard has welcomed a raft of new global partners to its innovative Mastercard Installments program and is expanding it further to support small businesses in the U.S. Illustrating the demand for powerful buy now, pay later (BNPL) experiences from familiar and trusted brands, several new partners are providing support for the program, including HSBC, J.P.Morgan and NatWest in the U.K.; Cross River Bank, Evolve Bank & Trust, Jifiti, Live Oak Bank, MOCA Financial and WebBank in the U.S.; and Saudi National Bank (SNB) in Saudi Arabia. The program taps the power and scale of the Mastercard network, which connects to more than 90 million merchants globally, to instantly support secure BNPL payments at checkout, both in-store and online. In addition to delivering more payment choice, Mastercard Installments is built on responsible lending practices and supports shoppers with an enhanced set of consumer protections, data transparency and insight-driven programs. Through technology, data and insights, and its consulting expertise, Mastercard is creating a more intelligent way to provide installment lending at scale. “We believe no matter how you pay, a foundation of strong protections must be in place,” said Craig Vosburg, Chief Product Officer at Mastercard. “Trust is the currency of innovation. Using a Responsible-by-Design approach ensures that we stay ahead of consumer, merchant and bank needs and expectations, continuously building confidence in the payments ecosystem by providing choice at scale.” A Responsible, Intelligent Way to Offer Installment Lending According to new global consumer research from Mastercard's World Payments Advisory™, nearly a quarter of respondents across 50+ markets have used a BNPL product in the past six months.[i] For BNPL users, “forgetting the payment was due” was the leading reason for missing an installment payment, while concerns about “hidden charges” were cited as a leading barrier to consumer adoption overall. Mastercard Installments addresses these concerns with a suite of unique, innovative services that increases transparency and helps protect consumers and businesses. These services include: Cutting-edge insights and analytics: Merchants and lenders are able to access a comprehensive set of data dashboards to better understand how their products are performing. Mastercard Test & Learn® technology can also pinpoint where to prioritize efforts and resources that enhance the user experience and drive successful loan repayment. Mitigating repayment risk with open banking and AI: In the U.S., using consumer-permissioned data and open banking technology, lenders can identify behavioral patterns to reduce the risk of failed payments while artificial intelligence can adjust models more quickly and accurately for success. Dedicated and embedded consumer protections: To participate in the Mastercard Installments program, lenders agree to follow applicable laws and network guidelines on responsible lending practices and data usage practices, among others. Consumers and U.S. small businesses enjoy the peace of mind that they get today from any other Mastercard product – including tokenization, dispute resolution, and zero fraud liability. Empowering U.S. Small Businesses Mastercard research shows that over 70% of small business owners who have used personal installments are likely to adopt business installments products if they become available.[ii] Meeting this demand in the U.S., Live Oak Bank, the nation’s leading small business lender, will support the program, with the goal to make Mastercard Installments available to its 7,000 small business customers.iii This builds on Mastercard’s ongoing commitment to Main Street America, delivering products and services that help improve operational efficiency, manage cash flow and maximize customer connections with financial tools. Learn more about Mastercard Installments and its range of benefits for consumers, merchants and acquiring banks, lenders, as well as wallets and BNPL players. Madhu Kejriwal, Group Head, Unsecured Lending & Partnerships, HSBC Wealth & Personal Banking, said, “Customer expectations have evolved as the payments landscape has advanced, so banks need to find appropriate solutions. Buy-Now-Pay-Later (BNPL) lies at the intersection of payments and lending; it can provide customers with a seamless payment option. However, it’s important to realize that it’s very much a form of credit. HSBC is fully committed to responsible lending, and providing transparency to customers is of utmost importance to us. We want to clearly position any BNPL payment plan as part of a customer’s approved credit line. Our partnership with Mastercard is a crucial element of HSBC UK’s responsible lending strategy, as it enables us to provide customers with access to trusted payment options when they want to budget for larger purchases with affordable payment plans.” Huntley Garriott, President of Live Oak Bank, said, “Live Oak knows small business customers need flexible financial products that provide security, transparency and scalability so they can grow their business at the pace that suits their needs. We are excited to partner with Mastercard to explore lending solutions through the Mastercard Installments program as it allows us to deliver innovative products from a trusted source while aligning with our mission to be America’s small business bank.” Martin Wise, Managing Director, Short-Term Borrowing at NatWest, said, “There’s a clear demand for buy now, pay later and we are determined to make it better and safer for our customers. By working closely with Mastercard, we are ensuring responsible measures such as clear affordability checks and useful tools, such as payment reminders to help customers budget, are at the heart of our solution.” Majed Hamdan Al Ghamdi, Chief Executive Officer of Retail Bank at the Saudi National Bank, said, “Flexible payment options benefit everyone in the ecosystem, and our partnership with Mastercard enables us to connect people in Saudi Arabia to the seamless benefits of Mastercard Installments. Through this initiative, we are providing consumers with enhanced ways to pay when and where they want and in line with their budget needs. Underpinned by the renowned security of the Mastercard network, Mastercard Installments opens up new shopping experiences to consumers across the Kingdom while offering them reassurance, confidence and peace of mind.” Sources: About Mastercard (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com",
    "url": "https://www.businesswire.com/news/home/20220728005264/en/Mastercard-Installments-Gains-Traction-with-New-Global-Partners-and-Support-for-Small-Businesses",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T10:15:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 10:15:00",
    "publisher": "Business Wire",
    "title": "Mastercard Installments Gains Traction with New Global Partners and Support for Small Businesses",
    "image": "https://images.financialmodelingprep.com/news/mastercard-installments-gains-traction-with-new-global-partners-and-20220728.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard has welcomed a raft of new global partners to its innovative Mastercard Installments program and is expanding it further to support small businesses in the U.S. Illustrating the demand for powerful buy now, pay later (BNPL) experiences from familiar and trusted brands, several new partners are providing support for the program, including HSBC, J.P.Morgan and NatWest in the U.K.; Cross River Bank, Evolve Bank & Trust, Jifiti, Live Oak Bank, MOCA Fi",
    "url": "https://www.businesswire.com/news/home/20220728005264/en/Mastercard-Installments-Gains-Traction-with-New-Global-Partners-and-Support-for-Small-Businesses/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T10:15:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 10:58:07",
    "publisher": "Zacks Investment Research",
    "title": "MasterCard (MA) Q2 Earnings and Revenues Surpass Estimates",
    "image": "https://images.financialmodelingprep.com/news/mastercard-ma-q2-earnings-and-revenues-surpass-estimates-20220728.jpg",
    "site": "zacks.com",
    "text": "MasterCard (MA) delivered earnings and revenue surprises of 8.47% and 4.28%, respectively, for the quarter ended June 2022. Do the numbers hold clues to what lies ahead for the stock?",
    "url": "https://www.zacks.com/stock/news/1959506/mastercard-ma-q2-earnings-and-revenues-surpass-estimates",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T10:58:07-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 11:02:51",
    "publisher": "CNBC",
    "title": "Consumer spending is slowing, but there are still pockets of strength in these three sectors",
    "image": "https://images.financialmodelingprep.com/news/consumer-spending-is-slowing-but-there-are-still-pockets-20220728.jpeg",
    "site": "cnbc.com",
    "text": "Despite new signs of slowing consumer demand, pockets of strength remain in travel, payments and autos.",
    "url": "https://www.cnbc.com/2022/07/28/consumer-spending-remains-strong-in-these-three-sectors.html",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T11:02:51-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 12:04:27",
    "publisher": "InvestorPlace",
    "title": "Why Is Mastercard (MA) Stock in the Spotlight Today?",
    "image": "https://images.financialmodelingprep.com/news/why-is-mastercard-ma-stock-in-the-spotlight-today-20220728.jpg",
    "site": "investorplace.com",
    "text": "Payments giant Mastercard (NYSE: MA ) just announced its results for 2022's second quarter. The implications could extend beyond the company's finances, though.",
    "url": "https://investorplace.com/2022/07/why-is-mastercard-ma-stock-in-the-spotlight-today/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T12:04:27-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 13:16:19",
    "publisher": "Zacks Investment Research",
    "title": "Mastercard's (MA) Q2 Earnings Beat on Solid Cross-Border Volume",
    "image": "https://images.financialmodelingprep.com/news/mastercards-ma-q2-earnings-beat-on-solid-crossborder-volume-20220728.jpg",
    "site": "zacks.com",
    "text": "Mastercard's (MA) second-quarter results reflect solid growth in cross-border volume and higher GDV, partly offset by increased operating expenses.",
    "url": "https://www.zacks.com/stock/news/1960016/mastercard-s-ma-q2-earnings-beat-on-solid-cross-border-volume",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T13:16:19-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 13:50:48",
    "publisher": "PYMNTS",
    "title": "Mastercard Results Detail Spending ‘Shift' by Consumers Amid Inflation",
    "image": "https://images.financialmodelingprep.com/news/mastercard-results-detail-spending-shift-by-consumers-amid-inflation-20220728.jpg",
    "site": "pymnts.com",
    "text": "It's becoming a familiar theme — the U.S. consumer is resilient, and spending is buoyant and of course, the wild card is how long it will all last.",
    "url": "https://www.pymnts.com/earnings/2022/mastercard-results-detail-spending-shift-by-consumers-amid-inflation/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T13:50:48-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 14:15:23",
    "publisher": "Seeking Alpha",
    "title": "Mastercard Incorporated (MA) CEO Michael Miebach on Q2 2022 Results - Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-ma-ceo-michael-miebach-on-q2-2022-20220728.jpg",
    "site": "seekingalpha.com",
    "text": "Mastercard Incorporated (NYSE:MA ) Q2 2022 Earnings Conference Call July 28, 2022 9:00 AM ET Company Participants Warren Kneeshaw - Head of Investor Relations Michael Miebach - Chief Executive Officer Sachin Mehra - Chief Financial Officer Conference Call Participants Harshita Rawat - Bernstein Sanjay Sakhrani - KBW Rayna Kumar - UBS Darrin Peller - Wolfe Research Lisa Ellis - MoffettNathanson Tien-Tsin Huang - JPMorgan David Togut - Evercore ISI Ramsey El-Assal - Barclays Dave Koning - Baird Bryan Keane - Deutsche Bank Jason Kupferberg - Bank of America Bob Napoli - William Blair Operator Good morning and welcome to the Mastercard Inc. Q2 2022 Earnings Conference Call. All lines have been placed on mute to prevent any background noise.",
    "url": "https://seekingalpha.com/article/4527004-mastercard-incorporated-ma-ceo-michael-miebach-on-q2-2022-results-earnings-call-transcript",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T14:15:23-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 15:36:00",
    "publisher": "The Motley Fool",
    "title": "Recession? Inflation? Mastercard Isn't Seeing it Yet",
    "image": "https://images.financialmodelingprep.com/news/recession-inflation-mastercard-isnt-seeing-it-yet-20220728.jpg",
    "site": "fool.com",
    "text": "Despite macro headwinds, Mastercard is seeing healthy consumer spending activity.",
    "url": "https://www.fool.com/investing/2022/07/28/recession-inflation-mastercard-isnt-seeing-it-yet/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T15:36:00-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 19:00:38",
    "publisher": "InvestorPlace",
    "title": "7 Warren Buffett Stocks Trading at a Huge Discount Right Now",
    "image": "https://images.financialmodelingprep.com/news/7-warren-buffett-stocks-trading-at-a-huge-discount-20220728.jpg",
    "site": "investorplace.com",
    "text": "Even the best of us make mistakes or dive into an investment too early, which explains the concept of Warren Buffett stocks trading at discount. Though investors tend to hang on every word that comes out of the “Oracle of Omaha's” mouth, he has never been one to attempt to time the market with the precision of a laser-guided bomb.",
    "url": "https://investorplace.com/warren-buffett-stocks-trading-at-a-discount/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T19:00:38-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-28 20:43:07",
    "publisher": "PYMNTS",
    "title": "PayPal, Mastercard, Citi and Others Join New Economic Opportunity Coalition",
    "image": "https://images.financialmodelingprep.com/news/paypal-mastercard-citi-and-others-join-new-economic-opportunity-20220728.jpg",
    "site": "pymnts.com",
    "text": "PayPal has joined the White House's new Economic Opportunity Coalition (EOC) to address economic disparities and move things forward for various underserved communities, the company said in a press release Thursday (July 28). The coalition will include 21 corporations and three foundations, working on aligning major investments for communities of color.",
    "url": "https://www.pymnts.com/financial-inclusion-3/2022/paypal-mastercard-citi-and-others-join-new-economic-opportunity-coalition/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-28T20:43:07-04:00",
    "date_et": "2022-07-28"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-07-29 16:56:35",
    "publisher": "Seeking Alpha",
    "title": "Mastercard: Consumer Strength And Travel Recovery Continued In Q2",
    "image": "https://images.financialmodelingprep.com/news/mastercard-consumer-strength-and-travel-recovery-continued-in-q2-20220729.jpg",
    "site": "seekingalpha.com",
    "text": "Q2 again saw consumer strength and Travel recovery for Mastercard; switched volume grew 26% and Travel volume grew 154%. Mastercard revenue grew 21% year-on-year, despite currency and Russia-related headwinds, and EPS grew 32% year-on-year.",
    "url": "https://seekingalpha.com/article/4527626-mastercard-consumer-strength-and-travel-recovery-continued-in-q2",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-07-29T16:56:35-04:00",
    "date_et": "2022-07-29"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-02 17:39:53",
    "publisher": "GuruFocus",
    "title": "5 Credit Service Companies With High GF Scores",
    "image": "https://images.financialmodelingprep.com/news/5-credit-service-companies-with-high-gf-scores-20220802.jpg",
    "site": "gurufocus.com",
    "text": "In light of credit card balances surging at the highest rate in over 20 years, five credit service companies with high GF Scores and are modestly undervalued based on GF Value are Visa Inc. ( V , Financial), Mastercard Inc. ( MA , Financial), Capital One Financial Corp. ( COF , Financial), Credit Acceptance Corp. ( CACC , Financial) and Regional Management Corp. ( RM , Financial) according to the All-in-One Screener, a Premium feature of GuruFocus.",
    "url": "https://www.gurufocus.com/news/1841423/5-credit-service-companies-with-high-gf-scores",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-02T17:39:53-04:00",
    "date_et": "2022-08-02"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-03 06:31:00",
    "publisher": "The Motley Fool",
    "title": "3 Reasons to Load Up On Mastercard Stock Right Now",
    "image": "https://images.financialmodelingprep.com/news/3-reasons-to-load-up-on-mastercard-stock-right-20220803.jpg",
    "site": "fool.com",
    "text": "After a couple of years of hiatus, Mastercard is back to delivering superior investor returns.",
    "url": "https://www.fool.com/investing/2022/08/03/3-reasons-to-load-up-on-mastercard-stock-right-now/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-03T06:31:00-04:00",
    "date_et": "2022-08-03"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-04 09:01:00",
    "publisher": "Business Wire",
    "title": "Mastercard SpendingPulse: U.S. Consumers Continued to Spend in July While Navigating High Inflation",
    "image": "https://images.financialmodelingprep.com/news/mastercard-spendingpulse-us-consumers-continued-to-spend-in-july-20220804.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)-- #Consumer--According to Mastercard SpendingPulseTM, which measures in-store and online retail sales across all forms of payment, U.S. retail spending excluding automotive increased +11.2% year-over-year in July, while retail sales excluding automotive and gas rose +9.0%. Notably, e-commerce sales were up 11.7% YOY, a sharp increase after months of softer growth. Rising prices—particularly for necessities such as food and fuel—were a contributing factor, as Mastercard Spend",
    "url": "https://www.businesswire.com/news/home/20220803005938/en/Mastercard-SpendingPulse-U.S.-Consumers-Continued-to-Spend-in-July-While-Navigating-High-Inflation/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-04T09:01:00-04:00",
    "date_et": "2022-08-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-04 17:16:00",
    "publisher": "Reuters",
    "title": "Mastercard, Visa suspend ties with ad arm of Pornhub owner MindGeek",
    "image": "https://images.financialmodelingprep.com/news/mastercard-visa-suspend-ties-with-ad-arm-of-pornhub-20220804.jpg",
    "site": "reuters.com",
    "text": "Visa and Mastercard on Thursday said they had suspended ties with the advertisement arm of MindGeek, owner of pornography website Pornhub, after a lawsuit alleged raised questions over whether payments companies could be facilitating child pornography.",
    "url": "https://www.reuters.com/business/finance/mastercard-visa-suspend-ties-with-ad-arm-pornhub-owner-mindgeek-2022-08-04/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-04T17:16:00-04:00",
    "date_et": "2022-08-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-04 18:53:00",
    "publisher": "Business Wire",
    "title": "CORRECTING and REPLACING PHOTO Mastercard SpendingPulse: U.S. Consumers Continued to Spend in July While Navigating High Inflation",
    "image": "https://images.financialmodelingprep.com/news/correctingand-replacingphoto-mastercard-spendingpulse-us-consumers-continued-to-spend-20220804.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)-- #Consumer--Please replace the photo with the accompanying corrected photo. The release reads: MASTERCARD SPENDINGPULSE: U.S. CONSUMERS CONTINUED TO SPEND IN JULY WHILE NAVIGATING HIGH INFLATION E-commerce growth sees a hot July amid promotional events, while home-focused spending cools According to Mastercard SpendingPulseTM, which measures in-store and online retail sales across all forms of payment, U.S. retail spending excluding automotive increased +11.2% year-over-yea",
    "url": "https://www.businesswire.com/news/home/20220803005938/en/CORRECTING%C2%A0and-REPLACING%C2%A0PHOTO-Mastercard-SpendingPulse-U.S.-Consumers-Continued-to-Spend-in-July-While-Navigating-High-Inflation/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-04T18:53:00-04:00",
    "date_et": "2022-08-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-04 18:53:00",
    "publisher": "Business Wire",
    "title": "CORRECTING and REPLACING PHOTO Mastercard SpendingPulse: U.S. Consumers Continued to Spend in July While Navigating High Inflation",
    "image": "https://images.financialmodelingprep.com/news/correctingand-replacingphoto-mastercard-spendingpulse-us-consumers-continued-to-spend-in-20220804.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Please replace the photo with the accompanying corrected photo. The release reads: MASTERCARD SPENDINGPULSE: U.S. CONSUMERS CONTINUED TO SPEND IN JULY WHILE NAVIGATING HIGH INFLATION E-commerce growth sees a hot July amid promotional events, while home-focused spending cools According to Mastercard SpendingPulseTM, which measures in-store and online retail sales across all forms of payment, U.S. retail spending excluding automotive increased +11.2% year-over-year in July, while retail sales excluding automotive and gas rose +9.0%. Notably, e-commerce sales were up 11.7% YOY, a sharp increase after months of softer growth. Rising prices—particularly for necessities such as food and fuel—were a contributing factor, as Mastercard SpendingPulse reflects nominal spending and is not adjusted for inflation. Spending increases in July outpaced monthly year-over-year growth experienced thus far in 2022, with demand and higher prices both contributing factors. Of note: Consumers continue to spend, with inflation’s impact varying across sectors: Consumers continue to navigate high inflation as they spend on wants and needs. The Grocery sector, for instance, saw sales up +16.8% YOY in July due primarily to food price increases. On the other hand, Apparel (+16.6%) and Jewelry (+18.6%) sales saw strong demand-driven year-over-year growth, well outpacing sector-specific inflation. E-commerce sales climb amid major promotional events: While in-store sales remain elevated, up +11.1% YOY/ +13.9% YO3Y, e-commerce posted its first month of double-digit sales growth (+11.7% YOY) since December. E-commerce is up nearly double pre-pandemic levels (+98.5% YO3Y). Online sales have ticked up since the beginning of June, though July’s major promotional events helped entice shoppers to splurge (and save) with online deals. High season for vacation, with road-trippers seeing some relief at the pump: Travel remains a priority, with Lodging up +29.6% YOY and Airline sales up+13.3% YOY. Fuel & Convenience spending remains elevated (+32.3% YOY / +47.1% YO3Y), though the growth rate is down compared to June – reflecting price declines at the pump. “The latest retail trends place an emphasis on consumer choice and passion driven spending – they’re hunting for deals, shopping across channels and ultimately still spending on experiences and goods that make them feel good,” said Steve Sadove, senior advisor for Mastercard and former CEO and Chairman of Saks Incorporated. “As retailers grapple with excess inventory and supply chain constraints, it’s likely that the promotional activity seen in July will continue to be an important strategy for retailers.” Mastercard Economics Institute: Housing market cooldown slows sales of home-related goods After heating up during the pandemic, the U.S. housing market has cooled considerably since the beginning of 2022, influencing consumer spending on home-related goods. Each time a home changes hands, there is usually a significant amount of spending as consumers outfit their new abode. But with significant interest rate hikes resulting in fewer homes sold, this has been translating to a natural decline in home-related purchases, as reflected in this month’s SpendingPulse. Sales growth for the Home Improvement (+2.9%) and Furniture & Furnishings sectors (+5.0%) has slowed. “Consumers’ purchasing power has been strained by higher prices, particularly for the most fundamental needs-based categories like food and energy,” said Michelle Meyer, U.S. chief economist, Mastercard Economics Institute. “Thus far, nominal spending remains strong as consumers cope with high price inflation. As we continue to look at the strength of the consumer, we will be keenly focused on trends surrounding employment and wage growth.” For additional insights about today’s housing trends and the economic impact across the country, see the Mastercard Economic Institute’s latest findings in A View on US Housing: Today and Tomorrow. About Mastercard SpendingPulse Mastercard SpendingPulse™ reports on national retail sales across all payment types in select markets around the world. The findings are based on aggregate sales activity in the Mastercard payments network, coupled with survey-based estimates for certain other payment forms, such as cash and check. As such, SpendingPulse™ insights do not in any way contain, reflect or relate to actual Mastercard operational or financial performance, or specific payment-card-issuer data. Mastercard SpendingPulse defines “U.S. retail sales” as sales at retailers and food services merchants of all sizes. Sales activity within the services sector (for example, travel services such as airlines and lodging) are not included. About Mastercard (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com",
    "url": "https://www.businesswire.com/news/home/20220803005938/en/CORRECTING%C2%A0and-REPLACING%C2%A0PHOTO-Mastercard-SpendingPulse-U.S.-Consumers-Continued-to-Spend-in-July-While-Navigating-High-Inflation",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-04T18:53:00-04:00",
    "date_et": "2022-08-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-05 09:29:43",
    "publisher": "Stockmarket.com",
    "title": "3 Fintech Stocks To Watch In August 2022",
    "image": "https://images.financialmodelingprep.com/news/3-fintech-stocks-to-watch-in-august-2022-20220805.jpg",
    "site": "stockmarket.com",
    "text": "Check out these three top fintech stocks for your August 2022 watchlist.",
    "url": "https://stockmarket.com/featured/3-fintech-stocks-to-watch-in-august-2022-2022-08-05",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-05T09:29:43-04:00",
    "date_et": "2022-08-05"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-08 09:00:00",
    "publisher": "PRNewsWire",
    "title": "REI Co-op and Capital One Announce New REI Co-op Mastercard",
    "image": "https://images.financialmodelingprep.com/news/rei-coop-and-capital-one-announce-new-rei-coop-20220808.jpg",
    "site": "prnewswire.com",
    "text": "The partnership supports both companies' values, while providing enhanced rewards and benefits for co-op members  and the outdoor community MCLEAN, Va. , Aug. 8, 2022 /PRNewswire/ -- Today, REI Co-op, the largest consumer co-op and outdoor specialty retailer in the United States, and Capital One, introduced their card partnership and launched the new REI Co-op® Mastercard® program.",
    "url": "https://www.prnewswire.com/news-releases/rei-co-op-and-capital-one-announce-new-rei-co-op-mastercard-301601446.html",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-08T09:00:00-04:00",
    "date_et": "2022-08-08"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-08 14:18:15",
    "publisher": "Zacks Investment Research",
    "title": "Looking for a Growth Stock? 3 Reasons Why MasterCard (MA) is a Solid Choice",
    "image": "https://images.financialmodelingprep.com/news/looking-for-a-growth-stock-3-reasons-why-mastercard-20220808.jpg",
    "site": "zacks.com",
    "text": "MasterCard (MA) could produce exceptional returns because of its solid growth attributes.",
    "url": "https://www.zacks.com/stock/news/1965536/looking-for-a-growth-stock-3-reasons-why-mastercard-ma-is-a-solid-choice",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-08T14:18:15-04:00",
    "date_et": "2022-08-08"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-10 05:06:00",
    "publisher": "The Motley Fool",
    "title": "5 of the Safest Warren Buffett Stocks You Can Confidently Buy Right Now",
    "image": "https://images.financialmodelingprep.com/news/5-of-the-safest-warren-buffett-stocks-you-can-20220810.jpg",
    "site": "fool.com",
    "text": "Following in the Oracle of Omaha's footsteps has been making investors richer for decades.",
    "url": "https://www.fool.com/investing/2022/08/10/5-safest-warren-buffett-stocks-you-can-buy-now/",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-10T05:06:00-04:00",
    "date_et": "2022-08-10"
  },
  {
    "symbol": "MA",
    "publishedDate": "2022-08-11 10:32:46",
    "publisher": "Zacks Investment Research",
    "title": "5 Stocks With High ROE to Buy on Downtrend in Inflation Data",
    "image": "https://images.financialmodelingprep.com/news/5-stocks-with-high-roe-to-buy-on-downtrend-20220811.jpg",
    "site": "zacks.com",
    "text": "Marriott (MAR), Mastercard (MA), Builders FirstSource (BLDR), Rockwell (ROK) and ON Semiconductor (ON) are some of the stocks with high ROE to profit as inflation shows signs of cooling.",
    "url": "https://www.zacks.com/stock/news/1967107/5-stocks-with-high-roe-to-buy-on-downtrend-in-inflation-data",
    "ticker": "MA",
    "event_date": "2022-07-28",
    "window_start": "2022-07-14",
    "window_end": "2022-08-11",
    "publishedDateET": "2022-08-11T10:32:46-04:00",
    "date_et": "2022-08-11"
  }
]