{"symbol": "MA", "publishedDate": "2022-10-14 05:35:00", "publisher": "The Motley Fool", "title": "Ready for Long-Term Growth? You Can't Go Wrong With These 3 Stocks", "image": "https://images.financialmodelingprep.com/news/ready-for-longterm-growth-you-cant-go-wrong-with-these-20221014.jpg", "site": "fool.com", "text": "Some businesses are not only built to last, but built to thrive in any and all environments.", "url": "https://www.fool.com/investing/2022/10/14/ready-for-long-term-growth-cant-go-wrong-stocks/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-14T05:35:00-04:00", "date_et": "2022-10-14"}
{"symbol": "MA", "publishedDate": "2022-10-17 19:39:43", "publisher": "24/7 Wall Street", "title": "Mastercard to Help Banks Offer Crypto Trading to Clients With Pilot Project", "image": "https://images.financialmodelingprep.com/news/mastercard-to-help-banks-offer-crypto-trading-to-clients-20221017.jpg", "site": "247wallst.com", "text": "Mastercard is planning to launch a project in 2023 that allows banks and financial institutions to provide crypto trading services to their clients, according to a CNBC report.", "url": "https://247wallst.com/investing/2022/10/17/mastercard-to-help-banks-offer-crypto-trading-to-clients-with-pilot-project/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T19:39:43-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 16:58:33", "publisher": "Fox Business", "title": "Visa, Mastercard draw new government scrutiny over debit-card routing", "image": "https://images.financialmodelingprep.com/news/visa-mastercard-draw-new-government-scrutiny-over-debitcard-routing-20221017.jpg", "site": "foxbusiness.com", "text": "Visa and Mastercard are being investigated by the Federal Trade Commission over their methods of routing digital transactions involving security tokens.", "url": "https://www.foxbusiness.com/markets/visa-mastercard-draw-new-government-scrutiny-over-debit-card-routing", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T16:58:33-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 14:22:00", "publisher": "Market Watch", "title": "Visa, Mastercard facing FTC probe over debit-card competition on online payments", "image": "https://images.financialmodelingprep.com/news/visa-mastercard-facing-ftc-probe-over-debitcard-competition-on-20221017.jpg", "site": "marketwatch.com", "text": "The Federal Trade Commission is investigating whether Visa Inc. and Mastercard Inc.'s security tokens restrict debit-card routing competition on online payments, according to people familiar with the matter.", "url": "https://www.marketwatch.com/story/visa-mastercard-facing-ftc-probe-over-debit-card-competition-on-online-payments-11666030970", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T14:22:00-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 12:39:00", "publisher": "The Wall Street Journal", "title": "Visa, Mastercard Draw New Government Scrutiny", "image": "https://images.financialmodelingprep.com/news/visa-mastercard-draw-new-government-scrutiny-20221017.jpg", "site": "wsj.com", "text": "The Federal Trade Commission is examining whether the companies' security tokens prevent online debit-card payments from going over other networks, according to people familiar with the matter.", "url": "https://www.wsj.com/articles/visa-mastercard-draw-new-government-scrutiny-over-debit-card-routing-11666024794", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T12:39:00-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 11:02:57", "publisher": "Forbes", "title": "Mastercard Is Bringing Crypto Trading To Your Bank", "image": "https://images.financialmodelingprep.com/news/mastercard-is-bringing-crypto-trading-to-your-bank-20221017.jpg", "site": "forbes.com", "text": "The program will see Mastercard act as a middleman between banks and crypto trading platform Paxos.", "url": "https://www.forbes.com/sites/qai/2022/10/17/mastercard-is-bringing-crypto-trading-to-your-bank/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T11:02:57-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 11:02:43", "publisher": "Kitco", "title": "Mastercard launches platform to help banks offer crypto trading", "image": "https://images.financialmodelingprep.com/news/mastercard-launches-platform-to-help-banks-offer-crypto-trading-20221017.jpg", "site": "kitco.com", "text": "(Kitco News) - Mastercard announces Crypto Source, a new program that will enable financial institutions to begin offering secure crypto trading services to their customers.", "url": "https://www.kitco.com/news/2022-10-17/Mastercard-launches-platform-to-help-banks-offer-crypto-trading.html", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T11:02:43-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 08:52:05", "publisher": "Market Watch", "title": "Mastercard offers crypto trading to financial customers via alliance with Paxos Trust Co.", "image": "https://images.financialmodelingprep.com/news/mastercard-offers-crypto-trading-to-financial-customers-via-alliance-20221017.jpg", "site": "marketwatch.com", "text": "Mastercard Inc. MA, -1.79% shares rose 3.9% on Monday after it said it's launching Crypto Source, a program to help financial institutions offer secure crypto trading capabilities and services to their customers. Mastercard's financial institution partners will be able to engage in buy, hold and sell services for select crypto assets.", "url": "https://www.marketwatch.com/story/mastercard-offers-crypto-trading-to-financial-customers-via-alliance-with-paxos-trust-co-2022-10-17", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T08:52:05-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 08:30:00", "publisher": "Business Wire", "title": "Mastercard to bring crypto trading capabilities to banks", "image": "https://images.financialmodelingprep.com/news/mastercard-to-bring-crypto-trading-capabilities-to-banks-20221017.png", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard today introduces Crypto SourceTM, a new program to enable financial institutions to bring secure crypto trading capabilities and services to their customers. The 2022 Mastercard New Payments Index reported that 29% of respondents globally hold cryptocurrency as an investment, with another 65% indicating a preference for crypto-related services to be provided by their current trusted financial institution.* In partnership with regulated and licensed crypto custody providers, Mastercard's financial institution partners will gain access to a comprehensive suite of buy, hold and sell services for select crypto assets, augmented with proven identity, cyber, security and advisory services. This Crypto Source offering is complemented by Mastercard Crypto SecureTM to bring additional security to the crypto ecosystem and support card issuers in their compliance with complex regulations. Now, Mastercard’s suite of crypto-related offerings for banks and fintechs includes: Technology and partnership support to enable buy, hold and sell of select crypto assets Security management including Mastercard’s identity solutions, crypto analytics, transaction monitoring, anti-money laundering, ‘Know Your Business’ and lifecycle stages, cybersecurity, and biometrics Crypto spend and cash out capabilities offered through a range of products, including crypto cards, open banking and cross border services. Financial institutions would also be able to offer additional functionality using Mastercard’s technology such as digital receipts and loyalty solutions Crypto program management including program design, product development and technology implementation, as well as go-to-market optimization and marketing consultancy services, providing end-to-end support for banks, fintechs and issuers to offer crypto programs at scale “At Mastercard, trust is our business. What we are announcing today is a connected approach to services that will help bring users safely and securely into the crypto ecosystem. Our recent investments in this space, such as the acquisition of CipherTrace and Ekata, are providing us with a unique set of capabilities to help provide our customers and consumers with the most technically advanced solutions available in the market,” said Ajay Bhalla, President, Cyber & Intelligence at Mastercard. To support this program, Mastercard is expanding its partnership and work with Paxos Trust Company, a leading regulated blockchain infrastructure platform. The partnership aims for Paxos to provide crypto-asset trading and custody services on behalf of the banks, while Mastercard will leverage its technology to integrate those capabilities into banks’ interfaces, resulting in a seamless experience for the consumer. “Our commitment is simple – to explore crypto and the underlying digital assets technology to support consumer choice in payments. Today is an exciting step in our crypto journey that draws on the strengths of our global businesses, from open banking and identity verification to analytics and fraud monitoring to settlement solutions. We’re excited to build on our long-term partnership with Paxos – co-innovating to bring safe and secure technology to financial institutions. Our crypto product innovations will provide choice at scale and continue to bring one-of-a-kind opportunities to financial institutions as they seek to offer new, advanced services to their customers,” said Jorn Lambert, Chief Digital Officer at Mastercard. “Mastercard has a powerful network of financial institutions around the world. This exciting offering developed by Paxos and Mastercard will give FIs the fastest and most trusted way to offer safe, reliable crypto access for their consumers globally. We’re thrilled to partner with Mastercard to further accelerate the mainstream adoption of digital assets,” said Walter Hessert, Head of Strategy at Paxos. Over the past few years, Mastercard has been working alongside its customers and partners to bring new services and capabilities that help make crypto more accessible, safe and secure. These efforts have been complemented with the addition of new technologies through Finicity, Ekata, RiskRecon and CipherTrace. This unique combination of services provides eligible financial institutions the opportunity to directly manage crypto asset investments for consumers. Mastercard also continues to support banks, governments and others through its Crypto & Digital Currencies Consulting Services. Mastercard Crypto Source is currently being prepared for pilot programs. Additional details on broader availability will be made available at a later date. Source: *Research conducted by The Harris Poll and Mastercard Global Foresights, Insights and Analytics from March 21 to April 21, 2022. Online interviews were conducted among 35,040 global adults (17,071 women, 17,969 men) and includes nationally representative samples from markets across 5 regions. About Mastercard (NYSE:MA): Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com Mastercard Crypto and Blockchain", "url": "https://www.businesswire.com/news/home/20221017005547/en/Mastercard-to-bring-crypto-trading-capabilities-to-banks", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T08:30:00-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-17 08:30:00", "publisher": "Business Wire", "title": "Mastercard to bring crypto trading capabilities to banks", "image": "https://images.financialmodelingprep.com/news/mastercard-to-bring-crypto-trading-capabilities-to-banks-20221017.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.", "url": "https://www.businesswire.com/news/home/20221017005547/en/Mastercard-to-bring-crypto-trading-capabilities-to-banks/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-17T08:30:00-04:00", "date_et": "2022-10-17"}
{"symbol": "MA", "publishedDate": "2022-10-19 17:55:10", "publisher": "InvestorPlace", "title": "A “Generational” Turning Point in Stocks", "image": "https://images.financialmodelingprep.com/news/a-generational-turning-point-in-stocks-20221019.jpg", "site": "investorplace.com", "text": "Why Luke believes the bear market is over", "url": "https://investorplace.com/2022/10/a-generational-turning-point-in-stocks/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-19T17:55:10-04:00", "date_et": "2022-10-19"}
{"symbol": "MA", "publishedDate": "2022-10-20 14:15:31", "publisher": "Reuters", "title": "Visa, Mastercard profits expected to jump as travel rebounds", "image": "https://images.financialmodelingprep.com/news/visa-mastercard-profits-expected-to-jump-as-travel-rebounds-20221020.jpg", "site": "reuters.com", "text": "U.S. card companies are expected to benefit as pandemic-weary consumers continue to fuel demand for travel, one of the biggest contributors to revenue, despite rising inflation.", "url": "https://www.reuters.com/business/finance/visa-mastercard-profits-expected-jump-travel-rebounds-2022-10-20/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-20T14:15:31-04:00", "date_et": "2022-10-20"}
{"symbol": "MA", "publishedDate": "2022-10-22 05:06:00", "publisher": "The Motley Fool", "title": "Nasdaq Bear Market: 5 Terrific Growth Stocks You'll Regret Not Buying on the Dip", "image": "https://images.financialmodelingprep.com/news/nasdaq-bear-market-5-terrific-growth-stocks-youll-regret-20221022.jpg", "site": "fool.com", "text": "These bargain-priced growth stocks are ripe for the picking with the Nasdaq Composite plunging by as much as 38%.", "url": "https://www.fool.com/investing/2022/10/22/nasdaq-bear-market-5-growth-stocks-regret-not-buy/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-22T05:06:00-04:00", "date_et": "2022-10-22"}
{"symbol": "MA", "publishedDate": "2022-10-24 15:03:09", "publisher": "Zacks Investment Research", "title": "Mastercard (MA) Gears Up for Q3 Earnings: What Lies Ahead?", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-gears-up-for-q3-earnings-what-lies-20221024.jpg", "site": "zacks.com", "text": "Mastercard's (MA) third-quarter results are likely to reflect higher GDV and cross-border volumes.", "url": "https://www.zacks.com/stock/news/1996305/mastercard-ma-gears-up-for-q3-earnings-what-lies-ahead", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-24T15:03:09-04:00", "date_et": "2022-10-24"}
{"symbol": "MA", "publishedDate": "2022-10-24 10:00:00", "publisher": "Business Wire", "title": "Mastercard Teams up With Marvel Studios’ Black Panther: Wakanda Forever to Spotlight Small Business Superheroes", "image": "https://images.financialmodelingprep.com/news/mastercard-teams-up-with-marvel-studios-black-panther-wakanda-20221024.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard announced today its collaboration with Marvel Studios’ “Black Panther: Wakanda Forever”, in theaters November 11, to spotlight Black excellence and the irrepressible strength of Black women – both on and off the screen. With Priceless experiences, digital engagements and shoppable content that supports and celebrates the superpowers of Black business leaders, Mastercard is honoring the film’s inspiring message that the spirit of Wakanda is all around us. “Through representation and access to tools and resources, Mastercard is proud to honor the Black women-owned businesses that strive for success despite the systemic inequalities they face every day,” said Rustom Dastoor, EVP of Marketing and Communications, Mastercard North America. “When we see role models that look like us, which the film so impactfully demonstrates, it expands our sense of what’s possible, including a more diverse, inclusive economic future.” In a Wakanda-inspired commercial spot and supporting campaign, Egypt Otis, the owner of Comma Bookstore & Social Hub – a Flint, Michigan small business that specializes in Black and Brown literature, art and music – stars as a real-life superhero by being a role model to a young shopper. The girl realizes through her imagination and interaction with Egypt that superheroes are all around us, igniting excitement for the film, her ambition for the future, and the belief that she herself has that same potential. “To serve as the face of possibility for aspiring Black women and young girls makes me feel like a superhero of sorts – just for living my truth,” said Otis. “Mastercard’s Strivers Initiative has provided me the resources and platform to help my business thrive and further empower our community, which to me is truly priceless.” Mastercard’s support of the film is an extension of the company’s $500 million commitment to helping close the racial wealth and economic gap in the U.S. by supporting Black women-owned businesses through its Strivers Initiative, and partnerships with HBCUs and youth groups around the country, as well as Mastercard’s sustained efforts to build a more inclusive digital economy by providing the digital tools to help small businesses get online and thrive. In celebration of the film, select small business owners and youth groups will enjoy exclusive screenings in New York City and Atlanta ahead of the film’s release. Designed to create a multisensory experience, the screenings will feature film-inspired décor, photo opportunities, celebratory food and drink options, a Hall of Heroes video installation honoring attendees and other entrepreneurs, free branded swag and more. Separately, Mastercard is launching various Priceless engagements and shoppable activations, including: Mastercard Small Biz Marketplace (Instagram): Consumers can discover a reimagined shoppable social experience of exclusively Black women-owned small businesses and products from across the country with opportunities to shop, share & support them directly on Instagram. Social Content Community Series: Unlocking even more consumer power, Mastercard will feature Talia R. Boone, founder of Los Angeles based immersive floral wellness service Postal Petals®, Jean Brownhill, founder of online contractor network for Minority and Women-owned Business Enterprises Sweeten Enterprise, and Mandy Bowman, founder of the Black-owned business marketplace Official Black Wall Street - in a content series across social platforms, that illustrates their journey to success and impact they make through their business. The Mastercard Small Business Metaverse: in November 2022, Mastercard will launch an immersive virtual reality experience in Meta Horizon Worlds to connect consumers to a world where they can discover a variety of Black-owned small businesses and participate in activities designed to bring to life their unique stories and entrepreneurial journeys. This will be both a space for consumers to engage and learn about new products, and for Mastercard to host custom content bringing together leading entrepreneurs with the next generation. Marvel Studios’ “Black Panther: Wakanda Forever” releases in theaters November 11. For more information, please visit: www.marvel.com/movies/black-panther-wakanda-forever. Through mastercard.com/smallbiz visitors can learn the financial tools, benefits and education that helps small businesses thrive and Start Something Priceless. ABOUT MARVEL STUDIOS’ BLACK PANTHER: WAKANDA FOREVER: In Marvel Studios’ “Black Panther: Wakanda Forever,” Queen Ramonda (Angela Bassett), Shuri (Letitia Wright), M’Baku (Winston Duke), Okoye (Danai Gurira) and the Dora Milaje (including Florence Kasumba), fight to protect their nation from intervening world powers in the wake of King T’Challa’s death. As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia (Lupita Nyong’o) and Everett Ross (Martin Freeman) and forge a new path for the kingdom of Wakanda. Introducing Tenoch Huerta Mejía as Namor, king of a hidden undersea nation, the film also stars Dominique Thorne, Michaela Coel, Mabel Cadena and Alex Livanalli. “Black Panther: Wakanda Forever,” directed by Ryan Coogler and produced by Kevin Feige and Nate Moore, opens in U.S. theaters Nov. 11, 2022. ABOUT MASTERCARD (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20221024005272/en/Mastercard-Teams-up-With-Marvel-Studios%E2%80%99-Black-Panther-Wakanda-Forever-to-Spotlight-Small-Business-Superheroes", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-24T10:00:00-04:00", "date_et": "2022-10-24"}
{"symbol": "MA", "publishedDate": "2022-10-24 05:06:00", "publisher": "The Motley Fool", "title": "7 Top Stocks That Can Make You Richer in 2023", "image": "https://images.financialmodelingprep.com/news/7-top-stocks-that-can-make-you-richer-in-20221024.jpg", "site": "fool.com", "text": "Bargains abound following a tumultuous year for Wall Street.", "url": "https://www.fool.com/investing/2022/10/24/7-top-stocks-that-can-make-you-richer-in-2023/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-24T05:06:00-04:00", "date_et": "2022-10-24"}
{"symbol": "MA", "publishedDate": "2022-10-26 22:33:42", "publisher": "Seeking Alpha", "title": "Buy 7 October Buffett Dividend Dogs And Watch One More", "image": "https://images.financialmodelingprep.com/news/buy-7-october-buffett-dividend-dogs-and-watch-one-20221026.jpg", "site": "seekingalpha.com", "text": "This Buffett holdings list from Kiplinger first appeared 8/15/22 on line. YCharts and Dogs of The Dow also track this Buffett/Berkshire batch. Here is your update from 10/24/22 YCharts data. 31 of 47 current Berkshire-Hathaway-owned-stocks pay dividends. As of 10/24/22, the top-ten ranged 3.28%-5.18% by annual-yield and 45 of 47 ranged -2.67% to 65.66% per broker-estimated price-target-upsides.", "url": "https://seekingalpha.com/article/4549651-buy-7-october-buffett-dividend-dog-stocks-watch-one-more", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-26T22:33:42-04:00", "date_et": "2022-10-26"}
{"symbol": "MA", "publishedDate": "2022-10-26 09:29:23", "publisher": "InvestorPlace", "title": "7 Stocks Set for a Stellar Earnings Smasher", "image": "https://images.financialmodelingprep.com/news/7-stocks-set-for-a-stellar-earnings-smasher-20221026.png", "site": "investorplace.com", "text": "It's a big week for stock investors, with several top U.S. companies reporting their third-quarter earnings. Most experts expect earnings to be poor, with the trends seen earlier in the year projected to continue into the third and fourth quarters.", "url": "https://investorplace.com/2022/10/7-stocks-set-for-a-stellar-earnings-smasher/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-26T09:29:23-04:00", "date_et": "2022-10-26"}
{"symbol": "MA", "publishedDate": "2022-10-27 16:33:15", "publisher": "Zacks Investment Research", "title": "Mastercard's (MA) Q3 Earnings Beat Estimates on Better GDV", "image": "https://images.financialmodelingprep.com/news/mastercards-ma-q3-earnings-beat-estimates-on-better-gdv-20221027.jpg", "site": "zacks.com", "text": "Mastercard's (MA) third-quarter results show improved consumer spending reflected in higher GDV and solid cross-border volume, partly offset by increased operating expenses.", "url": "https://www.zacks.com/stock/news/1998892/mastercard-s-ma-q3-earnings-beat-estimates-on-better-gdv", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T16:33:15-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 14:22:32", "publisher": "Invezz", "title": "Should I buy Mastercard shares after the Q3 results?", "image": "https://images.financialmodelingprep.com/news/should-i-buy-mastercard-shares-after-the-q3-results-20221027.jpg", "site": "invezz.com", "text": "Mastercard Incorporated (NYSE: MA) reported better-than-expected third-quarter results this Thursday, and CEO Michael Miebach said that consumer spending remains resilient and cross-border travel continues to recover. Mastercard continues to improve its position in the market Mastercard reported better-than-expected third-quarter results this Thursday; total revenue has increased by 15.5% Y/Y to $5.", "url": "https://invezz.com/news/2022/10/27/should-i-buy-mastercard-shares-after-the-q3-results/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T14:22:32-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 13:05:05", "publisher": "Seeking Alpha", "title": "Mastercard (MA) Q3 2022 Earnings Call Transcript", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-q3-2022-earnings-call-transcript-20221027.jpg", "site": "seekingalpha.com", "text": "Mastercard Incorporated (NYSE:MA ) Q3 2022 Earnings Conference Call October 27, 2022 9:00 AM ET Company Participants Michael Miebach - Chief Executive Officer Sachin Mehra - Chief Financial Officer Warren Kneeshaw - Head of Investor Relations Conference Call Participants Sanjay Sakhrani - KBW Lisa Ellis - MoffettNathanson Darrin Peller - Wolfe Research Harshita Rawat - Bernstein Tien-Tsin Huang - JP Morgan Ashwin Shirvaikar - Citi Rayna Kumar - UBS Jason Kupferberg - Bank of America Tim Chiodo - Credit Suisse Andrew Jeffrey - Truist Securities Bryan Keane - Deutsche Bank Ramsey El-Assal - Barclays Bob Napoli - William Blair Jamie Friedman - Susquehanna Financial Operator Good morning. My name is Audra and I will be your conference Operator today.", "url": "https://seekingalpha.com/article/4549935-mastercard-ma-q3-2022-earnings-call-transcript", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T13:05:05-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 10:03:00", "publisher": "Market Watch", "title": "Mastercard earnings show spending remains strong", "image": "https://images.financialmodelingprep.com/news/mastercard-earnings-show-spending-remains-strong-20221027.jpg", "site": "marketwatch.com", "text": "Mastercard Inc. became the latest payment-technology company to highlight strong consumer spending as it topped expectations with its latest quarterly revenue and earnings figures.", "url": "https://www.marketwatch.com/story/mastercard-earnings-show-spending-remains-strong-11666879390", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T10:03:00-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 08:13:01", "publisher": "Market Watch", "title": "Mastercard earnings rise amid 'resilient' spending, though stock dips", "image": "https://images.financialmodelingprep.com/news/mastercard-earnings-rise-amid-resilient-spending-though-stock-dips-20221027.jpg", "site": "marketwatch.com", "text": "Shares of Mastercard Inc. MA, +2.60% were dipping 0.8% in premarket trading Thursday, though the payments giant topped expectations with its latest revenue and earnings numbers. The company generated third-quarter net income of $2.50 billion, or $2.58 a share, compared with $2.41 billion, or $2.44 a share, in the year-earlier period.", "url": "https://www.marketwatch.com/story/mastercard-earnings-rise-amid-resilient-spending-though-stock-dips-2022-10-27", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T08:13:01-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 08:01:00", "publisher": "Business Wire", "title": "Mastercard Incorporated Third Quarter 2022 Financial Results Available on Company’s Website", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-third-quarter-2022-financial-results-available-on-companys-website-20221027.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its third quarter 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 1-888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 1-800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.", "url": "https://www.businesswire.com/news/home/20221027005535/en", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T08:01:00-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 08:01:00", "publisher": "Business Wire", "title": "Mastercard Incorporated Third Quarter 2022 Financial Results Available on Company’s Website", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-third-quarter-2022-financial-results-available-on-companys-20221027.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its third quarter 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 1-888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 1-800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.", "url": "https://www.businesswire.com/news/home/20221027005535/en/Mastercard-Incorporated-Third-Quarter-2022-Financial-Results-Available-on-Company%E2%80%99s-Website", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T08:01:00-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-27 08:01:00", "publisher": "Business Wire", "title": "Mastercard Incorporated Third Quarter 2022 Financial Results Available on Company's Website", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-third-quarter-2022-financial-results-available-on-20221027.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.", "url": "https://www.businesswire.com/news/home/20221027005535/en/Mastercard-Incorporated-Third-Quarter-2022-Financial-Results-Available-on-Company%E2%80%99s-Website/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-27T08:01:00-04:00", "date_et": "2022-10-27"}
{"symbol": "MA", "publishedDate": "2022-10-31 21:14:02", "publisher": "24/7 Wall Street", "title": "These Are Stan Moss' Top 10 Holdings", "image": "https://images.financialmodelingprep.com/news/these-are-stan-moss-top-10-holdings-20221031.jpg", "site": "247wallst.com", "text": "Stan C. Moss is CEO at the investment management firm Polen Capital, one of the largest hedge funds based on assets under management.", "url": "https://247wallst.com/investing/2022/10/31/these-are-stan-moss-top-10-holdings/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-31T21:14:02-04:00", "date_et": "2022-10-31"}
{"symbol": "MA", "publishedDate": "2022-10-31 10:20:00", "publisher": "PRNewsWire", "title": "Trevo, Ubirider and Mastercard collaborate to make Évora the first city in Portugal to offer contactless payments on its public transit network", "image": "https://images.financialmodelingprep.com/news/trevo-ubirider-and-mastercard-collaborate-to-make-vora-the-20221031.jpg", "site": "prnewswire.com", "text": "Mastercard offers a promotion for all riders who purchase tickets through the Pick platform, encouraging the adoption of state-of-the art technology. ÉVORA, Portugal , Oct. 31, 2022 /PRNewswire/ -- Trevo (Transportes Rodoviários de Évora), the public transport service operator for the city of Évora, announced that it has adopted Ubirider's digital platform, Pick, which provides contactless payments on their public transport network, with the collaboration of Mastercard.", "url": "https://www.prnewswire.com/news-releases/trevo-ubirider-and-mastercard-collaborate-to-make-evora-the-first-city-in-portugal-to-offer-contactless-payments--on-its-public-transit-network-301663430.html", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-10-31T10:20:00-04:00", "date_et": "2022-10-31"}
{"symbol": "MA", "publishedDate": "2022-11-02 08:00:00", "publisher": "Business Wire", "title": "McAfee Unveils Partnership with Mastercard to Offer US Cardholders Online Protection Software", "image": "https://images.financialmodelingprep.com/news/mcafee-unveils-partnership-with-mastercard-to-offer-us-cardholders-online-20221102.jpg", "site": "businesswire.com", "text": "SAN JOSE, Calif.--(BUSINESS WIRE)--Today, McAfee Corp., a global leader in online protection, announced an exclusive partnership with Mastercard (NYSE: MA), a global technology company in the payments industry, to offer Mastercard personal and small-medium size business cardholders access to award-winning online protection solutions. In 2021, 83% of organizations reported experiencing phishing attacks, a 46% increase over 2020, and a number that is expected to grow in 2022. Mastercard is dedicated to connecting and powering an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Providing Mastercard cardholders with the tools to help combat growing security threats is one of the many steps towards combating bad actors and stopping damage from major breaches before they do lasting harm. McAfee offers for Mastercard US cardholders are: McAfee Total Protection for Mastercard 5 Devices: 30-day free trial that includes protection for up to 5 devices and a complimentary one-year subscription to McAfee TechMate (which optimizes device functionality) with a paid subscription at a first-year discounted price of $29.50 (a 75% discount) for consumers. More information can be found at McAfee.com/mastercard. McAfee Total Protection for Mastercard 10 Devices: 30-day free trial that includes protection for up to 10 devices for small and medium-sized businesses and a complimentary subscription to McAfee TechMate with a paid subscription at a first-year discounted price of $34.50 (a 75% discount) for small and medium sized businesses. More information can be found at McAfee.com/mastercardsmallbusiness. “With security threats from bad actors becoming more prevalent and sophisticated, it’s important that both general customers and small business customers have the option to add protections to their devices,” said Pedro Gutierrez, SVP Global Sales & Operations at McAfee. “We are proud to partner with Mastercard to offer solutions for their cardholders and look forward to helping customers stay secure so they can stay focused on what’s important to them.” “Mastercard is always looking for ways to add value to both our consumer and small business cardholders,” said Seema Chibber, SVP of Credit, North America at Mastercard. “By partnering with McAfee, we’re able to provide people exclusive access to leading security technology to help them feel confident and secure with every transaction.” The security offerings are now available to eligible cardholders in the US. For more information about the Mastercard offers and about McAfee security products, please visit http://mcafee.com/. About McAfee McAfee Corp. is a global leader in online protection. Focused on protecting people, not just devices, McAfee’s solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protect their families and communities with the right security at the right moment. For more information, please visit https://www.mcafee.com/mastercard. About Mastercard (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20221102005375/en/McAfee-Unveils-Partnership-with-Mastercard-to-Offer-US-Cardholders-Online-Protection-Software", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-02T08:00:00-04:00", "date_et": "2022-11-02"}
{"symbol": "MA", "publishedDate": "2022-11-02 08:00:00", "publisher": "Business Wire", "title": "McAfee Unveils Partnership with Mastercard to Offer US Cardholders Online Protection Software", "image": "https://images.financialmodelingprep.com/news/mcafee-unveils-partnership-with-mastercard-to-offer-us-cardholders-20221102.jpg", "site": "businesswire.com", "text": "SAN JOSE, Calif.", "url": "https://www.businesswire.com/news/home/20221102005375/en/McAfee-Unveils-Partnership-with-Mastercard-to-Offer-US-Cardholders-Online-Protection-Software/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-02T08:00:00-04:00", "date_et": "2022-11-02"}
{"symbol": "MA", "publishedDate": "2022-11-02 02:22:23", "publisher": "Seeking Alpha", "title": "Mastercard: Fair Value With Huge Crypto Tailwinds", "image": "https://images.financialmodelingprep.com/news/mastercard-fair-value-with-huge-crypto-tailwinds-20221102.jpg", "site": "seekingalpha.com", "text": "Mastercard owns one of the most popular card processing networks in the world, along with rival Visa. Globally over 3 billion Mastercard and Maestro-branded cards have been issued.", "url": "https://seekingalpha.com/article/4551847-mastercard-stock-fair-value-crypto-tailwinds", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-02T02:22:23-04:00", "date_et": "2022-11-02"}
{"symbol": "MA", "publishedDate": "2022-11-03 13:25:04", "publisher": "Seeking Alpha", "title": "Mastercard: Strong Fundamentals With Explosive Dividend Return Potential (Technical Analysis)", "image": "https://images.financialmodelingprep.com/news/mastercard-strong-fundamentals-with-explosive-dividend-return-potential-technical-20221103.jpg", "site": "seekingalpha.com", "text": "Mastercard's strong fundamentals over the next five years build a more substantial foundation for upward momentum and stock price. As financial services evolve, Mastercard will most likely stay ahead of the competition as new financial innovations will be upon us in the next few years.", "url": "https://seekingalpha.com/article/4552605-mastercard-strong-fundamental-dividend-return-potential-technical-analysis", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-03T13:25:04-04:00", "date_et": "2022-11-03"}
{"symbol": "MA", "publishedDate": "2022-11-04 10:44:44", "publisher": "Seeking Alpha", "title": "Mastercard: Low-Teens EPS Growth In Q3 Despite Headwinds; Cheap At 29x P/E", "image": "https://images.financialmodelingprep.com/news/mastercard-lowteens-eps-growth-in-q3-despite-headwinds-cheap-20221104.jpg", "site": "seekingalpha.com", "text": "MA stock has fallen 23% from their peak, including 3% since Q3 results last Thursday - sentiment driven and unfair in our view. Q3 results showed why MA will continue compounding long-term, with EPS up 12.9% despite Russia and currency headwinds.", "url": "https://seekingalpha.com/article/4553117-mastercard-low-teens-eps-growth-in-q3-despite-headwinds-cheap-at-29x-pe", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-04T10:44:44-04:00", "date_et": "2022-11-04"}
{"symbol": "MA", "publishedDate": "2022-11-07 16:05:00", "publisher": "Business Wire", "title": "Mastercard to Participate in Upcoming Investor Conference", "image": "https://images.financialmodelingprep.com/news/mastercard-to-participate-in-upcoming-investor-conference-20221107.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.", "url": "https://www.businesswire.com/news/home/20221107005784/en/Mastercard-to-Participate-in-Upcoming-Investor-Conference/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-07T16:05:00-05:00", "date_et": "2022-11-07"}
{"symbol": "MA", "publishedDate": "2022-11-07 16:05:00", "publisher": "Business Wire", "title": "Mastercard to Participate in Upcoming Investor Conference", "image": "https://images.financialmodelingprep.com/news/mastercard-to-participate-in-upcoming-investor-conference-20221107.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced that Sachin Mehra, chief financial officer, will present at the Citi Fintech Conference in New York City on Monday, November 14. The discussion will begin at 8:15 a.m. Eastern Time and last for approximately 35 minutes. There will be a live audio webcast of the discussion and replays will be archived for 30 days at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.", "url": "https://www.businesswire.com/news/home/20221107005784/en/Mastercard-to-Participate-in-Upcoming-Investor-Conference", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-07T16:05:00-05:00", "date_et": "2022-11-07"}
{"symbol": "MA", "publishedDate": "2022-11-08 14:50:27", "publisher": "The Motley Fool", "title": "Why Mastercard Stock Jumped 15.4% Higher in October", "image": "https://images.financialmodelingprep.com/news/why-mastercard-stock-jumped-154-higher-in-october-20221108.jpg", "site": "fool.com", "text": "The credit card company had an excellent third quarter.", "url": "https://www.fool.com/investing/2022/11/08/why-mastercard-stock-jumped-154-higher-in-october/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-08T14:50:27-05:00", "date_et": "2022-11-08"}
{"symbol": "MA", "publishedDate": "2022-11-08 06:15:00", "publisher": "The Motley Fool", "title": "Consumer Spending Is Strong, but What Does It Mean for the Economy?", "image": "https://images.financialmodelingprep.com/news/consumer-spending-is-strong-but-what-does-it-mean-20221108.jpg", "site": "fool.com", "text": "Strong consumer spending is usually a good thing. But during these inflationary times, it could mean something different.", "url": "https://www.fool.com/investing/2022/11/08/consumer-spending-is-strong-but-what-does-it-mean/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-08T06:15:00-05:00", "date_et": "2022-11-08"}
{"symbol": "MA", "publishedDate": "2022-11-09 15:28:34", "publisher": "Schaeffers Research", "title": "Put Buyers Flock to Mastercard Stock", "image": "https://images.financialmodelingprep.com/news/put-buyers-flock-to-mastercard-stock-20221109.jpg", "site": "schaeffersresearch.com", "text": "Mastercard Incorporated (NYSE: MA) is a global technology-driven company in the financial services industry.", "url": "https://www.schaeffersresearch.com/content/analysis/2022/11/09/put-buyers-flock-to-mastercard-stock", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-09T15:28:34-05:00", "date_et": "2022-11-09"}
{"symbol": "MA", "publishedDate": "2022-11-10 12:31:40", "publisher": "The Motley Fool", "title": "Why Shares of Visa, Mastercard, and Blackstone Are Rising Today", "image": "https://images.financialmodelingprep.com/news/why-shares-of-visa-mastercard-and-blackstone-are-rising-20221110.jpg", "site": "fool.com", "text": "Investors cheered October inflation data, which showed that consumer price growth is starting to slow.", "url": "https://www.fool.com/investing/2022/11/10/why-shares-of-visa-mastercard-and-blackstone-are-r/", "ticker": "MA", "event_date": "2022-10-27", "window_start": "2022-10-13", "window_end": "2022-11-10", "publishedDateET": "2022-11-10T12:31:40-05:00", "date_et": "2022-11-10"}
