[
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-01 12:17:49",
    "publisher": "Pulse2",
    "title": "Bank Of America Stock Price: $44 Target (Up From $35) By Deutsche Bank",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-stock-price-44-target-up-from-20210401.jpg",
    "site": "pulse2.com",
    "text": "The stock price of Bank of America (NYSE: BAC) has received a price target increase from $35 to $44. These are the details.",
    "url": "https://pulse2.com/bank-of-america-stock-price-nyse-bac-44-target-up-from-35-by-deutsche-bank/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-01T12:17:49-04:00",
    "date_et": "2021-04-01"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-01 08:09:00",
    "publisher": "The Motley Fool",
    "title": "Would Citigroup Ever Consider Buying Another U.S. Bank?",
    "image": "https://images.financialmodelingprep.com/news/would-citigroup-ever-consider-buying-another-us-bank-20210401.jpg",
    "site": "fool.com",
    "text": "Of the four large U.S. banks, Citigroup is really the only one that could acquire another big depository institution.",
    "url": "https://www.fool.com/investing/2021/04/01/would-citigroup-ever-consider-buying-another-us-ba/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-01T08:09:00-04:00",
    "date_et": "2021-04-01"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-02 18:18:53",
    "publisher": "Pulse2",
    "title": "Why Bank Of America (BAC) Is Buying Axia Technologies",
    "image": "https://images.financialmodelingprep.com/news/why-bank-of-america-bac-is-buying-axia-technologies-20210402.jpg",
    "site": "pulse2.com",
    "text": "Bank of America (NYSE: BAC) announced it acquired Axia Technologies, a leading healthcare payment and tech company focused on facilitating secure patient payments. These are the details.",
    "url": "https://pulse2.com/why-bank-of-america-bac-is-buying-axia-technologies/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-02T18:18:53-04:00",
    "date_et": "2021-04-02"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-02 13:12:04",
    "publisher": "PYMNTS",
    "title": "Bank Of America Acquires Healthcare Payment Startup Axia Technologies",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-acquires-healthcare-payment-startup-axia-technologies-20210402.jpg",
    "site": "pymnts.com",
    "text": "Bank of America (BoA) is acquiring the German healthcare payment and technology company Axia Technologies for an undisclosed amount as the financial institution (FI) seeks to advance its payment solutions for healthcare clients. Mark Monaco, head of enterprise payments at Bank of America, said in a press release that Axia — also known as AxiaMed […]",
    "url": "https://www.pymnts.com/news/partnerships-acquisitions/2021/bank-of-america-acquires-healthcare-payments-startup-axia-technologies/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-02T13:12:04-04:00",
    "date_et": "2021-04-02"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-02 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Acquires Axia Technologies, Inc.",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-acquires-axia-technologies-inc-20210402.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced that it has acquired Axia Technologies, Inc. (“AxiaMed”), an industry-leading health care payment and technology company focused on facilitating secure patient payments. The acquisition will deepen and expand Bank of America's payment offerings for healthcare clients and will further accelerate the bank's ability to serve this key vertical. It is part of a broader initiative to integrate merchant services onto its proprietary pla",
    "url": "https://www.businesswire.com/news/home/20210402005117/en/Bank-of-America-Acquires-Axia-Technologies-Inc./",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-02T09:00:00-04:00",
    "date_et": "2021-04-02"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-02 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Acquires Axia Technologies, Inc.",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-acquires-axia-technologies-inc-20210402.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced that it has acquired Axia Technologies, Inc. (“AxiaMed”), an industry-leading health care payment and technology company focused on facilitating secure patient payments. The acquisition will deepen and expand Bank of America’s payment offerings for healthcare clients and will further accelerate the bank’s ability to serve this key vertical. It is part of a broader initiative to integrate merchant services onto its proprietary platform following the dissolution of its merchant services joint venture last year. Terms of the acquisition were not disclosed. “We are adding a talented team that brings great domain expertise and technology, and we’re excited to have them join Bank of America,” said Mark Monaco, head of enterprise payments at Bank of America. “We have a shared vision of providing clients with the best technology to meet their payment needs. Working together, we can leverage our joint expertise and capabilities to deliver a comprehensive range of payment and settlement solutions to our healthcare clients and their patients.” Established in 2015, AxiaMed provides a gateway and terminal software solution, powering many healthcare providers to offer end-to-end, omni-channel patient payment solutions. Its integrated offerings help the financial performance of healthcare providers by expanding the payment options available to patients and streamlining administrative workflows. “AxiaMed is excited to join Bank of America,” said Randal Clark, President, CEO and Founder of AxiaMed. “AxiaMed strives to ensure that our industry-leading payments platform can be leveraged by our partners and their clients, many of whom currently use numerous products and services of Bank of America, to provide a seamless and secure end-to-end patient payment experience.” Bank of America has been developing its proprietary merchant services solutions over the past year that will better serve the payment needs of clients across all business lines. The platform leverages innovations such as real-time payments and best-in-class digital capabilities to provide essential functions such as merchant acquiring, payments processing and settlement, along with value-added services such as analytics and security solutions. “Payments are core to what we do at Bank of America,” added Monaco. “We continue to invest to enable clients with expanded capabilities, and flexible solutions to meet a variety of business needs in an integrated and transparent way that puts the client first.” Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. Visit the Bank of America newsroom and register for news email alerts. AxiaMed AxiaMed, based in Santa Barbara, California, is a healthcare financial technology company focused on facilitating patient payments. AxiaMed’s cloud-based healthcare payment platform integrates into various EHRs and practice management systems as well as revenue cycle, patient engagement, and related software applications to provide secure, flexible patient payment options with industry-leading features and optimal workflows. Architected uniquely for the healthcare industry, AxiaMed’s platform provides unprecedented enterprise-level security, financial interoperability and ease of scale for any healthcare organization. Forward-Looking Statements Certain statements contained in this news release may constitute “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent the current expectations, plans or forecasts of Bank of America based on available information. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. These statements often use words like “expects,” “anticipates,” “believes,” “estimates,” “targets,” “intends,” “plans,” “predict,” “goal” and other similar expressions or future or conditional verbs such as “will,” “may,” “might,” “should,” “would” and “could.” Forward-looking statements speak only as of the date they are made, and Bank of America undertakes no obligation to update any forward-looking statement to reflect the impact of circumstances or events that arise after the date the forward-looking statement was made. Forward-looking statements represent Bank of America’s current expectations, plans or forecasts of its future results, revenues, expenses, efficiency ratio, capital measures, and future business and economic conditions more generally, and other future matters. These statements are not guarantees of its future results or performance and involve certain known and unknown risks, uncertainties and assumptions that are difficult to predict and are often beyond Bank of America’s control. Actual outcomes and results may differ materially from those expressed in, or implied by, any forward-looking statements. You should not place undue reliance on any forward-looking statement and should consider all of the uncertainties and risks discussed under Item 1A. “Risk Factors” of Bank of America’s Annual Report on Form 10-K for the year ended December 31, 2020 and in any of Bank of America’s other subsequent Securities and Exchange Commission filings. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210402005117/en/Bank-of-America-Acquires-Axia-Technologies-Inc.",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-02T09:00:00-04:00",
    "date_et": "2021-04-02"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-03 09:21:00",
    "publisher": "The Motley Fool",
    "title": "Why Bank of America Stock Jumped 11.5% in March",
    "image": "https://images.financialmodelingprep.com/news/why-bank-of-america-stock-jumped-115-in-march-20210403.jpg",
    "site": "fool.com",
    "text": "Multiple factors are working in the banking titan's favor.",
    "url": "https://www.fool.com/investing/2021/04/03/why-bank-of-america-stock-jumped-115-in-march/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-03T09:21:00-04:00",
    "date_et": "2021-04-03"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-05 20:42:38",
    "publisher": "The Motley Fool",
    "title": "Bank of America Acquires Healthcare Payment Company Axia Technologies",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-acquires-healthcare-payment-company-axia-technologies-20210405.jpg",
    "site": "fool.com",
    "text": "The lender aims to bolster its suite of digital payment solutions.",
    "url": "https://www.fool.com/investing/2021/04/05/bank-of-america-acquires-healthcare-payment-compan/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-05T20:42:38-04:00",
    "date_et": "2021-04-05"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-05 17:15:00",
    "publisher": "The Motley Fool",
    "title": "This 1 Thing Will Make or Break the Stock Market Rally",
    "image": "https://images.financialmodelingprep.com/news/this-1-thing-will-make-or-break-the-stock-20210405.jpg",
    "site": "fool.com",
    "text": "New record highs could continue -- or end quickly. Here's what to look for.",
    "url": "https://www.fool.com/investing/2021/04/05/this-1-thing-will-make-or-break-the-stock-market-r/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-05T17:15:00-04:00",
    "date_et": "2021-04-05"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-05 11:47:06",
    "publisher": "Seeking Alpha",
    "title": "Bank Of America Still Has Room To Rise",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-still-has-room-to-rise-20210405.jpeg",
    "site": "seekingalpha.com",
    "text": "Rising interest rates sustain the rally in market value. The bank is strongly positioned to grow in a post-Covid era.",
    "url": "https://seekingalpha.com/article/4417644-bank-of-america-still-room-to-rise",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-05T11:47:06-04:00",
    "date_et": "2021-04-05"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-05 10:36:28",
    "publisher": "Zacks Investment Research",
    "title": "BofA (BAC) Buys Axia Technologies, Boosts Healthcare Payments",
    "image": "https://images.financialmodelingprep.com/news/bofa-bac-buys-axia-technologies-boosts-healthcare-payments-20210405.jpg",
    "site": "zacks.com",
    "text": "BofA's (BAC) acquisition of Axia Technologies is likely to further strengthen its position in the lucrative healthcare payments solution market.",
    "url": "https://www.zacks.com/stock/news/1348469/bofa-bac-buys-axia-technologies-boosts-healthcare-payments",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-05T10:36:28-04:00",
    "date_et": "2021-04-05"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-05 06:50:00",
    "publisher": "The Motley Fool",
    "title": "Is Bank of America the Long-Term Stock for You?",
    "image": "https://images.financialmodelingprep.com/news/is-bank-of-america-the-longterm-stock-for-you-20210405.jpg",
    "site": "fool.com",
    "text": "It is, after all, Warren Buffett's favorite.",
    "url": "https://www.fool.com/investing/2021/04/05/is-bank-of-america-the-long-term-stock-for-you/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-05T06:50:00-04:00",
    "date_et": "2021-04-05"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-06 09:51:15",
    "publisher": "Zacks Investment Research",
    "title": "5 Top-Performing S&P 500 Bank Stocks of Q1 Worth a Look",
    "image": "https://images.financialmodelingprep.com/news/5-topperforming-sp-500-bank-stocks-of-q1-worth-20210406.jpg",
    "site": "zacks.com",
    "text": "Bank stocks rebound impressively in Q1. One must keep an eye on best-performing S&P 500 banks like People's United (PBCT), Fifth Third Bancorp (FITB), Wells Fargo (WFC), Regions Financial (RF) and Bank of America (BAC) that are driven by strong fundamentals.",
    "url": "https://www.zacks.com/stock/news/1353681/5-top-performing-sp-500-bank-stocks-of-q1-worth-a-look",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-06T09:51:15-04:00",
    "date_et": "2021-04-06"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-06 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Study Finds Nearly Half of Affluent Americans Getting Their Financial Lives in Order During the Pandemic",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-study-finds-nearly-half-of-affluent-20210406.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Concerned about threats to financial success outside of their control, 46% of affluent Americans have been getting their financial lives in order during the last year, according to a recent study from Bank of America. The research also found that, despite challenges imposed by the pandemic, most survey respondents believe they are on track to reach several financial milestones earlier in life than their parents. The Bank of America Preferred Insights: Hindsight is 20/20 Personal Finance Report explores more than 2,000 affluent1 Americans’ financial decisions and reflections over the last two decades, and changes in financial behaviors and priorities over the last year. The research is based on a survey of adults aged 25 and above with investable assets between $100,000 and $1 million and 18- to 24-year-olds with investable assets between $50,000 and $1 million. Looking back over the last two decades, the study found that 89% of Gen X, baby boomer and senior respondents are satisfied with the financial decisions they have made. However, in hindsight, one-third of these respondents (34%) would have done things differently, wishing they had saved more (66%), and started saving (59%) and investing earlier (61%). “The health crisis has caused many people to take stock of their life priorities and to control what they can during a period of uncertainty,” said Aron Levine, President, Preferred and Consumer Banking & Investments at Bank of America. “In addition to getting their finances in order, people are looking ahead at new possibilities, plotting a course for their future and engaging with educational resources and advice that will help them make informed financial decisions and pursue new and exciting goals for themselves and their families.” When asked about the most prominent threats to their future financial success, respondents across generations cited concern about factors outside of their control, including economic recession (62%), market volatility (55%), rising cost of healthcare (50%), and the continuation of the global health crisis (44%). Not Your Parents’ Definition of Success The survey found that the vast majority of affluent Americans are prioritizing many traditional milestones in life, including owning a car (98%), owning a home (97%), saving their goal amount for retirement (95%) and paying off credit card debt (94%). In fact, 84% of respondents indicated they plan to achieve or have already achieved one or more financial milestones earlier than their parents – including opening an investing account (54%) and starting to save for retirement (53%). More than half of this group (53%) say they have already achieved or plan to achieve five or more financial milestones earlier than their parents. However, when asked about the most important measures of personal success today, respondents choose those less financially focused, including good health (63%) and supportive family and friends (59%), over such options as having a stable source of income (51%) or the money to maintain a desired lifestyle (47%). Pandemic Shifts Financial Behaviors and Conversations The pandemic has caused many affluent Americans to re-evaluate the way they save, spend and invest. Nearly half (48%) say they have made no changes to their investment risk tolerance during this period. Among the 44% of investors who have made changes to their investment risk tolerance, they are split in terms of how they have responded to market volatility – with 23% indicating they have been more aggressive and 21% indicating they have been more cautious. More than half of millennials (52%) say they are taking a more aggressive approach to their investing (vs. 23% of the national sample), and many younger investors are managing their portfolios more frequently than they did prior to the pandemic (55% vs. 32% nationally). During this period, four out of five respondents (81%) have taken money normally spent on entertainment, travel and dining and set it aside – namely toward savings accounts (52%) and emergency funds (25%). When life returns to “normal” after the pandemic, affluent Americans plan to spend more on grocery delivery (30%), food prep/meal-kits (27%), restaurant delivery (26%), house cleaning (25%) and laundry services (22%). The survey also found that people are opening up more about certain financial topics today than they did 20 years ago. Approximately three out of four affluent Gen X, baby boomer and senior respondents have long been comfortable talking to friends about real estate decisions, healthcare costs, and their approach to saving for retirement. However, they have become increasingly comfortable talking about changes to life plans due to financial concerns (72% today vs. 66% 20 years ago) and how market volatility impacts their personal investments (71% today vs. 63% 20 years ago). Compared to other generations today, millennials are even more comfortable talking with friends about all types of financial topics. The Modern Investor: Getting Educated and Socially Conscious Respondents are turning to a range of resources to learn about the market and manage their investments in light of recent events, including financial advisors (45%), online investment management platforms (37%), informational websites (32%), and their friends or family (30%). The survey also revealed the following about affluent investors today: More than half (56%) of affluent Americans are taking a self-directed approach to investing or using self-directed investing in combination with a financial advisor for guidance. Among those surveyed: 40% conduct their own research and fully manage their investments using online platforms; 28% consult only a financial advisor for investment advice; 16% use a combination of self-directed and a financial advisor for guidance; and 9% only consult a robo advisor. When it comes to choosing a financial advisor or online brokerage, Americans take into consideration credible reputation (63%) and fees (53%), as well as personal recommendations (42%) and accessibility (41%). One out of five (20%) respondents prioritize socially responsible investing, with top considerations including environmental impact/conservation (50%), personal interest/use of the company’s products (43%), and equity for racial minorities (41%). Additionally, 40% of respondents would be more likely to consider investing in a company that provides pay equity for all employees and supports charitable efforts aligned with their own. “No matter where our clients are on their investment journey, we’re seeing high levels of engagement with educational resources, the latest insights from our Chief Investment Office, and personalized guidance aligned to their life goals,” said Levine. “In doing so, our clients are redefining what it means to be an informed investor.” For more information about the financial behaviors and priorities of affluent Americans, read the Bank of America Personal Finance Insights: Hindsight is 20/20 Personal Finance Report and an infographic spotlighting millennial findings. 1 Hindsight is 20/20 Survey Methodology Concentrix (an independent market research company) conducted a panel-sample online survey on behalf of Bank of America / Merrill from Oct. 28 – Nov. 5, 2020. The survey consisted of 2,000 affluent respondents throughout the U.S. Respondents in the study were defined as aged 18 to 24 (Gen Z) with investable assets between $50,000 and $1,000,000 or aged 25-plus with investable assets between $100,000 and $1,000,000. For this purpose, investable assets consist of the value of all cash, savings, mutual funds, CDs, IRAs, stocks, bonds and all other types of investments such as a 401(k), 403(B), and Roth IRA, but excluding primary home and other real estate investments. Concentrix also conducted an oversampling of 300 affluent respondents in each of the following six regions: Atlanta, Chicago, Houston, North Carolina’s Triangle, Phoenix and Seattle. Regional oversampling took place from Nov. 9 – Nov. 30, 2020. The margin of error is +/- 2.2 percent for the national sample and about +/- 5.6 percent for each of the oversample markets, reported at a 95 percent confidence level. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com Investing involves risk. There is always the potential of losing money when you invest in securities. Bank of America, Merrill, its affiliates, and financial advisors do not provide legal, tax, or accounting advice. You should consult your legal and/or tax advisors before making any financial decisions. Impact investing and/or Environmental, Social and Governance (ESG) managers may take into consideration factors beyond traditional financial information to select securities, which could result in relative investment performance deviating from other strategies or broad market benchmarks, depending on whether such sectors or investments are in or out of favor in the market. Further, ESG strategies may rely on certain values based criteria to eliminate exposures found in similar strategies or broad market benchmarks, which could also result in relative investment performance deviating. The information presented in this report is for discussion purposes only and is not intended to serve as a recommendation or solicitation for the purchase or sale of any type of security. Past performance is not a guarantee of future results. Merrill Lynch, Pierce, Fenner & Smith Incorporated (also referred to as “MLPF&S” or “Merrill”), makes available certain investment products sponsored, managed, distributed or provided by companies that are affiliates of Bank of America Corporation (“BofA Corp.”). MLPF&S is a registered broker-dealer, registered investment adviser, Member SIPC and a wholly owned subsidiary of BofA Corp. Global Wealth & Investment Management (GWIM) is a division of Bank of America Corporation. The Chief Investment Office, which provides investment strategies, due diligence, portfolio construction guidance and wealth management solutions for GWIM clients, is part of the Investment Solutions Group (ISG) of GWIM. Banking products are provided by Bank of America, N.A., Member FDIC and a wholly owned subsidiary of Bank of America Corp. Investment products: Are Not FDIC Insured Are Not Bank Guaranteed May Lose Value © 2021 Bank of America Corporation. All rights reserved. 3507655",
    "url": "https://www.businesswire.com/news/home/20210406005183/en/Bank-of-America-Study-Finds-Nearly-Half-of-Affluent-Americans-Getting-Their-Financial-Lives-in-Order-During-the-Pandemic",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-06T09:00:00-04:00",
    "date_et": "2021-04-06"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-06 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Study Finds Nearly Half of Affluent Americans Getting Their Financial Lives in Order During the Pandemic",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-study-finds-nearly-half-of-affluent-americans-20210406.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Concerned about threats to financial success outside of their control, 46% of affluent Americans have been getting their financial lives in order during the last year, according to a recent study from Bank of America. The research also found that, despite challenges imposed by the pandemic, most survey respondents believe they are on track to reach several financial milestones earlier in life than their parents. The Bank of America Preferred Insights: Hindsight",
    "url": "https://www.businesswire.com/news/home/20210406005183/en/Bank-of-America-Study-Finds-Nearly-Half-of-Affluent-Americans-Getting-Their-Financial-Lives-in-Order-During-the-Pandemic/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-06T09:00:00-04:00",
    "date_et": "2021-04-06"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-06 06:43:00",
    "publisher": "The Motley Fool",
    "title": "3 of the Best Value Stocks You Can Buy Right Now",
    "image": "https://images.financialmodelingprep.com/news/3-of-the-best-value-stocks-you-can-buy-20210406.jpg",
    "site": "fool.com",
    "text": "They are all coming off great performances in 2020.",
    "url": "https://www.fool.com/investing/2021/04/06/3-of-the-best-value-stocks-you-can-buy-right-now/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-06T06:43:00-04:00",
    "date_et": "2021-04-06"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-07 14:43:18",
    "publisher": "GuruFocus",
    "title": "A Look at Berkshire Hathaway's Smallest Investments",
    "image": "https://images.financialmodelingprep.com/news/a-look-at-berkshire-hathaways-smallest-investments-20210407.jpg",
    "site": "gurufocus.com",
    "text": "The top investments in Berkshire Hathway's (NYSE:BRK.A) (NYSE:BRK.B) portfolio, including the likes of Apple Inc. (NASDAQ:AAPL) and Bank of America Corp. (NYSE:BAC), are frequently analyzed by investors and financial commentators.",
    "url": "https://www.gurufocus.com/news/1394146/a-look-at-berkshire-hathaways-smallest-investments",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-07T14:43:18-04:00",
    "date_et": "2021-04-07"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 13:37:28",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America (BAC) Reports Next Week: Wall Street Expects Earnings Growth",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-bac-reports-next-week-wall-street-20210408.jpg",
    "site": "zacks.com",
    "text": "Bank of America (BAC) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.",
    "url": "https://www.zacks.com/stock/news/1365410/bank-of-america-bac-reports-next-week-wall-street-expects-earnings-growth",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T13:37:28-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 10:48:00",
    "publisher": "Reuters",
    "title": "Bank of America to deploy $1 trillion for sustainable finance by 2030",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-to-deploy-1-trillion-for-sustainable-finance-20210408.jpg",
    "site": "reuters.com",
    "text": "Bank of America said on Thursday it will deploy $1 trillion for its environmental business initiative to push for green finance by 2030, expanding on the $300 billion it had announced for the same project in 2019. The second largest U.S. bank said the latest announcement puts its total commitment to sustainable finance by 2030 at $1.5 trillion.",
    "url": "https://www.reuters.com/article/us-bank-of-america-esg/bank-of-america-to-deploy-1-trillion-for-sustainable-finance-by-2030-idUSKBN2BV29W",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T10:48:00-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 10:32:23",
    "publisher": "InvestorPlace",
    "title": "What Will the Stock Market Do Today? 3 Big Stories to Watch.",
    "image": "https://images.financialmodelingprep.com/news/what-will-the-stock-market-do-today-3-big-20210408.jpg",
    "site": "investorplace.com",
    "text": "So what will the stock market do today? Investors are processing a tax plan, looking at the Coinbase IPO and considering bearish indicators.",
    "url": "https://investorplace.com/2021/04/what-will-the-stock-market-do-today-3-big-stories-coinbase-ipo-american-jobs-plan/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T10:32:23-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 10:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America to Report First-Quarter 2021 Financial Results on April 15",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-to-report-firstquarter-2021-financial-results-20210408.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--As previously announced, Bank of America will report its first-quarter 2021 financial results on Thursday, April 15. The results will be released at approximately 6:45 a.m. ET, followed by an investor presentation at 9 a.m. ET. The news release, supplemental filing and investor presentation can be accessed in the following ways: Bank of America newsroom at https://newsroom.bankofamerica.com. Bank of America Investor Relations website at http://investor.bankofam",
    "url": "https://www.businesswire.com/news/home/20210408005474/en/Bank-of-America-to-Report-First-Quarter-2021-Financial-Results-on-April-15/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T10:00:00-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 10:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America to Report First-Quarter 2021 Financial Results on April 15",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-to-report-firstquarter-2021-financial-results-on-20210408.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--As previously announced, Bank of America will report its first-quarter 2021 financial results on Thursday, April 15. The results will be released at approximately 6:45 a.m. ET, followed by an investor presentation at 9 a.m. ET. The news release, supplemental filing and investor presentation can be accessed in the following ways: Bank of America newsroom at https://newsroom.bankofamerica.com. Bank of America Investor Relations website at http://investor.bankofamerica.com. Business Wire’s news web page at http://www.businesswire.com/portal/site/home/news. Investor Conference Call Information For a listen-only connection to the investor presentation, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international). The conference ID is 79795. Please dial in 10 minutes prior to the start of the call. Investors can also listen to a live audio webcast of the conference call and view the presentation slides by visiting the “Events & Presentations” section of the company’s Investor Relations website. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,900 lending centers, 2,500 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,300 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business owners through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210408005474/en/Bank-of-America-to-Report-First-Quarter-2021-Financial-Results-on-April-15",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T10:00:00-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Increases Environmental Business Initiative Target to $1 Trillion by 2030",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-increases-environmental-business-initiative-target-to-20210408.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced a goal of deploying and mobilizing $1 trillion by 2030 in its Environmental Business Initiative in order to accelerate the transition to a low-carbon, sustainable economy. This commitment will anchor a broader $1.5 trillion sustainable finance goal by both environmental transition and social inclusive development purposes, spanning business activities across the globe. “The private sector is well-positioned to ensure that the capital needed – at the scale it is needed – can drive the transition to a low-carbon, sustainable economy,” said Bank of America Vice Chairman, Anne Finucane, who leads the company’s environmental, social and governance (ESG), sustainable finance, and public policy efforts. “We will meet our commitment by working with clients to provide lending, capital raising, advisory and investment services, and to develop financial solutions and drive innovation to ensure the transition to a sustainable economy.” Bank of America’s broader $1.5 trillion sustainable finance target is consistent with the United Nations Sustainable Development Goals (UN SDGs), and will spur transformative change nationally and around the world. Beyond the $1 trillion climate-related finance, the balance of the sustainable finance goal is focused on social inclusive development, scaling capital to advance community development, affordable housing, healthcare, and education, in addition to racial and gender equality. “We stand alongside our clients in helping drive the transition in sustainable lending, investing, and markets activity,” said Chief Operating Officer Tom Montag, who co-chairs Bank of America’s Sustainable Markets Committee with Finucane. “Bank of America will continue to mobilize players across the entire financial system to increase the flow of capital.” Environmental Business Initiative Today’s announcement increases Bank of America’s 2019 commitment of $300 billion to low-carbon, sustainable business initiatives, to $1 trillion by 2030 as part of its Environmental Business Initiative. This commitment advances an environmental transition across sectors to solutions in energy efficiency, renewable energy, sustainable transportation, resource efficiency, sustainable water and agriculture as well as improved forestry and pollution control measures. Since launching the Environmental Business Initiative in 2007, Bank of America has deployed more than $200 billion to low-carbon, sustainable business activities, including expanding its asset-based lending, tax equity investment and capital raising activities across current and emerging clean energy and power, transportation and other industry sectors important for environmental transition. Today’s news follows the company’s recent announcement to achieve Net Zero before 2050. Leading innovation and development in Sustainable Finance Finucane and Montag co-chair the company’s Sustainable Markets Committee, which collaborates across business lines to deliver innovative financing solutions in support of the United Nations Sustainable Development Goals. The company’s sustainable finance highlights include: A top issuer of Green, Social and Sustainability bonds: In 2020, Bank of America issued a $1 billion corporate social bond to support those on the front lines of the coronavirus health crisis; and a first-of-its kind $2 billion equality progress sustainability bond to help advance racial equality, economic opportunity and environmental sustainability. Since 2013, the company has issued $9.85 billion in eight corporate Green, Social and Sustainability bonds. A top underwriter in ESG capital markets globally, and a top underwriter of Green Bonds for U.S. Municipalities. Since 2013, the company has helped more than 225 clients support their sustainable business needs by raising in excess of $300 billion through more than 400 ESG-themed bond offerings including green, social and sustainability bonds. The top renewable energy investor and lender in the U.S. since 2015. The company’s renewable energy tax equity portfolio at the end of 2020 was approximately $10.1 billion. These investments have contributed to the development of approximately 17% (33GW) of all total installed renewable wind and solar energy capacity in the U.S. A leader in carbon neutrality and net zero advisory services to all corporate and institutional clients, and a leader in financing, capital markets and M&A services that help drive environmental and social sustainability globally. One of the largest investors and lenders to affordable housing projects in the U.S., and the largest private sector lender to Community Development Financial Institutions. For recent highlights of the bank’s ESG efforts, see page 38 of the Bank of America 2020 Annual Report. Further information can be found in the 2021 Proxy Statement and at www.bankofamerica.com/environment. Bank of America At Bank of America, we’re guided by a common purpose to help make financial lives better, through the power of every connection. We’re delivering on this through responsible growth with a focus on our environmental, social and governance (ESG) leadership. ESG is embedded across our eight lines of business and reflects how we help fuel the global economy, build trust and credibility, and represent a company that people want to work for, invest in and do business with. It’s demonstrated in the inclusive and supportive workplace we create for our employees, the responsible products and services we offer our clients, and the impact we make around the world in helping local economies thrive. An important part of this work is forming strong partnerships with nonprofits and advocacy groups, such as community, consumer and environmental organizations, to bring together our collective networks and expertise to achieve greater impact. Learn more at about.bankofamerica.com, and connect with us on Twitter (@BofA_News). For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210408005484/en/Bank-of-America-Increases-Environmental-Business-Initiative-Target-to-1-Trillion-by-2030",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T09:00:00-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-08 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Increases Environmental Business Initiative Target to $1 Trillion by 2030",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-increases-environmental-business-initiative-target-to-1-20210408.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced a goal of deploying and mobilizing $1 trillion by 2030 in its Environmental Business Initiative in order to accelerate the transition to a low-carbon, sustainable economy. This commitment will anchor a broader $1.5 trillion sustainable finance goal by both environmental transition and social inclusive development purposes, spanning business activities across the globe. “The private sector is well-positioned to ensure that the cap",
    "url": "https://www.businesswire.com/news/home/20210408005484/en/Bank-of-America-Increases-Environmental-Business-Initiative-Target-to-1-Trillion-by-2030/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-08T09:00:00-04:00",
    "date_et": "2021-04-08"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-09 18:10:19",
    "publisher": "Zacks Investment Research",
    "title": "Looking Ahead to Big Banks' Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/looking-ahead-to-big-banks-q1-earnings-20210409.jpg",
    "site": "zacks.com",
    "text": "Looking Ahead to Big Banks' Q1 Earnings",
    "url": "https://www.zacks.com/commentary/1371108/looking-ahead-to-big-banks-q1-earnings",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-09T18:10:19-04:00",
    "date_et": "2021-04-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-09 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Declares Preferred Stock Dividends",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-declares-preferred-stock-dividends-20210409.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced the Board of Directors has authorized regular cash dividends on the outstanding shares or depositary shares of the following series of preferred stock: Series of Preferred Stock Dividend per Share or Depositary Share1 Record Date Payment Date Floating Rate Non-Cumulative, Series E $0.24722 April 30 May 17 Floating Rate Non-Cumulative, Series F $1,022.22222 May 28 June 15 Adjustable Rate Non-Cumulative, Series G $1,022.22222 May 28 June 15 Fixed-to-Floating Rate Non-Cumulative, Series U $26.00 May 15 June 1 Floating Rate Non-Cumulative Preferred Stock, Series 1 $0.18750 May 15 May 28 Floating Rate Non-Cumulative Preferred Stock, Series 2 $0.18542 May 15 May 28 Floating Rate Non-Cumulative Preferred Stock, Series 4 $0.24722 May 15 May 28 Floating Rate Non-Cumulative Preferred Stock, Series 5 $0.24722 May 1 May 21 6.000% Non-Cumulative Preferred Stock, Series GG $0.375 May 1 May 17 Fixed-to-Floating Rate Non-Cumulative, Series JJ $25.625 June 1 June 21 5.375% Non-Cumulative Preferred Stock, Series KK $0.3359375 June 1 June 25 5.000% Non-Cumulative Preferred Stock, Series LL $0.3125 June 1 June 17 1 Each series of preferred stock, other than Series F and Series G, is represented by depositary shares. Dividend payments are made on a quarterly basis for each series of preferred stock, other than Series U and Series JJ, for which dividends are paid on a semi-annual basis. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210409005369/en/Bank-of-America-Declares-Preferred-Stock-Dividends",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-09T16:15:00-04:00",
    "date_et": "2021-04-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-09 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Declares Preferred Stock Dividends",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-declares-preferred-stock-dividends-20210409.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced the Board of Directors has authorized regular cash dividends on the outstanding shares or depositary shares of the following series of preferred stock: Series of Preferred Stock   Dividend per Share or Depositary Share1   Record Date   Payment Date Floating Rate Non-Cumulative, Series E   $0.24722   April 30   May 17 Floating Rate Non-Cumulative, Series F   $1,022.22222   May 28   June 15 Adjustable Rate Non-Cumulativ",
    "url": "https://www.businesswire.com/news/home/20210409005369/en/Bank-of-America-Declares-Preferred-Stock-Dividends/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-09T16:15:00-04:00",
    "date_et": "2021-04-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-09 12:34:48",
    "publisher": "GuruFocus",
    "title": "Oakmark's Bill Nygren Discusses Where He Sees Value Currently",
    "image": "https://images.financialmodelingprep.com/news/oakmarks-bill-nygren-discusses-where-he-sees-value-currently-20210409.jpg",
    "site": "gurufocus.com",
    "text": "Oakmark Funds' Bill Nygren (Trades, Portfolio) discussed some of his top picks with CNBC's senior markets commentator Michael Santoli in an exclusive interview on Wednesday.",
    "url": "https://www.gurufocus.com/news/1395983/oakmarks-bill-nygren-discusses-where-he-sees-value-currently",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-09T12:34:48-04:00",
    "date_et": "2021-04-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-09 11:42:51",
    "publisher": "InvestorPlace",
    "title": "Market Update: The 10 Most Active Stocks Today",
    "image": "https://images.financialmodelingprep.com/news/market-update-the-10-most-active-stocks-today-20210409.jpg",
    "site": "investorplace.com",
    "text": "We're almost halfway through the trading day for Friday and it's time for a market update covering the most active stocks today. The post Market Update: The 10 Most Active Stocks Today appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/04/market-update-the-10-most-active-stocks-today/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-09T11:42:51-04:00",
    "date_et": "2021-04-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-11 15:00:00",
    "publisher": "Barron's",
    "title": "JPMorgan Chase, Nvidia, Goldman Sachs, Delta, and Other Stocks to Watch This Week",
    "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-nvidia-goldman-sachs-delta-and-other-stocks-to-20210411.jpg",
    "site": "barrons.com",
    "text": "First-quarter earnings season begins this week. Big banks JPMorgan Chase, Goldman Sachs, and Morgan Stanley report.",
    "url": "https://www.barrons.com/articles/jpmorgan-chase-nvidia-goldman-sachs-delta-and-other-stocks-for-investors-to-watch-this-week-51618167609",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-11T15:00:00-04:00",
    "date_et": "2021-04-11"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-11 07:07:00",
    "publisher": "The Motley Fool",
    "title": "\"No Reason to Be Bearish\" -- Is Wall Street Too Confident?",
    "image": "https://images.financialmodelingprep.com/news/no-reason-to-be-bearish-is-wall-street-too-20210411.jpg",
    "site": "fool.com",
    "text": "Investor confidence is extremely high right now, but is your stock portfolio at risk if you ignore some warning signs?",
    "url": "https://www.fool.com/investing/2021/04/11/no-reason-to-be-bearish-is-wall-street-too-confide/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-11T07:07:00-04:00",
    "date_et": "2021-04-11"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 18:45:54",
    "publisher": "Pulse2",
    "title": "BAC Stock: $41 Target (Up From $33) By Jefferies",
    "image": "https://images.financialmodelingprep.com/news/bac-stock-41-target-up-from-33-by-jefferies-20210412.jpg",
    "site": "pulse2.com",
    "text": "The shares of Bank of America Corp (NYSE: BAC) have received a price target increase from $33 to $41 by Jefferies. These are the details.",
    "url": "https://pulse2.com/bac-stock-nyse-bank-of-america-41-target-up-from-33-by-jefferies/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T18:45:54-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 15:11:03",
    "publisher": "Zacks Investment Research",
    "title": "How Will Bank ETFs Fare This Earnings Season?",
    "image": "https://images.financialmodelingprep.com/news/how-will-bank-etfs-fare-this-earnings-season-20210412.jpg",
    "site": "zacks.com",
    "text": "Big banks will start releasing their quarterly numbers this week. The outlook is pretty bullish this time as most of the big banks saw their earnings estimates going up in the past 7-,30-,60-,90-day-periods.",
    "url": "https://www.zacks.com/stock/news/1385571/how-will-bank-etfs-fare-this-earnings-season",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T15:11:03-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 13:42:26",
    "publisher": "InvestorPlace",
    "title": "Even After a Monster Run, Bank of America Shares May Still Be Right-Priced",
    "image": "https://images.financialmodelingprep.com/news/even-after-a-monster-run-bank-of-america-shares-20210412.jpg",
    "site": "investorplace.com",
    "text": "As market traders gear up for an upcoming earnings release, BAC stock might look pricey, but there's still value to be found here. The post Even After a Monster Run, Bank of America Shares May Still Be Right-Priced appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/04/even-after-a-monster-run-bac-stock-may-still-be-right-priced/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T13:42:26-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 12:03:02",
    "publisher": "Pulse2",
    "title": "ANSS Stock: $400 Target By Bank Of America",
    "image": "https://images.financialmodelingprep.com/news/anss-stock-400-target-by-bank-of-america-20210412.jpg",
    "site": "pulse2.com",
    "text": "The shares of ANSYS, Inc. (NASDAQ:ANSS) have received a $400 target by Bank of America. These are the details.",
    "url": "https://pulse2.com/anss-stock-nasdaq-ansys-400-target-by-bank-of-america/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T12:03:02-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 08:29:00",
    "publisher": "Business Wire",
    "title": "Citi, Bank of America to Lead Development of Independent Data and Execution Platform",
    "image": "https://images.financialmodelingprep.com/news/citi-bank-of-america-to-lead-development-of-independent-data-20210412.jpg",
    "site": "businesswire.com",
    "text": "NEW YORK--(BUSINESS WIRE)--Citi and Bank of America are working together to build a new industry-led independent data and execution platform for fixed income markets. The venture plans to develop a next generation trading, data and analytics platform for structured credit and underlying collateral markets. The contemplated multi-dealer platform will focus initially on CLOs and syndicated loans, with plans to expand into other asset classes. Bank of America and Citi initiated the build of this p",
    "url": "https://www.businesswire.com/news/home/20210412005191/en/Citi-Bank-of-America-to-Lead-Development-of-Independent-Data-and-Execution-Platform/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T08:29:00-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-12 07:39:31",
    "publisher": "24/7 Wall Street",
    "title": "Red-Hot Banks Report Earnings This Week: 4 Stocks to Buy Before They Do",
    "image": "https://images.financialmodelingprep.com/news/redhot-banks-report-earnings-this-week-4-stocks-to-20210412.jpg",
    "site": "247wallst.com",
    "text": "As we have noted many times, one of the few sectors where companies applaud higher interest rates is the financials.",
    "url": "https://247wallst.com/banking-finance/2021/04/12/red-hot-banks-report-earnings-this-week-4-stocks-to-buy-before-they-do/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-12T07:39:31-04:00",
    "date_et": "2021-04-12"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-13 17:25:18",
    "publisher": "Zacks Investment Research",
    "title": "5 Red-Hot Big Bank Earnings Charts",
    "image": "https://images.financialmodelingprep.com/news/5-redhot-big-bank-earnings-charts-20210413.jpg",
    "site": "zacks.com",
    "text": "The big banks are no longer market laggards as many have broken out to new 5-year highs.",
    "url": "https://www.zacks.com/stock/news/1391262/5-red-hot-big-bank-earnings-charts",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-13T17:25:18-04:00",
    "date_et": "2021-04-13"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-13 14:07:53",
    "publisher": "InvestorPlace",
    "title": "Bank of America Is Worth 46% More Once Dividend Hikes Resume",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-is-worth-46-more-once-dividend-20210413.jpg",
    "site": "investorplace.com",
    "text": "Bank of America actually has four impending tailwings that could propel it higher. Thus, I think BAC stock will soon be worth $57.43.",
    "url": "https://investorplace.com/2021/04/bac-stock-is-worth-at-least-44-percent-more-at-57-43-given-a-dividend-hike/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-13T14:07:53-04:00",
    "date_et": "2021-04-13"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-13 12:30:18",
    "publisher": "24/7 Wall Street",
    "title": "Earnings Previews: Bank of America, Citigroup, BlackRock",
    "image": "https://images.financialmodelingprep.com/news/earnings-previews-bank-of-america-citigroup-blackrock-20210413.jpg",
    "site": "247wallst.com",
    "text": "The first big week of the new earnings season continues with several big companies reporting earnings before Thursday's opening bell.",
    "url": "https://247wallst.com/banking-finance/2021/04/13/earnings-previews-bank-of-america-citigroup-blackrock/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-13T12:30:18-04:00",
    "date_et": "2021-04-13"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-13 09:06:14",
    "publisher": "Zacks Investment Research",
    "title": "Investment Banking to Aid BofA (BAC) Q1 Earnings Amid Weak Loans",
    "image": "https://images.financialmodelingprep.com/news/investment-banking-to-aid-bofa-bac-q1-earnings-amid-20210413.jpg",
    "site": "zacks.com",
    "text": "Solid investment banking fees, rise in equity trading, steepening of yield curve and reserve releases might have boosted BofA (BAC) Q1 earnings despite soft loan demand and lower fixed income trading.",
    "url": "https://www.zacks.com/stock/news/1389554/investment-banking-to-aid-bofa-bac-q1-earnings-amid-weak-loans",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-13T09:06:14-04:00",
    "date_et": "2021-04-13"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-13 06:30:00",
    "publisher": "Forbes",
    "title": "Bank of America Stock To Beat Earnings Estimates In Q1?",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-stock-to-beat-earnings-estimates-in-20210413.jpg",
    "site": "forbes.com",
    "text": "Bank of America is scheduled to report its fiscal Q1 2021 results on Thursday, April 15. We expect Bank of America to miss the consensus estimates for revenues, while earnings are likely to surpass expectations.",
    "url": "https://www.forbes.com/sites/greatspeculations/2021/04/13/bank-of-america-stock-to-beat-earnings-estimates-in-q1/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-13T06:30:00-04:00",
    "date_et": "2021-04-13"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 19:45:05",
    "publisher": "Zacks Investment Research",
    "title": "A Positive Start to Q1 Earnings Season",
    "image": "https://images.financialmodelingprep.com/news/a-positive-start-to-q1-earnings-season-20210414.jpg",
    "site": "zacks.com",
    "text": "A Positive Start to Q1 Earnings Season",
    "url": "https://www.zacks.com/commentary/1396697/a-positive-start-to-q1-earnings-season",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T19:45:05-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 19:45:04",
    "publisher": "Zacks Investment Research",
    "title": "A Positive Start to Q1 Earnings Season",
    "image": "https://images.financialmodelingprep.com/news/a-positive-start-to-q1-earnings-season-20210414.jpg",
    "site": "zacks.com",
    "text": "A Positive Start to Q1 Earnings Season",
    "url": "https://www.zacks.com/commentary/1396747/a-positive-start-to-q1-earnings-season",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T19:45:04-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 15:11:55",
    "publisher": "Market Watch",
    "title": "Bank of America stock swings to a gain ahead of earnings",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-stock-swings-to-a-gain-ahead-20210414.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Bank of America Corp. has swung to a gain of 1.5% in afternoon trading, reversing an earlier intraday loss of as much as 1.0%, a day before the bank is slated to report first-quarter results. The stock is trading just shy of the 13-year closing high of $40.05 on April 7.",
    "url": "https://www.marketwatch.com/story/bank-of-america-stock-swings-to-a-gain-ahead-of-earnings-2021-04-14",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T15:11:55-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 15:05:46",
    "publisher": "ETF Trends",
    "title": "Bank ETFs Get a Boost from Corporate Earnings",
    "image": "https://images.financialmodelingprep.com/news/bank-etfs-get-a-boost-from-corporate-earnings-20210414.jpg",
    "site": "etftrends.com",
    "text": "Bank stocks and ETFs have been soaring on Wednesday thanks to increases in banking profits that beat analyst expectations. JPMorgan Chase & Co. reported an almost 5 times increase in quarterly profits thanks to surging markets and an economic recovery that enabled the bank to mobilize $5.2 billion in funds that it had set aside [.",
    "url": "https://www.etftrends.com/bank-etfs-get-a-boost-from-corporate-earnings/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T15:05:46-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 11:55:47",
    "publisher": "Investopedia",
    "title": "Bank of America Earnings: What to Look For",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-earnings-what-to-look-for-20210414.jpg",
    "site": "investopedia.com",
    "text": "Bank of America (BAC) reports Q1 earnings before market open on April 15. Can it reverse its declining revenue and net interest margin?",
    "url": "https://www.investopedia.com/bank-of-america-bac-q1-2021-earnings-preview-5176544",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T11:55:47-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 11:25:17",
    "publisher": "Zacks Investment Research",
    "title": "Big Banks Kick off Q1 Earnings Season",
    "image": "https://images.financialmodelingprep.com/news/big-banks-kick-off-q1-earnings-season-20210414.jpg",
    "site": "zacks.com",
    "text": "Big Banks Kick off Q1 Earnings Season",
    "url": "https://www.zacks.com/stock/news/1395173/big-banks-kick-off-q1-earnings-season",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T11:25:17-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-14 09:00:00",
    "publisher": "Seeking Alpha",
    "title": "Upstart: Retooling The World's Credit Systems",
    "image": "https://images.financialmodelingprep.com/news/upstart-retooling-the-worlds-credit-systems-20210414.jpg",
    "site": "seekingalpha.com",
    "text": "Upstart: Retooling The World's Credit Systems",
    "url": "https://seekingalpha.com/article/4418882-upstart-retooling-worlds-credit-systems",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-14T09:00:00-04:00",
    "date_et": "2021-04-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 18:39:38",
    "publisher": "CNBC",
    "title": "Big bank stocks are 'dirt cheap' after posting earnings, Jim Cramer says",
    "image": "https://images.financialmodelingprep.com/news/big-bank-stocks-are-dirt-cheap-after-posting-earnings-20210415.jpeg",
    "site": "cnbc.com",
    "text": "\"The banks are doing pretty darned good, even if their stocks don't necessarily reflect that fact,\" the \"Mad Money\" host said.",
    "url": "https://www.cnbc.com/2021/04/15/jim-cramer-big-bank-stocks-are-dirt-cheap-after-posting-earnings.html",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T18:39:38-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 18:04:07",
    "publisher": "Seeking Alpha",
    "title": "Bank of America Corporation (BAC) CEO Brian Moynihan on Q1 2021 Results - Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-corporation-bac-ceo-brian-moynihan-on-20210415.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America Corporation (BAC) CEO Brian Moynihan on Q1 2021 Results - Earnings Call Transcript",
    "url": "https://seekingalpha.com/article/4419320-bank-of-america-corporation-bac-ceo-brian-moynihan-on-q1-2021-results-earnings-call",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T18:04:07-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 15:53:00",
    "publisher": "Business Wire",
    "title": "Bank of America informa resultados financeiros relativos ao primeiro trimestre de 2021",
    "image": "https://images.financialmodelingprep.com/news/bankofamerica-informa-resultados-financeiros-relativos-ao-primeiro-trimestre-de-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, Carolina do Norte--(BUSINESS WIRE)--O Bank of America informou hoje seus resultados financeiros relativos ao primeiro trimestre de 2021. O comunicado de imprensa, os documentos complementares e a apresentação aos investidores estão disponíveis pelos seguintes meios: Sala de imprensa do Bank of America em https://newsroom.bankofamerica.com Comunicado à imprensa sobre os resultados financeiros do Bank of America no primeiro trimestre de 2021 Apresentação de relações com investidores do Bank of America no primeiro trimestre de 2021 Informações suplementares do Bank of America no primeiro trimestre de 2021 Comunicado à imprensa sobre os resultados financeiros do Bank of America no primeiro trimestre de 2021 Apresentação de relações com investidores do Bank of America no primeiro trimestre de 2021 Informações suplementares do Bank of America no primeiro trimestre de 2021 Site de relações com investidores do Bank of America em https://investor.bankofamerica.com Página on-line de notícias da Business Wire em http://www.businesswire.com/portal/site/home/news Informações sobre teleconferência com investidores: O diretor executivo Brian Moynihan e o diretor financeiro Paul Donofrio conversarão sobre os resultados financeiros em uma teleconferência às 9h. ET (horário da costa leste dos EUA). Para apenas ouvir o áudio da teleconferência, ligue para 1.877.200.4456 (EUA) ou 1.785.424.1732 (outros países) e digite 79795, a identificação da teleconferência. Ligue 10 minutos antes do início da teleconferência. Os investidores também podem ouvir o webcast com áudio ao vivo da teleconferência e ver os slides da apresentação acessando a seção Events and Presentations (Eventos e apresentações) do site de relacionamento com investidores da empresa. Reproduzir informações da teleconferência com investidores: Os investidores poderão acessar gravações da teleconferência acessando o site de relacionamento com investidores ou ligando para 1.800.934.4850 (EUA) ou 1.402.220.1178 (outros países) do meio-dia de 15 de abril até às 23h59. de 25 de abril ET (horário da costa leste dos EUA). Bank of America O Bank of America é uma das maiores instituições financeiras do mundo, atendendo a consumidores individuais, empresas de pequeno e médio portes e grandes organizações, com um conjunto completo de produtos e serviços bancários, de investimento, gestão de ativos e outros produtos e serviços de gestão financeira e de riscos. A empresa oferece uma conveniência incomparável nos Estados Unidos, atendendo a aproximadamente 66 milhões de clientes pessoas físicas e pequenas empresas com cerca de 4.300 centros financeiros de varejo, incluindo aproximadamente 2.700 centros de empréstimo, 2.600 centros financeiros com um consultor de soluções financeiras de investimento a clientes e aproximadamente 2.400 centros de negócios, cerca de 17 mil caixas eletrônicos e um serviço bancário digital premiado com aproximadamente 40 milhões de usuários ativos, dentre os quais, mais de 31 milhões são usuários por dispositivos móveis. O Bank of America é líder global em gestão de patrimônio, serviços bancários corporativos, de investimento e comerciais em um amplo conjunto de classes de ativos, atendendo a empresas, governos, instituições e pessoas físicas do mundo todo. O Bank of America oferece assistência líder no setor a aproximadamente três milhões de pequenas empresas familiares por meio de uma grande variedade de produtos e serviços online inovadores e fáceis de usar. A empresa atende a clientes por meio de operações nos Estados Unidos, seus territórios e aproximadamente 35 países. As ações do Bank of America Corporation (NYSE: BAC) estão listadas na Bolsa de Valores de Nova York. Para obter mais notícias sobre o Bank of America, inclusive comunicados sobre dividendos e outras informações importantes, acesse a sala de imprensa do Bank of America e registre-se para receber alertas por e-mail de notícias. www.bankofamerica.com O texto no idioma original deste anúncio é a versão oficial autorizada. As traduções são fornecidas apenas como uma facilidade e devem se referir ao texto no idioma original, que é a única versão do texto que tem efeito legal.",
    "url": "https://www.businesswire.com/news/home/20210415006020/pt/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T15:53:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 14:51:48",
    "publisher": "CNBC",
    "title": "'These are the stocks we've got to focus on': Three market analysts cheer big bank earnings and flag their top picks",
    "image": "https://images.financialmodelingprep.com/news/these-are-the-stocks-weve-got-to-focus-on-20210415.jpg",
    "site": "cnbc.com",
    "text": "JPMorgan has a leg up on other bank stocks, CNBC's Jim Cramer and two other market analysts say.",
    "url": "https://www.cnbc.com/2021/04/15/jpmorgan-earnings-market-analysts-cheer-bank-earnings-flag-top-picks.html",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T14:51:48-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 14:37:38",
    "publisher": "CNN",
    "title": "Joe Biden bans US banks from buying or underwriting Russian debt sales",
    "image": "https://images.financialmodelingprep.com/news/joe-biden-bans-us-banks-from-buying-or-underwriting-20210415.jpg",
    "site": "cnn.com",
    "text": "The Biden administration is punishing Russia for its interference in the 2020 US election and cyberattacks by hitting Moscow where it hurts the most: the ruble.",
    "url": "https://www.cnn.com/2021/04/15/business/joe-biden-banks-russian-debt/index.html",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T14:37:38-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 14:15:48",
    "publisher": "ETF Trends",
    "title": "Mornings with Maria: Tom Lydon Talks Banks Earnings and ETF Inflows",
    "image": "https://images.financialmodelingprep.com/news/mornings-with-maria-tom-lydon-talks-banks-earnings-and-20210415.jpg",
    "site": "etftrends.com",
    "text": "Looking at first-quarter earnings, markets are higher. BlackRock and banks like Bank of America (BAC), JP Morgan (JPM), and Goldman Sachs (GS) beat expectations.",
    "url": "https://www.etftrends.com/mornings-with-maria-tom-lydon-on-etf-inflows/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T14:15:48-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 14:00:05",
    "publisher": "Benzinga",
    "title": "Bank Of America And Citigroup Struggle After Stellar Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-and-citigroup-struggle-after-stellar-q1-20210415.jpg",
    "site": "benzinga.com",
    "text": "Bank Of America Corporation (NYSE: BAC) and Citigroup Inc (NYSE: C) reported first-quarter 2021 earnings results Thursday morning and, like Goldman Sachs Group Inc (NYSE: GS), JPMorgan Chase & Co. (NYSE: JPM) and Wells Fargo (NYSE: WFC), beat expectations. The banking sector had been in a strong uptrend since November 2020 and has recently started to consolidate.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20647518/bank-of-america-and-citigroup-struggle-after-stellar-q1-earnings",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T14:00:05-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 13:58:19",
    "publisher": "Market Watch",
    "title": "Bank ETFs tumble even as earnings come in strong",
    "image": "https://images.financialmodelingprep.com/news/bank-etfs-tumble-even-as-earnings-come-in-strong-20210415.jpg",
    "site": "marketwatch.com",
    "text": "Exchange-traded funds tracking the banking sector fell Thursday even as big banks reported quarterly results that blew away analyst expectations. The broad Financial Select Sector SPDR Fund lost 0.5% midday Thursday, while funds more focused on banks were down more sharply: the Invesco KBW Bank ETF slid 1.7% and the First Trust Nasdaq Bank ETF was off 1.2%.",
    "url": "https://www.marketwatch.com/story/bank-etfs-tumble-even-as-earnings-come-in-strong-2021-04-15",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T13:58:19-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 13:39:00",
    "publisher": "Reuters",
    "title": "Congress to quiz Wall Street bank chief executives next month - statement",
    "image": "https://images.financialmodelingprep.com/news/congress-to-quiz-wall-street-bank-chief-executives-next-20210415.jpg",
    "site": "reuters.com",
    "text": "Congress will hold hearings next month with the chief executives of major Wall Street banks as Democratic lawmakers step up scrutiny of the role the industry has played in helping Americans recover from the COVID-19 pandemic.",
    "url": "https://www.reuters.com/article/us-usa-congress-bank-ceos/congress-to-quiz-wall-street-bank-chief-executives-next-month-statement-idUSKBN2C22I6",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T13:39:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 13:09:00",
    "publisher": "Business Wire",
    "title": "Bank of America déclare ses résultats financiers pour le premier trimestre 2021",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-dclare-ses-rsultats-financiers-pour-le-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, Caroline du Nord--(BUSINESS WIRE)--Bank of America a déclaré aujourd’hui ses résultats financiers du premier trimestre 2021. Le communiqué de presse, le dossier supplémentaire et la présentation pour investisseurs peuvent être consultés par les voies suivantes : Salle de rédaction de Bank of America sur https://newsroom.bankofamerica.com Communiqué de presse relatif aux résultats financiers de Bank of America pour le T1 2021 Présentation Relations avec les investisseurs Bank of America T1-2021 Informations supplémentaires Bank of America T1 2021 Communiqué de presse relatif aux résultats financiers de Bank of America pour le T1 2021 Présentation Relations avec les investisseurs Bank of America T1-2021 Informations supplémentaires Bank of America T1 2021 Site Web dédié aux relations avec les investisseurs de Bank of America sur https://investor.bankofamerica.com Page Web des nouvelles de Business Wire sur http://www.businesswire.com/portal/site/home/news Informations concernant la téléconférence pour les investisseurs : Le président-directeur général, Brian Moynihan, et le directeur financier, Paul Donofrio, commenteront les résultats financiers dans le cadre d’une téléconférence à 9h00, heure de l’Est, aujourd’hui. Pour écouter la téléconférence, appelez le 1.877.200.4456 (États-Unis) ou le 1.785.424.1732 (international), et utilisez l’identifiant de la conférence : 79795. Veuillez appeler 10 minutes avant le début de la téléconférence. Les investisseurs pourront également écouter une webdiffusion audio en direct de la téléconférence et consulter les diapositives de présentation en visitant la section Événements et présentations du site Web des Relations avec les investisseurs, de la société. Informations concernant la rediffusion de la téléconférence pour les investisseurs : Les investisseurs peuvent accéder aux rediffusions de la téléconférence en consultant le site Web dédié aux relations avec les investisseurs, ou en appelant le 1.800.934.4850 (États-Unis) ou le 1.402.220.1178 (international), à partir du 15 avril à 12h00, jusqu’à 23h59 (heure de l’Est) le 25 avril. Bank of America Bank of America, l’une des plus importantes institutions financières internationales, offre aux particuliers, aux petites et moyennes entreprises, ainsi qu’aux grandes sociétés une gamme complète de produits et services bancaires, d’investissement et de gestion d’actifs, ainsi que d’autres produits et services financiers et de gestion des risques. La société offre des services inégalés aux États-Unis, desservant près de 66 millions de particuliers et petites entreprises, avec environ 4 300 centres financiers de détail, dont environ 2 700 centres de prêts, 2 600 centres d’investissement avec un Conseiller client en solutions financières d’investissement, et près de 2 400 centres d’affaires ; environ 17 000 distributeurs automatiques de billets, ainsi qu’une banque en ligne, primée comptant environ 40 millions d’utilisateurs actifs, parmi lesquels figurent quelque 31 millions d’utilisateurs mobiles. Bank of America est un chef de file dans la gestion de patrimoine, les services bancaires aux entreprises et des services d’investissement et de négociations couvrant un large éventail de classes d’actifs et s’adressant aux sociétés, gouvernements, institutions et particuliers du monde entier. Bank of America offre la meilleure assistance du secteur à près de 3 millions de propriétaires de petites entreprises grâce à une gamme de produits et services en ligne innovants et faciles à utiliser. La société dessert ses clients via ses opérations aux États-Unis, dans ses territoires, et dans environ 35 pays. L’action Bank of America Corporation (NYSE : BAC) est cotée à la bourse de New York. Pour d’autres actualités sur Bank of America, notamment des annonces sur les dividendes et d’autres informations importantes, veuillez visiter la salle de presse de Bank of America, et inscrivez-vous pour recevoir des alertes sur les actualités par e-mail. www.bankofamerica.com Le texte du communiqué issu d’une traduction ne doit d’aucune manière être considéré comme officiel. La seule version du communiqué qui fasse foi est celle du communiqué dans sa langue d’origine. La traduction devra toujours être confrontée au texte source, qui fera jurisprudence.",
    "url": "https://www.businesswire.com/news/home/20210415005879/fr/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T13:09:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 12:29:45",
    "publisher": "InvestorPlace",
    "title": "Midday Market Update: The 10 Most Active Stocks Today",
    "image": "https://images.financialmodelingprep.com/news/midday-market-update-the-10-most-active-stocks-today-20210415.jpg",
    "site": "investorplace.com",
    "text": "It's time for the midday market update for Thursday as several companies are on the move with various increases and decreases. The post Midday Market Update: The 10 Most Active Stocks Today appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/04/midday-market-update-the-10-most-active-stocks-today/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T12:29:45-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 12:26:09",
    "publisher": "GuruFocus",
    "title": "Shares of Bank of America Fall Despite Strong 1st-Quarter Results",
    "image": "https://images.financialmodelingprep.com/news/shares-of-bank-of-america-fall-despite-strong-1stquarter-20210415.jpg",
    "site": "gurufocus.com",
    "text": "Boosted by strong investment banking and trading results, as well as the release of loan-loss reserves, Bank of America Corp. (NYSE:BAC) reported better-than-expected first-quarter financials before the opening bell on Thursday.",
    "url": "https://www.gurufocus.com/news/1398103/shares-of-bank-of-america-fall-despite-strong-1stquarter-results",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T12:26:09-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 12:15:58",
    "publisher": "Benzinga",
    "title": "Which Bank Stock Is The Best Buy Right Now?",
    "image": "https://images.financialmodelingprep.com/news/which-bank-stock-is-the-best-buy-right-now-20210415.jpg",
    "site": "benzinga.com",
    "text": "CNBC's \"Squawk Box\" co-anchor Andrew Ross Sorkin talked about banks and the financial sector Thursday with Pivotal Advisors Founder Tiffany McGhee and Douglas C. Lane & Associates Portfolio Manager Sarat Sethi.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20639083/which-bank-stock-is-the-best-buy-right-now",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T12:15:58-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 12:15:32",
    "publisher": "Benzinga",
    "title": "BofA Says GlaxoSmithKline's Decision To Halt Feladilimab Studies Is Disappointing",
    "image": "https://images.financialmodelingprep.com/news/bofa-says-glaxosmithklines-decision-to-halt-feladilimab-studies-is-20210415.jpg",
    "site": "benzinga.com",
    "text": "GlaxoSmithKline plc (NYSE: GSK) announced the termination of the Phase II and Phase III studies of feladilimab, its ICOS receptor agonist in head and neck cancer. This comes as a disappointment, as the candidate could potentially address a multimillion-dollar market, according to BofA Securities.",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/21/04/20641208/bofa-says-glaxosmithklines-decision-to-halt-feladilimab-studies-is-disappointing",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T12:15:32-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 11:59:00",
    "publisher": "Business Wire",
    "title": "Bank of America Informa los Resultados Financieros del Primer Trimestre de 2021",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-informa-los-resultados-financieros-del-primer-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, Carolina del Norte--(BUSINESS WIRE)--Bank of America informó hoy los resultados financieros del primer trimestre de 2021. Este comunicado de prensa, archivos complementarios y la presentación para inversores están disponibles en los siguientes sitios web: Sala de prensa de Bank of America: https://newsroom.bankofamerica.com Comunicado de prensa sobre los resultados financieros del T1-21 de Bank of America Presentación de relaciones con los inversores del T1-21 de Bank of America Información complementaria del T1-21 de Bank of America Comunicado de prensa sobre los resultados financieros del T1-21 de Bank of America Presentación de relaciones con los inversores del T1-21 de Bank of America Información complementaria del T1-21 de Bank of America Sitio web de Relaciones con los inversores de Bank of America: https://investor.bankofamerica.com Página web de noticias de Business Wire: http://www.businesswire.com/portal/site/home/news Información de la teleconferencia para inversores: Brian Moynihan, director ejecutivo, y Paul Donofrio, director financiero, hablarán sobre los resultados financieros en una teleconferencia hoy, a las 9:00 a. m., hora del este. Para una conexión solo para escuchar la teleconferencia, marque 1.877.200.4456 (EE. UU.) o 1.785.424.1732 (internacional) y la ID de la conferencia es 79795. Por favor, llame 10 minutos antes del inicio de la conferencia. Los inversores también pueden escuchar la transmisión en vivo por Internet de la teleconferencia y ver las diapositivas de la presentación si visitan la sección Events and Presentations (Eventos y presentaciones) del sitio web de Relaciones con los inversores de la compañía. Repetición de la información para la teleconferencia para inversores: Los inversores pueden acceder a las repeticiones de la teleconferencia a través del sitio web de Relaciones con los inversores o llamando al 1-800-934-4850 (EE. UU.) o al 1-402-220-1178 (internacional), desde el mediodía del 15 de abril hasta las 11:59 p. m., hora del este del 25 de abril. Bank of America Bank of America es una de las instituciones financieras más grandes del mundo, que presta servicios a clientes individuales, a pequeñas y medianas empresas y a grandes corporaciones, con una amplia gama de operaciones bancarias, de inversión, administración de activos y otros productos y servicios de gestión de riesgo y carácter financiero. La compañía brinda un servicio incomparable en los Estados Unidos de América; atiende a, aproximadamente, 66 millones de clientes individuales y pequeñas empresas, con cerca de 4300 centros financieros minoristas, que incluyen alrededor de 2700 centros de préstamos, 2600 centros financieros con un asesor de soluciones financieras de inversión para consumidores y, aproximadamente, 2400 centros de negocios; unos 17 000 cajeros automáticos y una banca digital galardonada que cuenta con más de 40 millones de usuarios activos, incluidos unos 31 millones de usuarios móviles. Bank of America es líder mundial en gestión patrimonial, banca corporativa y de inversión y operaciones en una amplia gama de clases de activos, al tiempo que presta servicios a corporaciones, gobiernos, instituciones e individuos en todo el mundo. Bank of America ofrece un respaldo líder en la industria a unos 3 millones de hogares de pequeñas empresas a través de una serie de productos y servicios en línea innovadores y fáciles de usar. La compañía brinda servicios a clientes a través de operaciones en todo los Estados Unidos de América, en sus territorios y aproximadamente 35 países. Las acciones de Bank of America Corporation (NYSE: BAC) cotizan en la Bolsa de Valores de Nueva York. Si desea conocer las noticias de Bank of America, incluidos los anuncios de dividendos y demás información importante, visite la sala de prensa de Bank of America y regístrese para recibir avisos de noticias por correo electrónico. www.bankofamerica.com El texto original en el idioma fuente de este comunicado es la versión oficial autorizada. Las traducciones solo se suministran como adaptación y deben cotejarse con el texto en el idioma fuente, que es la única versión del texto que tendrá un efecto legal.",
    "url": "https://www.businesswire.com/news/home/20210415005807/es/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T11:59:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 11:41:00",
    "publisher": "Business Wire",
    "title": "Bank of America comunica i risultati finanziari registrati nel primo trimestre del 2021",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-comunica-i-risultati-finanziari-registrati-nel-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, Carolina del Nord--(BUSINESS WIRE)--Bank of America ha comunicato oggi i risultati finanziari registrati nel primo trimestre del 2021. Si può accedere al comunicato stampa, ad altri documenti depositati e alla presentazione per gli investitori nei seguenti modi: Sala stampa di Bank of America all’indirizzo https://newsroom.bankofamerica.com Comunicato stampa sui risultati finanziari di Bank of America per il 1° trimestre 2021 Presentazione per le relazioni con gli investitori di Bank of America per il 1° trimestre 2021 Informazioni supplementari su Bank of America per il 1° trimestre 2021 Comunicato stampa sui risultati finanziari di Bank of America per il 1° trimestre 2021 Presentazione per le relazioni con gli investitori di Bank of America per il 1° trimestre 2021 Informazioni supplementari su Bank of America per il 1° trimestre 2021 Sito web di Bank of America dedicato alle relazioni con gli investitori all’indirizzo https://investor.bankofamerica.com Pagina web delle notizie di Business Wire all’indirizzo http://www.businesswire.com/portal/site/home/news Informazioni sulla teleconferenza per gli investitori: L'amministratore delegato Brian Moynihan e il direttore finanziario Paul Donofrio discuteranno i risultati finanziari durante una teleconferenza che si terrà oggi alle ore 9:00 del fuso orario della costa orientale degli Stati Uniti di oggi. Il testo originale del presente annuncio, redatto nella lingua di partenza, è la versione ufficiale che fa fede. Le traduzioni sono offerte unicamente per comodità del lettore e devono rinviare al testo in lingua originale, che è l'unico giuridicamente valido.",
    "url": "https://www.businesswire.com/news/home/20210415005785/it/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T11:41:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 11:22:08",
    "publisher": "Zacks Investment Research",
    "title": "Big Morning for Econ Data, Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/big-morning-for-econ-data-q1-earnings-20210415.jpg",
    "site": "zacks.com",
    "text": "Time to wake up: no fewer than six major economic prints are hitting the tape ahead of today's opening bell, along with big banks continuing to bring Q1 earnings results.",
    "url": "https://www.zacks.com/stock/news/1400263/big-morning-for-econ-data-q1-earnings",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T11:22:08-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 11:22:06",
    "publisher": "Zacks Investment Research",
    "title": "Economic Data Deluge",
    "image": "https://images.financialmodelingprep.com/news/economic-data-deluge-20210415.jpg",
    "site": "zacks.com",
    "text": "Economic Data Deluge",
    "url": "https://www.zacks.com/stock/news/1400306/economic-data-deluge",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T11:22:06-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 11:13:54",
    "publisher": "PYMNTS",
    "title": "Bank of America's Profits Double; 40.3 Million Customers Use Digital Banking",
    "image": "https://images.financialmodelingprep.com/news/bank-of-americas-profits-double-403-million-customers-use-20210415.jpg",
    "site": "pymnts.com",
    "text": "With the pandemic economic crisis fading, Bank of America said on Thursday (April 15) that it had released $2.7 billion of the cash it had socked away last year for possible losses. The move doubled its first-quarter profits — from $4.01 billion in 2020 to $8.05 billion, the company said in a press release.",
    "url": "https://www.pymnts.com/earnings/2021/bank-of-america-profits-double-40m-customers-use-digital-banking/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T11:13:54-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 10:37:32",
    "publisher": "Zacks Investment Research",
    "title": "BofA (BAC) Q1 Earnings Beat on Big Reserve Release, Fee Income",
    "image": "https://images.financialmodelingprep.com/news/bofa-bac-q1-earnings-beat-on-big-reserve-release-20210415.jpg",
    "site": "zacks.com",
    "text": "Robust trading and investment banking performance and reserve release support BofA's (BAC) Q1 earnings despite low interest rates and weak loan demand.",
    "url": "https://www.zacks.com/stock/news/1400325/bofa-bac-q1-earnings-beat-on-big-reserve-release-fee-income",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T10:37:32-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 10:23:00",
    "publisher": "Business Wire",
    "title": "Bank of America veröffentlicht Finanzergebnisse für das erste Quartal 2021",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-verffentlicht-finanzergebnisse-fr-das-erste-quartal-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, North Carolina, USA--(BUSINESS WIRE)--Die Bank of America hat heute ihre Finanzergebnisse für das erste Quartal 2021 veröffentlicht. Auf die Pressemitteilung, die ergänzende Einreichung und die Präsentation für Anleger können Sie wie folgt zugreifen: Newsroom der Bank of America unter http://newsroom.bankofamerica.com Q1-21 Bank of America Pressemitteilung zu den Finanzergebnissen Q1-21 Bank of America Präsentation zur Anlegerpflege Q1-21 Bank of America ergänzende Informationen Q1-21 Bank of America Pressemitteilung zu den Finanzergebnissen Q1-21 Bank of America Präsentation zur Anlegerpflege Q1-21 Bank of America ergänzende Informationen Webseite für Anlegerpflege der Bank of America unter https://investor.bankofamerica.com Nachrichten-Webseite von Business Wire unter http://www.businesswire.com/portal/site/home/news Informationen zur Telefonkonferenz für Investoren: Chief Executive Officer Brian Moynihan und Chief Financial Officer Paul Donofrio werden die Finanzergebnisse im Rahmen einer Telefonkonferenz heute um 09:00 Uhr US-Ostküstenzeit (Eastern Time, ET; 15:00 Uhr MEZ) erläutern. Für eine reine Audio-Verbindung zur Telefonkonferenz wählen Sie bitte +1 877 200 4456 (USA) oder +1 785 424 1732 (international) und die Konferenz-ID 79795. Bitte wählen Sie die Nummer zehn Minuten vor Beginn der Konferenz. Anleger können auch einem Live-Audio-Webcast der Telefonkonferenz zuhören und sich die Präsentationsfolien im Abschnitt Events & Presentations der Webseite des Unternehmens für Anlegerpflege ansehen. Informationen zum erneuten Anhören der Telefonkonferenz für Investoren: Investoren können sich die Telefonkonferenz erneut auf der Webseite für Anlegerpflege anhören oder sie vom 15. April um 12.00 Uhr ET (18:00 MEZ) bis zum 25. April um 23.59 (26. April um 5:59 MEZ) über die Nummer 1.800.934.4850 (USA) oder 1.402.220.1178 (international) abrufen. Bank of America Die Bank of America ist eines der weltweit größten Finanzinstitute mit einem Angebot für Privatkunden, kleine und mittlere Unternehmen sowie Großkonzerne, das sämtliche Produkte und Dienstleistungen in den Bereichen Banking, Investment, Vermögensverwaltung und sonstiges Finanz- und Risikomanagement umfasst. Das Unternehmen bietet seinen Kunden in den USA beispiellosen Komfort: Die Bank bedient etwa 66 Millionen Privat- und KMU-Kunden mit rund 4.300 Zweigstellen, darunter rund 2.700 Kreditzentren, 2.600 Finanzzentren mit Beratern für Finanzlösungen für private Investitionen und 2.400 Geschäftszentren, etwa 17.000 Geldautomaten und einem preisgekrönten Digital-Banking-System mit nahezu 40 Millionen aktiven Nutzern, darunter rund 31 Millionen Nutzer auf Mobilgeräten. Die Bank of America gehört zu den weltweit führenden Unternehmen in den Bereichen Vermögensverwaltung, Corporate und Investment Banking sowie beim Handel mit einer breiten Palette von Anlageklassen und betreut Unternehmen, Regierungen, Institutionen und Privatpersonen auf der ganzen Welt. Mit einer Suite innovativer, benutzerfreundlicher Online-Produkte und -Dienstleistungen bietet die Bank of America rund 3 Millionen Kleinunternehmer-Haushalten branchenführende Unterstützung. Das Unternehmen betreut seine Kunden über Niederlassungen in den USA, deren Territorien und rund 35 Ländern. Aktien der Bank of America Corporation (NYSE: BAC) sind an der New Yorker Börse notiert. Weitere Nachrichten der Bank of America, einschließlich Dividendenankündigungen und anderer wichtiger Informationen, gehen Sie bitte zum Newsroom der Bank of America und registrieren Sie sich für E-Mail-Benachrichtigungen. www.bankofamerica.com Die Ausgangssprache, in der der Originaltext veröffentlicht wird, ist die offizielle und autorisierte Version. Übersetzungen werden zur besseren Verständigung mitgeliefert. Nur die Sprachversion, die im Original veröffentlicht wurde, ist rechtsgültig. Gleichen Sie deshalb Übersetzungen mit der originalen Sprachversion der Veröffentlichung ab.",
    "url": "https://www.businesswire.com/news/home/20210415005697/de/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T10:23:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 10:17:57",
    "publisher": "Invezz",
    "title": "Here's why Bank of America stock price fell despite stellar Q1 results",
    "image": "https://images.financialmodelingprep.com/news/heres-why-bank-of-america-stock-price-fell-despite-20210415.jpg",
    "site": "invezz.com",
    "text": "Shares of Bank of America Corp (NYSE: BAC) are trading in a volatile manner today after the company reported its first-quarter earnings.  Profit more than doubled in Q1 2021 Bank of America Corp reported that its profit more than doubled in Q1 as the bank deployed reserves to compensate for potential loan losses amid the […] The post Here's why Bank of America stock price fell despite stellar Q1 results appeared first on Invezz.",
    "url": "https://invezz.com/news/2021/04/15/heres-why-bank-of-america-stock-price-fell-despite-stellar-q1-results/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T10:17:57-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 09:43:59",
    "publisher": "Schaeffers Research",
    "title": "BAC Inches Higher After Impressive Q1 Results",
    "image": "https://images.financialmodelingprep.com/news/bac-inches-higher-after-impressive-q1-results-20210415.jpg",
    "site": "schaeffersresearch.com",
    "text": "Bank of America Corp (NYSE:BAC) stepped into the earnings confessional this morning, becoming the latest bank name to chime in on a strong start to earnings season.",
    "url": "https://www.schaeffersresearch.com/content/news/2021/04/15/bac-inches-higher-after-impressive-q1-results",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T09:43:59-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 09:36:25",
    "publisher": "Invezz",
    "title": "Bank of America's profit more than doubles in the fiscal first quarter",
    "image": "https://images.financialmodelingprep.com/news/bank-of-americas-profit-more-than-doubles-in-the-20210415.jpg",
    "site": "invezz.com",
    "text": "Bank of America Corp. (NYSE: BAC) said on Thursday that its profit more than doubled in the fiscal first quarter. On the back of hawkish performance that it attributed to lower credit costs and robust growth in capital markets, the investment bank authorised a stock buyback programme worth £18.12 billion.",
    "url": "https://invezz.com/news/2021/04/15/bank-of-americas-profit-more-than-doubles-in-the-fiscal-first-quarter/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T09:36:25-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 08:20:12",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America (BAC) Surpasses Q1 Earnings and Revenue Estimates",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-bac-surpasses-q1-earnings-and-revenue-20210415.jpg",
    "site": "zacks.com",
    "text": "Bank of America (BAC) delivered earnings and revenue surprises of 32.31% and 4.18%, respectively, for the quarter ended March 2021. Do the numbers hold clues to what lies ahead for the stock?",
    "url": "https://www.zacks.com/stock/news/1399527/bank-of-america-bac-surpasses-q1-earnings-and-revenue-estimates",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T08:20:12-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 08:15:33",
    "publisher": "Investopedia",
    "title": "Bank of America Earnings: What Happened",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-earnings-what-happened-20210415.jpg",
    "site": "investopedia.com",
    "text": "Bank of America's (BAC) earnings exceeded analysts' expectations, as did revenue. However, net interest margin missed estimates.",
    "url": "https://www.investopedia.com/bank-of-america-q1-fy2021-earnings-report-recap-5176615",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T08:15:33-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 08:14:36",
    "publisher": "Pulse2",
    "title": "BAC Stock: Over 1% Increase Pre-Market Explanation",
    "image": "https://images.financialmodelingprep.com/news/bac-stock-over-1-increase-premarket-explanation-20210415.jpg",
    "site": "pulse2.com",
    "text": "The stock price of Bank of America Corp (NYSE: BAC) increased by over 1% pre-market. This is why it happened.",
    "url": "https://pulse2.com/bac-stock-nyse-bank-of-america-over-1-increase-pre-market-explanation/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T08:14:36-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 07:56:17",
    "publisher": "Proactive Investors",
    "title": "Wall Street expected to start higher as earnings season picks up steam",
    "image": "https://images.financialmodelingprep.com/news/wall-street-expected-to-start-higher-as-earnings-season-20210415.jpg",
    "site": "proactiveinvestors.com",
    "text": "Wall Street is forecast to make a positive start to trading, with sentiment still buoyant after Wednesday's positive results from Goldman Sachs. We have already had better than expected results from Bank of America Corp (NYSE:BAC) and PepsiCo Inc (NASDAQ:PEP) to keep the upbeat mood going.",
    "url": "https://www.proactiveinvestors.com//companies/news/946699/wall-street-expected-to-start-higher-as-earnings-season-picks-up-steam-946699.html?SNAPI",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T07:56:17-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 07:45:00",
    "publisher": "Barron's",
    "title": "Bank of America Gains on Earnings Beat. What to Know.",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-gains-on-earnings-beat-what-to-20210415.jpg",
    "site": "barrons.com",
    "text": "The bank was able to overcome the impact of low yields with strong capital markets and investment banking activity",
    "url": "https://www.barrons.com/articles/bank-of-america-stock-gains-on-earnings-beat-what-to-know-51618487114",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T07:45:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 07:40:00",
    "publisher": "Business Wire",
    "title": "Bank of America maakt financiële resultaten over het eerste kwartaal van 2021 bekend",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-maakt-financile-resultaten-over-het-eerste-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America heeft vandaag haar financiële resultaten over het eerste kwartaal van 2021 gerapporteerd. Het persbericht, aanvullende indiening en beleggerspresentatie zijn op de volgende manieren toegankelijk: Bank of America newsroom op https://newsroom.bankofamerica.com Q1-21 Bank of America Financiele resultaten persbericht Q1-21 Bank of America Investeringsrelaties presentatie Q1-21 Bank of America Aanvullende informatie Q1-21 Bank of America Financiele resultaten persbericht Q1-21 Bank of America Investeringsrelaties presentatie Q1-21 Bank of America Aanvullende informatie Bank of America investeringsrelaties op https://investor.bankofamerica.com Business Wire’s nieuwspagina op http://www.businesswire.com/portal/site/home/news Informatie over telefonische vergadering voor investeerders: Chief Executive Officer Brian Moynihan en Chief Financial Officer Paul Donofrio zullen de financiële resultaten vandaag bespreken in een teleconferentie om 9 uur ET. Voor een alleen-luisteren-verbinding met het conferentiegesprek, kiest u 1.877.200.4456 (VS) of 1.785.424.1732 (internationaal) en de conferentie-ID is 79795. Deze bekendmaking is officieel geldend in de originele brontaal. Vertalingen zijn slechts als leeshulp bedoeld en moeten worden vergeleken met de tekst in de brontaal, die als enige rechtsgeldig is.",
    "url": "https://www.businesswire.com/news/home/20210415005553/nl/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T07:40:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 07:06:06",
    "publisher": "Business Insider",
    "title": "Bank of America smashes forecasts to double profits in 1st-quarter earnings as the US rebound boosts Wall Street (BAC)",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-smashes-forecasts-to-double-profits-in-20210415.jpg",
    "site": "markets.businessinsider.com",
    "text": "Bank of America's first-quarter earnings smashed analysts' estimates on Thursday, with profits more than doubling year on year to $8.1 billion as the bank released reserves set aside to cover coronavirus loan losses. BofA's $8.1 billion of net income was far higher than analysts' forecasts of $6.25 billion and was up from $4 billion a year earlier, when the pandemic weighed on banks. It pushed earnings per share to $0.86, well above the consensus estimate of $0.66.",
    "url": "https://markets.businessinsider.com/news/stocks/bank-of-america-q1-earnings-smash-forecasts-profit-doubles-trading-2021-4-1030307606",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T07:06:06-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 07:05:15",
    "publisher": "Benzinga",
    "title": "Recap: Bank of America Q1 Earnings",
    "image": "https://images.financialmodelingprep.com/news/recap-bank-of-america-q1-earnings-20210415.jpg",
    "site": "benzinga.com",
    "text": "Shares of Bank of America (NYSE:BAC) moved higher by 0.8% in pre-market trading after the company reported Q1 results. Quarterly Results Earnings per share rose 115.00% year over year to $0.86, which beat the estimate of $0.66.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20636379/recap-bank-of-america-q1-earnings",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T07:05:15-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:33:55",
    "publisher": "CNBC",
    "title": "Bank of America earnings top estimates on strong investment banking, release of loan-loss reserves",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-earnings-top-estimates-on-strong-investment-20210415.jpg",
    "site": "cnbc.com",
    "text": "Bank of America joined rivals in posting a quarterly boost from an improving credit outlook.",
    "url": "https://www.cnbc.com/2021/04/15/bank-of-america-bac-earnings-q1-2021.html",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:33:55-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:30:05",
    "publisher": "Market Watch",
    "title": "Bank of America stock jumps toward 13-year high after profit beat, new $25 billion buyback program",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-stock-jumps-toward-13year-high-after-20210415.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Bank of America Corp. rose 1.8% toward a 13-year high in premarket trading Thursday, after the bank reported profit that more than doubled and beat expectations, citing strong growth in capital markets and lower credit costs, and set a $25 billion stock repurchase program. Net income rose to $8.1 billion, or 86 cents a share, from $4.0 billion, or 40 cents a share, in the year-ago period.",
    "url": "https://www.marketwatch.com/story/bank-of-america-stock-jumps-toward-13-year-high-after-profit-beat-new-25-billion-buyback-program-2021-04-15",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:30:05-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:24:22",
    "publisher": "Fox Business",
    "title": "Bank of America profit more than doubles on reserve release boost",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-profit-more-than-doubles-on-reserve-release-20210415.jpg",
    "site": "foxbusiness.com",
    "text": "Bank of America Corp reported a jump in first-quarter profit that breezed past estimates on Thursday as it released reserves it had set aside to cover potential coronavirus loan losses.",
    "url": "https://www.foxbusiness.com/markets/bank-of-america-profit-more-than-doubles-on-reserve-release-boost",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:24:22-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:23:00",
    "publisher": "Reuters",
    "title": "Bank of America profit more than doubles on reserve release boost",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-profit-more-than-doubles-on-reserve-20210415.jpg",
    "site": "reuters.com",
    "text": "Bank of America Corp reported a jump in first-quarter profit that breezed past estimates on Thursday as it released reserves it had set aside to cover potential coronavirus loan losses.",
    "url": "https://www.reuters.com/article/us-bank-of-america-results/bank-of-america-profit-more-than-doubles-on-reserve-release-boost-idUSKBN2C219F",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:23:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:22:32",
    "publisher": "Market Watch",
    "title": "Bank of America earnings come in stronger than analysts anticipated",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-earnings-come-in-stronger-than-analysts-anticipated-20210714.jpg",
    "site": "marketwatch.com",
    "text": "Bank of America earnings come in stronger than analysts anticipated",
    "url": "https://www.marketwatch.com/investing/stock/BAC",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:22:32-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:04:00",
    "publisher": "Business Wire",
    "title": "Bank of America Reports First-Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-reports-firstquarter-2021-financial-results-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America reported its first-quarter 2021 financial results today. The news release, supplemental filing and investor presentation can be accessed in the following ways: Bank of America newsroom at https://newsroom.bankofamerica.com Q1-21 Bank of America Financial Results Press Release Q1-21 Bank of America Investor Relations Presentation Q1-21 Bank of America Supplemental Information Q1-21 Bank of America Financial Results Press Release Q1-21 Bank of America Investor Relations Presentation Q1-21 Bank of America Supplemental Information Bank of America Investor Relations website at https://investor.bankofamerica.com Business Wire’s news webpage at http://www.businesswire.com/portal/site/home/news Investor Conference Call information: Chief Executive Officer Brian Moynihan and Chief Financial Officer Paul Donofrio will discuss the financial results in a conference call at 9 a.m. ET today. For a listen-only connection to the conference call, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international), and the conference ID is 79795. Please dial in 10 minutes prior to the start of the call. Investors can also listen to a live audio webcast of the conference call and view the presentation slides by visiting the Events and Presentations section of the company’s Investor Relations website. Replay information for Investor Conference Call: Investors can access replays of the conference call by visiting the Investor Relations website or by calling 1.800.934.4850 (U.S.) or 1.402.220.1178 (international) from noon on April 15 through 11:59 p.m. ET on April 25. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210415005486/en/Bank-of-America-Reports-First-Quarter-2021-Financial-Results",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:04:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:04:00",
    "publisher": "Business Wire",
    "title": "Bank of America Reports First-Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-reports-firstquarter-2021-financial-results-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America reported its first-quarter 2021 financial results today. The news release, supplemental filing and investor presentation can be accessed in the following ways: Bank of America newsroom at https://newsroom.bankofamerica.com Q1-21 Bank of America Financial Results Press Release Q1-21 Bank of America Investor Relations Presentation Q1-21 Bank of America Supplemental Information Q1-21 Bank of America Financial Results Press Release Q1-21 Bank of America Investor Relations Presentation Q1-21 Bank of America Supplemental Information Bank of America Investor Relations website at https://investor.bankofamerica.com Business Wire’s news webpage at http://www.businesswire.com/portal/site/home/news Investor Conference Call information: Chief Executive Officer Brian Moynihan and Chief Financial Officer Paul Donofrio will discuss the financial results in a conference call at 9 a.m. ET today. For a listen-only connection to the conference call, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international), and the conference ID is 79795. Please dial in 10 minutes prior to the start of the call. Investors can also listen to a live audio webcast of the conference call and view the presentation slides by visiting the Events and Presentations section of the company’s Investor Relations website. Replay information for Investor Conference Call: Investors can access replays of the conference call by visiting the Investor Relations website or by calling 1.800.934.4850 (U.S.) or 1.402.220.1178 (international) from noon on April 15 through 11:59 p.m. ET on April 25. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com",
    "url": "http://www.businesswire.com/news/home/20210415005486/en/Bank-of-America-Reports-First-Quarter-2021-Financial-Results",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:04:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:04:00",
    "publisher": "Business Wire",
    "title": "Bank of America Reports First-Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-reports-firstquarter-2021-financial-results-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America reported its first-quarter 2021 financial results today. The news release, supplemental filing and investor presentation can be accessed in the following ways: Bank of America newsroom at https://newsroom.bankofamerica.com Q1-21 Bank of America Financial Results Press Release Q1-21 Bank of America Investor Relations Presentation Q1-21 Bank of America Supplemental Information Bank of America Investor Relations website at https://investor.bankofam",
    "url": "https://www.businesswire.com/news/home/20210415005486/en/Bank-of-America-Reports-First-Quarter-2021-Financial-Results/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:04:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces $25 Billion Common Stock Repurchase Plan",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-25-billion-common-stock-repurchase-plan-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced that its Board of Directors has authorized the repurchase of up to $25 billion of common stock over time. This authorization reflects the company's commitment to return to shareholders excess capital that is not needed to support economic growth, deliver for customers and communities, invest in the future and sustain strength and stability through the cycle. The Board also authorized repurchases to offset shares award",
    "url": "https://www.businesswire.com/news/home/20210415005473/en/Bank-of-America-Announces-25-Billion-Common-Stock-Repurchase-Plan/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:00:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-15 06:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces $25 Billion Common Stock Repurchase Plan",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-25-billion-common-stock-repurchase-20210415.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced that its Board of Directors has authorized the repurchase of up to $25 billion of common stock over time. This authorization reflects the company’s commitment to return to shareholders excess capital that is not needed to support economic growth, deliver for customers and communities, invest in the future and sustain strength and stability through the cycle. The Board also authorized repurchases to offset shares awarded under equity-based compensation plans. For the second quarter 2021, the company’s repurchase plans will be consistent with Federal Reserve System’s (FRB) restrictions that common stock repurchases and common stock dividends be correlated to the average quarterly net income for the previous four quarters. Following the expiration of the restrictions, Bank of America expects to distribute additional capital to shareholders. Bank of America’s ability to make capital distributions depends, in part, on its ability to maintain regulatory capital levels above the 9.5% CET1 requirement: the sum of the FRB regulatory minimum of 4.5% and applicable regulatory buffers; including the Stress Capital Buffer (SCB) of 2.5%; and the Global Systemically Important Bank Holding Company surcharge of 2.5%. As of March 31, 2021, Bank of America’s CET1 ratio was 11.8%, which equated to approximately $35 billion excess CET1 capital above the 9.5% CET1 requirement. The timing and amount of common stock repurchases made pursuant to the Bank of America common stock repurchase program are subject to various factors, including the company's capital position, liquidity, financial performance and alternative uses of capital, stock trading price, regulatory requirements and general market conditions. Also, it may be suspended at any time. The common stock repurchases may be effected through open market purchases or privately negotiated transactions, including repurchase plans that satisfy the conditions of Rule 10b5-1 of the Securities Exchange Act of 1934, as amended. Forward-Looking Statements Certain statements contained in this news release may constitute “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent the current expectations, plans or forecasts of Bank of America based on available information. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. These statements often use words like “expects,” “anticipates,” “believes,” “estimates,” “targets,” “intends,” “plans,” “predict,” “goal” and other similar expressions or future or conditional verbs such as “will,” “may,” “might,” “should,” “would” and “could.” Forward-looking statements speak only as of the date they are made, and Bank of America undertakes no obligation to update any forward-looking statement to reflect the impact of circumstances or events that arise after the date the forward-looking statement was made. Forward-looking statements represent Bank of America’s current expectations, plans or forecasts of its future results, revenues, expenses, efficiency ratio, capital measures, and future business and economic conditions more generally, and other future matters. These statements are not guarantees of its future results or performance and involve certain known and unknown risks, uncertainties and assumptions that are difficult to predict and are often beyond Bank of America’s control. Actual outcomes and results may differ materially from those expressed in, or implied by, any forward-looking statements. You should not place undue reliance on any forward-looking statement and should consider all of the uncertainties and risks discussed under Item 1A. “Risk Factors” of Bank of America’s Annual Report on Form 10-K for the year ended December 31, 2020 and in any of Bank of America’s other subsequent Securities and Exchange Commission filings. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210415005473/en/Bank-of-America-Announces-25-Billion-Common-Stock-Repurchase-Plan",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-15T06:00:00-04:00",
    "date_et": "2021-04-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 19:39:03",
    "publisher": "Zacks Investment Research",
    "title": "Big Banks Foreshadow the Improving 2021 Earnings Picture",
    "image": "https://images.financialmodelingprep.com/news/big-banks-foreshadow-the-improving-2021-earnings-picture-20210416.jpg",
    "site": "zacks.com",
    "text": "Big Banks Foreshadow the Improving 2021 Earnings Picture",
    "url": "https://www.zacks.com/commentary/1406971/big-banks-foreshadow-the-improving-2021-earnings-picture",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T19:39:03-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 16:53:00",
    "publisher": "Market Watch",
    "title": "Market Extra: Bank of America tops charts with $15 billion bond deal, the biggest ever from a bank",
    "image": "https://images.financialmodelingprep.com/news/market-extra-bank-of-america-tops-charts-with-15-20210416.jpg",
    "site": "marketwatch.com",
    "text": "Major U.S. financial powerhouses Bank of America and JP Morgan are going on a borrowing spree, after reporting blockbuster first-quarter financial results this week, smashing record after record along the way.",
    "url": "https://www.marketwatch.com/story/bank-of-america-tops-charts-with-15-billion-bond-deal-the-biggest-ever-from-a-bank-11618606409",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T16:53:00-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 15:49:00",
    "publisher": "Barron's",
    "title": "3 Big Banks Had Huge Bond Sales This Week. What It Means for Markets.",
    "image": "https://images.financialmodelingprep.com/news/3-big-banks-had-huge-bond-sales-this-week-20210416.jpg",
    "site": "barrons.com",
    "text": "The three bank's successful bond sales could make it easier for banks to pay dividends and increase buybacks later this year.",
    "url": "https://www.barrons.com/articles/goldman-sachs-bank-america-jpmorgan-bonds-dividends-51618602441",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T15:49:00-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 09:18:00",
    "publisher": "Reuters",
    "title": "Bank of America CEO Moynihan says supports 'a well-focused infrastructure plan': CNN interview",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-ceo-moynihan-says-supports-a-wellfocused-20210416.jpg",
    "site": "reuters.com",
    "text": "Bank of America Corp Chief Executive Officer Brian Moynihan on Friday said in a CNN interview that the U.S. needs to keep investing in infrastructure, adding that a \"well-focused infrastructure plan would be a good thing\" for the country.",
    "url": "https://www.reuters.com/article/us-bankofamerica-usa/bank-of-america-ceo-moynihan-says-supports-a-well-focused-infrastructure-plan-cnn-interview-idUSKBN2C31MM",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T09:18:00-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 08:59:00",
    "publisher": "Business Wire",
    "title": "美国银行公布2021年第一季度财务业绩",
    "image": "https://images.financialmodelingprep.com/news/2021-20210416.jpg",
    "site": "businesswire.com",
    "text": "北卡罗来纳州夏洛特--(BUSINESS WIRE)----(美国商业资讯)--美国银行(Bank of America)今日公布了其2021年第一季度的财务业绩。新闻稿、补充呈报材料和投资者简报可通过以下方式获取： 此新闻稿包含多媒体内容。完整新闻稿可在以下网址查阅：https://www.businesswire.com/news/home/20210415005486/en/ 美国银行新闻室：https://newsroom.bankofamerica.com 美国银行2021年第一季度财务业绩新闻稿 美国银行2021年第一季度投资者关系简报 美国银行2021年第一季度补充信息 美国银行2021年第一季度财务业绩新闻稿 美国银行2021年第一季度投资者关系简报 美国银行2021年第一季度补充信息 美国银行投资者关系网站：https://investor.bankofamerica.com 美国商业资讯新闻网页：http://www.businesswire.com/portal/site/home/news 投资者电话会议信息： 首席执行官Brian Moynihan和首席财务官Paul Donofrio将在美国东部时间今天上午9:00在电话会议上讨论财务业绩事宜。如需参与仅供收听的电话会议，请拨打1.877.200.4456（美国）或1.785.424.1732（国际），会议ID为79795。 请在电话会议开始前10分钟拨打上述电话。投资者还可访问公司投资者关系网站的Events and Presentations（活动和简报）栏目，收听电话会议现场音频网播和观看简报幻灯片。 投资者电话会议重播信息： 公司将于美国东部时间4月15日中午至4月25日晚上11:59提供电话会议的重播，投资者可登录投资者关系网站或致电1.800.934.4850（美国）或1.402.220.1178（国际）收听。 关于美国银行 美国银行是全球最大的金融机构之一，为个人消费者、中小市场企业和大公司提供全方位的银行、投资、资产管理及其他金融和风险管理产品与服务。该公司拥有大约4,300个零售金融中心，包括约2,700个贷款中心、2,600个拥有消费投资金融解决方案顾问的金融中心和约2,400个商务中心；大约17,000台自动柜员机；以及屡获殊荣的数字银行服务（拥有约4,000万活跃用户，包括约3,100万移动用户），在美国提供无与伦比的便利性，服务于大约6,600万名个人和小型企业客户。美国银行是财富管理、企业和投资银行以及交易领域的全球领导者，业务横跨众多资产类别，服务于全世界的公司、政府、机构和个人。美国银行通过一系列创新、易于使用的在线产品与服务，为大约300万家小型事业户提供业界一流的支持。该公司通过遍布美国、其领地和约35个国家的业务网点为客户提供服务。美国银行公司股票(NYSE:BAC)在纽约证券交易所上市。 如需查看更多美国银行新闻，包括分红公告等重要信息，请访问美国银行新闻室和注册新闻电子邮件提醒。 www.bankofamerica.com 原文版本可在businesswire.com上查阅：https://www.businesswire.com/news/home/20210415005486/en/ 免责声明：本公告之原文版本乃官方授权版本。译文仅供方便了解之用，烦请参照原文，原文版本乃唯一具法律效力之版本。",
    "url": "https://www.businesswire.com/news/home/20210416005316/zh-CN/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T08:59:00-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 08:54:00",
    "publisher": "Business Wire",
    "title": "美國銀行公佈2021年第一季財務業績",
    "image": "https://images.financialmodelingprep.com/news/2021-20210416.jpg",
    "site": "businesswire.com",
    "text": "北卡羅萊納州夏洛特--(BUSINESS WIRE)----(美國商業資訊)--美國銀行(Bank of America)今日公佈2021年第一季的財務業績。新聞稿、補充呈報材料和投資人簡報可透過以下方式取得： 此新聞稿包含多媒體內容。完整新聞稿可在以下網址查閱：https://www.businesswire.com/news/home/20210415005486/en/ 美國銀行新聞室：https://newsroom.bankofamerica.com 美國銀行2021年第一季財務業績新聞稿 美國銀行2021年第一季投資人關係簡報 美國銀行2021年第一季補充資訊 美國銀行2021年第一季財務業績新聞稿 美國銀行2021年第一季投資人關係簡報 美國銀行2021年第一季補充資訊 美國銀行投資人關係網站：https://investor.bankofamerica.com 美國商業資訊新聞網頁：http://www.businesswire.com/portal/site/home/news 投資人電話會議資訊： 執行長Brian Moynihan和財務長Paul Donofrio將於美國東部時間今天上午9:00在電話會議上討論財務業績事宜。如欲參與僅供收聽的電話會議，請致電1.877.200.4456（美國）或1.785.424.1732（國際），會議ID為79795。 請在電話會議開始前10分鐘撥打上述電話。投資人還可造訪公司投資人關係網站的Events and Presentations（活動和簡報）區，收聽電話會議現場音訊網播和觀看簡報幻燈片。 投資人電話會議重播資訊： 公司將於美國東部時間4月15日中午至4月25日晚上11:59提供電話會議的重播，投資人可造訪投資人關係網站或致電1.800.934.4850（美國）或1.402.220.1178（國際）收聽。 關於美國銀行 美國銀行是全球最大的金融機構之一，為個人消費者、中小型企業和大型企業提供全方位的銀行、投資、資產管理及其他金融和風險管理產品與服務。該公司擁有大約4,300個零售金融中心，包括約2,700個貸款中心、2,600個擁有消費投資金融解決方案顧問的金融中心和約2,400個商務中心；大約17,000台自動櫃員機；以及屢獲殊榮的數位銀行服務（擁有約4,000萬名活躍用戶，包括約3,100萬名行動用戶），在美國提供無與倫比的便利性，為大約6,600萬名個人和小型企業客戶提供服務。美國銀行是財富管理、企業和投資銀行以及交易領域的全球領導者，業務橫跨眾多資產類別，為全世界的企業、政府、機構和個人提供服務。美國銀行透過一系列創新、易於使用的線上產品與服務，為大約300萬家小型事業戶提供業界一流的支援。該公司透過遍佈美國、其領地和約35個國家的業務據點為客戶提供服務。美國銀行公司股票(NYSE:BAC)在紐約證券交易所上市。 如欲查看更多美國銀行新聞，包括股利公告等重要資訊，請造訪美國銀行新聞室和登記新聞電子郵件通知。 www.bankofamerica.com 原文版本可在businesswire.com上查閱：https://www.businesswire.com/news/home/20210415005486/en/ 免責聲明：本公告之原文版本乃官方授權版本。譯文僅供方便瞭解之用，煩請參照原文，原文版本乃唯一具法律效力之版本。",
    "url": "https://www.businesswire.com/news/home/20210416005315/zh-HK/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T08:54:00-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-16 08:19:08",
    "publisher": "Zacks Investment Research",
    "title": "Bank Stock Roundup: JPM, WFC, BAC, C, TFC & USB in Focus as Q1 Earnings Begin",
    "image": "https://images.financialmodelingprep.com/news/bank-stock-roundup-jpm-wfc-bac-c-tfc-usb-20210416.jpg",
    "site": "zacks.com",
    "text": "Q1 earnings start on a positive note with banks like JPMorgan (JPM), BofA (BAC), Citi (C), Wells Fargo (WFC), U.S. Bancorp (USB) & Truist (TFC) surpassing estimates on reserve releases and solid fee income performance.",
    "url": "https://www.zacks.com/stock/news/1404878/bank-stock-roundup-jpm-wfc-bac-c-tfc-usb-in-focus-as-q1-earnings-begin",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-16T08:19:08-04:00",
    "date_et": "2021-04-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-19 12:24:32",
    "publisher": "Zacks Investment Research",
    "title": "Is Bank of America (BAC) Outperforming Other Finance Stocks This Year?",
    "image": "https://images.financialmodelingprep.com/news/is-bank-of-america-bac-outperforming-other-finance-stocks-20210419.jpg",
    "site": "zacks.com",
    "text": "Is (BAC) Outperforming Other Finance Stocks This Year?",
    "url": "https://www.zacks.com/stock/news/1420275/is-bank-of-america-bac-outperforming-other-finance-stocks-this-year",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-19T12:24:32-04:00",
    "date_et": "2021-04-19"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-19 12:12:58",
    "publisher": "Pulse2",
    "title": "BAC Stock: $44 Target (Up From $37) By RBC Capital",
    "image": "https://images.financialmodelingprep.com/news/bac-stock-44-target-up-from-37-by-rbc-20210419.jpg",
    "site": "pulse2.com",
    "text": "The shares of Bank of America Corp (NYSE: BAC) have received a price target increase from $37 to $44 by RBC Capital. These are the details.",
    "url": "https://pulse2.com/bac-stock-nyse-bank-of-america-44-target-up-from-37-by-rbc-capital/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-19T12:12:58-04:00",
    "date_et": "2021-04-19"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-19 05:51:00",
    "publisher": "Business Wire",
    "title": "バンク・オブ・アメリカが2021年第1四半期の財務業績を発表",
    "image": "https://images.financialmodelingprep.com/news/20211-20210419.jpg",
    "site": "businesswire.com",
    "text": "米ノースカロライナ州シャーロット--(BUSINESS WIRE)--（ビジネスワイヤ） -- バンク・オブ・アメリカは本日、2021年第1四半期の財務業績を発表しました。ニュースリリース、補足情報、投資家向けプレゼンテーションは、下記でご覧いただけます。 バンク・オブ・アメリカのニュースルーム（https://newsroom.bankofamerica.com） 2021年第1四半期、バンク・オブ・アメリカ、プレスリリース 2021年第1四半期、バンク・オブ・アメリカ、投資家向けプレゼンテーション 2021年第1四半期、バンク・オブ・アメリカ、補足情報 2021年第1四半期、バンク・オブ・アメリカ、プレスリリース 2021年第1四半期、バンク・オブ・アメリカ、投資家向けプレゼンテーション 2021年第1四半期、バンク・オブ・アメリカ、補足情報 バンク・オブ・アメリカ投資家向けウェブサイト（https://investor.bankofamerica.com） ビジネスワイヤのニュースウェブサイト（http://www.businesswire.com/portal/site/home/news） 投資家向け電話会議の情報 ブライアン・モイニハン最高経営責任者（CEO）とポール・ドノフリオ最高財務責任者（CFO）が、本日午前9時（米国東部時間）からの電話会議で財務業績について説明します。電話会議に聴取専用で接続するためには、1-877-200-4456（米国内）または1-785-424-1732（国際電話）にお電話ください。カンファレンスIDは79795です。 電話会議が始まる10分前にお電話ください。投資家の皆様は、当行投資家向けウェブサイトのイベント＆プレゼンテーションのセクションから、電話会議のライブ音声ウェブキャストを聞くことができ、プレゼンテーションのスライドをご覧いただけます。 投資家向け電話会議録音再生の情報 投資家の皆様は、投資家向けウェブサイトをご覧いただくか、1-800-934-4850（米国内）または1-402-220-1178（国際電話）にお電話いただくことで、4月15日正午～4月25日午後11時59分（米国東部時間）まで、電話会議の録音再生をご利用いただけます。 バンク・オブ・アメリカ バンク・オブ・アメリカは、世界をリードする金融機関として、個人顧客、中小企業、大企業に対して総合的な銀行、投資、資産運用などの金融およびリスク管理商品およびサービスを提供しています。当行は米国内で他の追随を許さない利便性を提供しています。約6600万の個人および中小企業のお客さまに約4300店の個人向け金融センター（融資センター約2700店）、消費者投資金融ソリューション・アドバイザーのいる金融センター2600店、ビジネス・センター約2400店と約1万7000台のATMでサービスを提供し、受賞歴のあるデジタル・バンキングは約4000万人が実際に利用し、そのうちの約3100万人がモバイル端末で利用しています。バンク・オブ・アメリカはウェルス・マネジメント、企業向け銀行・投資銀行業務および幅広い資産クラスにわたるトレーディング業務のグローバル・リーダーであり、世界各地の企業、政府、機関投資家、個人にサービスを提供しています。バンク・オブ・アメリカは、革新的で利用しやすいオンライン商品とサービスによって、約300万人の小企業事業世帯向けに業界をリードする支援を提供しています。当行は、米国各地と米国海外領土のほか、約35カ国で事業を営み、顧客にサービスを提供しています。バンク・オブ・アメリカ・コーポレーションの株式（NYSE: BAC）は、ニューヨーク証券取引所に上場されています。 配当の発表等の重要情報を含むバンク・オブ・アメリカのその他のニュースについては、バンク・オブ・アメリカのニュースルームをご覧いただき、メール・ニュース通知にご登録ください。 www.bankofamerica.com 本記者発表文の公式バージョンはオリジナル言語版です。翻訳言語版は、読者の便宜を図る目的で提供されたものであり、法的効力を持ちません。翻訳言語版を資料としてご利用になる際には、法的効力を有する唯一のバージョンであるオリジナル言語版と照らし合わせて頂くようお願い致します。",
    "url": "https://www.businesswire.com/news/home/20210419005382/ja/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-19T05:51:00-04:00",
    "date_et": "2021-04-19"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 16:25:06",
    "publisher": "Pulse2",
    "title": "TWLO Stock: $480 Target By Bank Of America",
    "image": "https://images.financialmodelingprep.com/news/twlo-stock-480-target-by-bank-of-america-20210420.jpg",
    "site": "pulse2.com",
    "text": "The shares of Twilio Inc (NYSE: TWLO) have received a price target of $480 by Bank of America. These are the details.",
    "url": "https://pulse2.com/twlo-stock-nyse-twilio-480-target-by-bank-of-america/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T16:25:06-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 16:23:00",
    "publisher": "Pulse2",
    "title": "RIDE Stock: $13 Target By Bank Of America",
    "image": "https://images.financialmodelingprep.com/news/ride-stock-13-target-by-bank-of-america-20210420.jpg",
    "site": "pulse2.com",
    "text": "The shares of Lordstown Motors Corp (NASDAQ: RIDE) have received a price target of $13 by Bank of America. These are the details.",
    "url": "https://pulse2.com/ride-stock-nasdaq-lordstown-motors-13-target-by-bank-of-america/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T16:23:00-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 16:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Preliminary Voting Results From 2021 Annual Meeting of Stockholders",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-preliminary-voting-results-from-2021-20210420.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced preliminary results of matters voted upon during the company's 2021 annual meeting of stockholders. The 16 board of director nominees were elected, with at least 93 percent of the vote cast in favor of each. Jack Bovender, the company's Lead Independent Director, retired from the Board at the meeting. As previously disclosed, he was succeeded by Lionel Nowell, who has been an independent director at Bank of America since January",
    "url": "https://www.businesswire.com/news/home/20210420006117/en/Bank-of-America-Announces-Preliminary-Voting-Results-From-2021-Annual-Meeting-of-Stockholders/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T16:00:00-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 16:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Preliminary Voting Results From 2021 Annual Meeting of Stockholders",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-preliminary-voting-results-from-2021-annual-20210420.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America today announced preliminary results of matters voted upon during the company’s 2021 annual meeting of stockholders. The 16 board of director nominees were elected, with at least 93 percent of the vote cast in favor of each. Jack Bovender, the company’s Lead Independent Director, retired from the Board at the meeting. As previously disclosed, he was succeeded by Lionel Nowell, who has been an independent director at Bank of America since January 2013. An advisory proposal on executive compensation was approved, with more than 94 percent of the vote cast in favor. Management proposals to amend and restate the company’s key employee equity plan and appoint the company’s independent accounting firm were also approved. No stockholder proposals were approved. Results are considered preliminary, with final figures reported on a Form 8-K to be filed with the Securities and Exchange Commission. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210420006117/en/Bank-of-America-Announces-Preliminary-Voting-Results-From-2021-Annual-Meeting-of-Stockholders",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T16:00:00-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 11:33:22",
    "publisher": "Business Insider",
    "title": "Warren Buffett's Berkshire Hathaway has scored a $12 billion gain on American Express and Bank of America this year",
    "image": "https://images.financialmodelingprep.com/news/warren-buffetts-berkshire-hathaway-has-scored-a-12-billion-20210420.jpg",
    "site": "businessinsider.com",
    "text": "Warren Buffett's Berkshire Hathaway has scored a $12 billion gain across just two stocks this year, American Express and Bank of America. The famed investor's conglomerate owned 152 million shares in American Express at the end of 2020, regulatory filings show. The financial-services group's stock has surged by over 20% since then, boosting the value of Berkshire's stake by about $4 billion to $23 billion.",
    "url": "https://www.businessinsider.com/warren-buffett-berkshire-hathaway-make-gain-american-express-bank-america-2021-4",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T11:33:22-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-20 11:01:00",
    "publisher": "Reuters",
    "title": "Bank of America investors back executive pay, directors",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-investors-back-executive-pay-directors-20210420.jpg",
    "site": "reuters.com",
    "text": "A majority of Bank of America investors voted to approve the bank's executive pay plans and to reelect the board's directors at the bank's annual shareholder meeting, held online on Tuesday.",
    "url": "https://www.reuters.com/article/us-bofaml-shareholder-meeting/bank-of-america-investors-back-executive-pay-directors-idUSKBN2C723T",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-20T11:01:00-04:00",
    "date_et": "2021-04-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 22:32:27",
    "publisher": "Pulse2",
    "title": "F Stock: $15 Target By Bank Of America",
    "image": "https://images.financialmodelingprep.com/news/f-stock-15-target-by-bank-of-america-20210421.jpg",
    "site": "pulse2.com",
    "text": "The shares of Ford Motor Company (NYSE: F) have received a price target increase from $14 to $15 by Bank of America. These are the details.",
    "url": "https://pulse2.com/f-stock-nyse-ford-motor-company-15-target-by-bank-of-america/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T22:32:27-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 19:33:06",
    "publisher": "Zacks Investment Research",
    "title": "A Very Strong Earnings Picture for Q1 and Beyond",
    "image": "https://images.financialmodelingprep.com/news/a-very-strong-earnings-picture-for-q1-and-beyond-20210421.jpg",
    "site": "zacks.com",
    "text": "A Very Strong Earnings Picture for Q1 and Beyond",
    "url": "https://www.zacks.com/commentary/1432361/a-very-strong-earnings-picture-for-q1-and-beyond",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T19:33:06-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 19:33:05",
    "publisher": "Zacks Investment Research",
    "title": "A Very Strong Earnings Picture for Q1 and Beyond",
    "image": "https://images.financialmodelingprep.com/news/a-very-strong-earnings-picture-for-q1-and-beyond-20210421.jpg",
    "site": "zacks.com",
    "text": "A Very Strong Earnings Picture for Q1 and Beyond",
    "url": "https://www.zacks.com/commentary/1432309/a-very-strong-earnings-picture-for-q1-and-beyond",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T19:33:05-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 16:27:03",
    "publisher": "GuruFocus",
    "title": "Rising Savings Are a Mixed Blessing for Banks",
    "image": "https://images.financialmodelingprep.com/news/rising-savings-are-a-mixed-blessing-for-banks-20210421.jpg",
    "site": "gurufocus.com",
    "text": "Pandemic lockdowns and stimulus checks have helped Americans save more money, a mixed blessing for banks. For instance, higher savings lead to more deposits, allowing banks to lend more funds.",
    "url": "https://www.gurufocus.com/news/1402998/rising-savings-are-a-mixed-blessing-for-banks",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T16:27:03-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 15:06:00",
    "publisher": "The Motley Fool",
    "title": "Alt-Milk Maker Oatly Files for IPO",
    "image": "https://images.financialmodelingprep.com/news/altmilk-maker-oatly-files-for-ipo-20210421.jpg",
    "site": "fool.com",
    "text": "A new plant-based comestibles stock will soon hit the market.",
    "url": "https://www.fool.com/investing/2021/04/21/alt-milk-maker-oatly-files-for-ipo/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T15:06:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 14:28:04",
    "publisher": "Seeking Alpha",
    "title": "Bank of America Corporation (BAC) CEO Brian Moynihan Presents at 2021 Annual Meeting of Shareholders (Transcript)",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-corporation-bac-ceo-brian-moynihan-presents-20210421.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America Corporation (BAC) CEO Brian Moynihan Presents at 2021 Annual Meeting of Shareholders (Transcript)",
    "url": "https://seekingalpha.com/article/4420350-bank-of-america-corporation-bac-ceo-brian-moynihan-presents-2021-annual-meeting-of",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T14:28:04-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 08:30:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Floating Rate Notes Issuance Referencing BSBY",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-floating-rate-notes-issuance-referencing-bsby-20210421.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America, N.A. announced today that it issued a $1 billion six-month floating rate bank note referencing the one-month tenor of the Bloomberg Short-Term Bank Yield IndexSM (BSBY) to multiple investors earlier this week. BSBY adheres to the International Organization of Securities Commissions’ (IOSCO) Principles for Financial Benchmarks and measures the average yields at which large, global banks access U.S. dollar unsecured wholesale funding. It is dynamic, credit sensitive and reflects marginal funding cost at overnight, one-month, three-month, six-month and twelve-month tenors. “We are pleased to be in a position to help lead the market’s transition away from LIBOR,” said Bank of America Treasurer Andrei Magasiner. “The development of a robust alternative term rate, such as BSBY, is an important development for traditional banking products and for our clients.” “We are continuously looking for ways to innovate and provide creative solutions to the market,” said Andrew Karp, Head of Investment Grade Capital Markets. “We have seen interest from US market participants for a credit sensitive rate alongside SOFR in the transition away from LIBOR. We believe BSBY is a viable alternative and we expect to see more transactions referencing credit sensitive rates going forward.” Forward-Looking Statements Certain information contained in this news release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not guarantees of future results or performance and involve certain risks, uncertainties and assumptions difficult to predict or beyond our control. You should not place undue reliance on any forward-looking statement and should consider the uncertainties and risks discussed under Item 1A. “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2020 and in any of our other subsequent Securities and Exchange Commission filings. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update any forward-looking statement to reflect the impact of circumstances or events that arise after the date the forward-looking statement was made. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210421005569/en/Bank-of-America-Announces-Floating-Rate-Notes-Issuance-Referencing-BSBY",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T08:30:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 08:30:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Floating Rate Notes Issuance Referencing BSBY",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-floating-rate-notes-issuance-referencing-20210421.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America, N.A. announced today that it issued a $1 billion six-month floating rate bank note referencing the one-month tenor of the Bloomberg Short-Term Bank Yield IndexSM (BSBY) to multiple investors earlier this week. BSBY adheres to the International Organization of Securities Commissions' (IOSCO) Principles for Financial Benchmarks and measures the average yields at which large, global banks access U.S. dollar unsecured wholesale funding. It is dynam",
    "url": "https://www.businesswire.com/news/home/20210421005569/en/Bank-of-America-Announces-Floating-Rate-Notes-Issuance-Referencing-BSBY/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T08:30:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 08:05:00",
    "publisher": "The Motley Fool",
    "title": "Are You Overlooking These Stocks of the Future?",
    "image": "https://images.financialmodelingprep.com/news/are-you-overlooking-these-stocks-of-the-future-20210421.jpg",
    "site": "fool.com",
    "text": "The stocks of the future may also be good for your investment returns in the present.",
    "url": "https://www.fool.com/investing/2021/04/21/are-you-overlooking-these-stocks-of-the-future/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T08:05:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-21 07:10:00",
    "publisher": "Reuters",
    "title": "Analysis: U.S. banks' bond bonanza driven by extraordinary market conditions, regulatory decisions",
    "image": "https://images.financialmodelingprep.com/news/analysis-us-banks-bond-bonanza-driven-by-extraordinary-market-conditions-20210421.jpg",
    "site": "reuters.com",
    "text": "Record-breaking Wall Street bank bond offerings in recent days are being driven by a combination of extraordinary market conditions and regulatory decisions that can be traced to the government's pandemic relief efforts, said analysts.",
    "url": "https://www.reuters.com/article/us-usa-banks-debt-analysis/analysis-u-s-banks-bond-bonanza-driven-by-extraordinary-market-conditions-regulatory-decisions-idUSKBN2C81HU",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-21T07:10:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-22 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Declares Quarterly Stock Dividends",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-declares-quarterly-stock-dividends-20210422.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced the Board of Directors declared a regular quarterly cash dividend on Bank of America common stock of $0.18 per share, payable on June 25, 2021 to shareholders of record as of June 4, 2021. The Board also declared a regular quarterly cash dividend of $1.75 per share on the 7% Cumulative Redeemable Preferred Stock, Series B. The dividend is payable on July 23, 2021 to shareholders of record as of July 9, 2021. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210422006031/en/Bank-of-America-Declares-Quarterly-Stock-Dividends",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-22T16:15:00-04:00",
    "date_et": "2021-04-22"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-22 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Declares Quarterly Stock Dividends",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-declares-quarterly-stock-dividends-20210422.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation today announced the Board of Directors declared a regular quarterly cash dividend on Bank of America common stock of $0.18 per share, payable on June 25, 2021 to shareholders of record as of June 4, 2021. The Board also declared a regular quarterly cash dividend of $1.75 per share on the 7% Cumulative Redeemable Preferred Stock, Series B. The dividend is payable on July 23, 2021 to shareholders of record as of July 9, 2021. Bank of A",
    "url": "https://www.businesswire.com/news/home/20210422006031/en/Bank-of-America-Declares-Quarterly-Stock-Dividends/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-22T16:15:00-04:00",
    "date_et": "2021-04-22"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-23 09:21:00",
    "publisher": "The Motley Fool",
    "title": "Loan Growth Would Pump Up Bank of America's Earnings -- But Will It Come This Year?",
    "image": "https://images.financialmodelingprep.com/news/loan-growth-would-pump-up-bank-of-americas-earnings-20210423.jpg",
    "site": "fool.com",
    "text": "Some modest loan growth later this year could increase Bank of America's current net interest income level by $1 billion in the fourth quarter.",
    "url": "https://www.fool.com/investing/2021/04/23/loan-growth-would-pump-up-bank-of-americas-earning/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-23T09:21:00-04:00",
    "date_et": "2021-04-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-26 09:00:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces $1.5 Million Commitment to Advance Racial Equality and Economic Opportunity in Massachusetts",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-15-million-commitment-to-advance-20210426.jpg",
    "site": "businesswire.com",
    "text": "BOSTON--(BUSINESS WIRE)--Bank of America today announced a $1.5 million commitment as part of its work to advance racial equality and economic opportunity in Massachusetts. King Boston, an organization dedicated to raising awareness of the legacy of Dr. Martin Luther King Jr. and Coretta Scott King in Boston, and the Massachusetts League of Community Health Centers, which offers support and assistance to the state’s 52 community health centers, will both receive funding. The grant funding is aligned to the bank’s $1.25 billion, five-year commitment, which further accelerates work already underway to address racial inequality and catalyze similar efforts across the private sector. King Boston, founded in 2017 to create a memorial and related programming honoring Dr. Martin Luther King Jr. and Coretta Scott King’s legacy, will receive a $1 million grant from Bank of America. The grant will support: the creation of the memorial, named The Embrace, on the Boston Common; a new Center for Economic Justice in Nubian Square to promote solutions to further racial and economic justice; and a public ideas series that engages the community in anti-racist discourse through the arts and humanities. “It is with generous contributions from large, established institutions that we are able to interrogate racism and advocate for the issues that Dr. and Mrs. King fought for over 50 years ago – wealth, housing, racial equity and public education,” said Imari Paris Jeffries, executive director of King Boston. “Thanks to our corporate partners like Bank of America for investing in change, and for their ongoing commitment to everything King Boston represents – convening, learning, healing, appreciating and honoring.” The Massachusetts League of Community Health Centers, which together serves more than one million people across the state, has been awarded a $500,000 grant from Bank of America to address critical health equity concerns with COVID-19 vaccine distribution. The state’s community health centers are uniquely positioned in communities of color to address these gaps as the vaccine rollout expands and accelerates. “Bank of America’s generous contribution recognizes the need for both an urgent infusion of funds and support for building longer-term responses to inequities. Immediate funding will go far in helping us meet expanding demand for the COVID-19 vaccine in the communities we serve – the same communities that have been unduly battered by the pandemic,” said Michael Curry, President & CEO of the Massachusetts League of Community Health Centers. “At the same time, the flexibility of this funding will give us room to respond to community-specific needs and support social, health and economic recovery as we work our way out of this pandemic.” “The health and humanitarian crisis has demonstrated just how far we have to go in correcting longstanding inequities in our society,” said Miceal Chamberlain, President of Bank of America Massachusetts. “The time for action is upon us and our hope is that by continuing to take specific steps to address economic and racial disparities, we can serve as a catalyst for a broader response across the private sector.” To date, the bank has made more than $350 million in various investments from its initial $1 billion commitment, announced in June 2020, across the primary focus areas of health, jobs/reskilling, affordable housing and small business, including providing support to Pine Street Inn, Innovation Studio, Morgan Memorial Goodwill Industries, La Colaborativa and Asian American Civic Association locally in Boston. About Bank of America At Bank of America, we’re guided by a common purpose to help make financial lives better, through the power of every connection. We’re delivering on this through responsible growth with a focus on our environmental, social and governance (ESG) leadership. ESG is embedded across our eight lines of business and reflects how we help fuel the global economy, build trust and credibility, and represent a company that people want to work for, invest in and do business with. It’s demonstrated in the inclusive and supportive workplace we create for our employees, the responsible products and services we offer our clients, and the impact we make around the world in helping local economies thrive. An important part of this work is forming strong partnerships with nonprofits and advocacy groups, such as community, consumer and environmental organizations, to bring together our collective networks and expertise to achieve greater impact. Learn more at about.bankofamerica.com, and connect with us on Twitter (@BofA_News). For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210426005475/en/Bank-of-America-Announces-1.5-Million-Commitment-to-Advance-Racial-Equality-and-Economic-Opportunity-in-Massachusetts",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-26T09:00:00-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Redemption of C$500,000,000 Fixed to Floating Rate Subordinated Notes Due May 30, 2022",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-redemption-of-c500000000-fixed-to-floating-20210427.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation (successor to Merrill Lynch & Co., Inc.) announced today that it will redeem on May 30, 2021 all C$500,000,000 principal amount outstanding of its Fixed to Floating Rate Subordinated Notes Due May 30, 2022 (CUSIP No. 5901887J1, ISIN: CA5901887J13) (the “Notes”), at a redemption price equal to 100% of the principal amount of the Notes, plus accrued and unpaid interest to, but excluding, the redemption date of May 30, 2021. Since May 30, 2021 is not a business day, the redemption price together with accrued and unpaid interest will be paid on the next succeeding business day, June 1, 2021. Interest on the Notes will cease to accrue on the redemption date. Payment of the redemption price together with accrued and unpaid interest for the Notes will be made in accordance with the applicable procedures of CDS Clearing and Depository Services Inc. The Bank of New York Mellon is the trustee and BNY Trust Company of Canada is the paying agent for the Notes. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. Forward-looking statements Certain information contained in this news release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not guarantees of future results or performance and involve certain risks, uncertainties and assumptions difficult to predict or beyond our control. You should not place undue reliance on any forward-looking statement and should consider the uncertainties and risks discussed under Item 1A. “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2020 and in any of our other subsequent Securities and Exchange Commission filings. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update any forward-looking statement to reflect the impact of circumstances or events that arise after the date the forward-looking statement was made. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for email news alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210427006037/en/Bank-of-America-Announces-Redemption-of-C500000000-Fixed-to-Floating-Rate-Subordinated-Notes-Due-May-30-2022",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T16:15:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Redemption of C$500,000,000 Fixed to Floating Rate Subordinated Notes Due May 30, 2022",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-redemption-of-c500000000-fixed-to-20210427.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation (successor to Merrill Lynch & Co., Inc.) announced today that it will redeem on May 30, 2021 all C$500,000,000 principal amount outstanding of its Fixed to Floating Rate Subordinated Notes Due May 30, 2022 (CUSIP No. 5901887J1, ISIN: CA5901887J13) (the “Notes”), at a redemption price equal to 100% of the principal amount of the Notes, plus accrued and unpaid interest to, but excluding, the redemption date of May 30, 2021. Since M",
    "url": "https://www.businesswire.com/news/home/20210427006037/en/Bank-of-America-Announces-Redemption-of-C500000000-Fixed-to-Floating-Rate-Subordinated-Notes-Due-May-30-2022/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T16:15:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 09:00:00",
    "publisher": "Business Wire",
    "title": "Amidst a Dynamic Home Buying Market, 70% of Prospective Buyers Looking For Vibrant and Connected Communities",
    "image": "https://images.financialmodelingprep.com/news/amidst-a-dynamic-home-buying-market-70-of-prospective-buyers-20210427.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--What’s driving home sales, higher home prices and bidding wars in many areas of the country? Low housing inventory and low interest rates are often factors, but Bank of America’s 2021 Homebuyer Insights Report found that a sense of community and good neighbors are also key priorities for today’s homebuyer. According to the survey of 2,000 adults who currently own a home or plan to in the future, half (51%) of younger buyers – those ages 18 to 43 – and nearly one third (32%) of older generations – ages 57 to 75 – say community has become more important over the past year. Specifically, people want neighbors who share similar interests (73%) and are active in the community (70%). Along with a desire for more space and smart home technology, individuals are looking for a sense of connectedness and belonging when it comes to where they live. “Over the last year, people have had plenty of time at home to reassess their priorities and goals, including how their living space and surroundings fit into their lives,” said AJ Barkley, SVP, Neighborhood Lending and Retail Sales East Executive, Consumer Lending at Bank of America. “We know homeownership remains as important as ever, especially for younger generations looking for that sense of community. We’re helping them take the next steps no matter where they are on their homebuying journey.” Across all generations, homeowners were more likely than non-homeowners to say they like their neighbors (42% vs. 29%) and neighborhood (44% vs. 32%) more now than they did a year ago. The feeling of safety is also important when it comes to home surroundings and community. Over two-thirds (68%) of younger prospective homebuyers and three quarters (75%) of younger homeowners say safety and security have become greater priorities when choosing where they will live. A desire for more space Beyond a sense of community, as prospective homebuyers have spent more time at home, they have re-evaluated and placed greater importance on the amount of space they need, both inside and outside. Nearly half (48%) of prospective homebuyers between 18 and 43 say the importance of square footage has increased, and 60% say outdoor space is more important to them now. The need for space has traditionally meant a move to the suburbs. While 42% of younger prospective buyers currently live in cities, only 24% want to own a home there. Half (48%) want to buy in the suburbs and 29% want to buy in rural areas. This is an increase from last summer, when 18% indicated a desire to purchase a home in a rural area. The evolving home The past year has also given people a peek into the homes of their coworkers, family and friends amidst the virtual environment. Three quarters (75%) have participated in video calls, and of this group, 37% have gotten ideas for something to do in their own home. A quarter (25%) have even asked others for information on where something was purchased or how a certain renovation was done based on what they saw. The home has become more than a place people leave in the morning and come back to at the end of the day. Two-thirds (66%) of all respondents agree that activities done in the home have changed, and this is especially true for younger generations (77%). Those ages 18 to 43 are using their homes as an office (45%), a school (31%), a movie theater (28%) and a gym (27%). While fewer, respondents ages 57 to 75 are also using their homes as an office (28%), a movie theater (24%) and a gym (14%). Additionally, younger prospective buyers are expressing a desire for new technologies in their homes, including smart/Wi-Fi enabled security system (51%), solar energy products (42%), and smart/Wi-Fi enabled appliances (44%). Accelerating the path to financial stability Despite this uncertain time, 65% of younger homeowners say their financial security has remained stable compared to 51% of non-homeowners in the same age group. It’s no surprise that 18- to 43-year-old prospective buyers are eager to swap unpredictable monthly rents with steady monthly mortgage payments, with nearly half (46%) saying that building equity is now more important than ever. They recognize that homeownership is a way to build long-term stability. “Homeownership is one of the most positive drivers of wealth creation,” shares Barkley. “That’s why we recently tripled our financial commitment to affordable homeownership solutions, which include grants to help home buyers with their down payments and closing costs, with no repayment required.” Those ready to leave renting behind aren’t going into homebuying blindly; they’re taking action. Most (87%) prospective buyers ages 18 to 43 say saving to purchase a home is a priority. Others are even accelerating their homebuying timelines (19%) compared to last summer (14%). In today’s competitive market, it is important to get a mortgage preapproval and plan ahead to compete with other buyers. For those ready to start their home search now, the Bank of America Real Estate Center® provides a simple way to research neighborhoods, shop for homes and identify properties that may be eligible for the bank’s homebuyer grants. The desire to own a home remains strong as many take steps on the path to homeownership. Learn more about Bank of America’s commitment to supporting clients on the journey to homeownership, including the Homebuyer Insights and affordable homeownership resources. About Bank of America’s Homebuyer Insights Sparks Research conducted a national online survey on behalf of Bank of America between February 18 and March 1, 2021. Sparks surveyed a national sample of 2,000 adults ages 18+ who currently own a home or plan to in the future. In addition, an augment of 185 surveys was conducted to oversample First Generation homeowner populations (363 surveys in total). The margin of error for the national quota is +/- 2.2 percent at the 95 percent confidence level. Select questions allowed respondents to choose more than one answer, resulting in responses that may equate to more than 100 percent. Bank of America Consumer Lending Bank of America Consumer Lending helps clients build pathways to home and car ownership, providing access to credit to meet a broad range of financing needs including mortgages for home purchase or refinance, home equity lines of credit, vehicle loans, and a wide variety of credit cards. Bank of America delivers a distinctive client experience, through: Award-winning digital tools and resources, including the Bank of America Digital Mortgage Experience®, Digital Car Shopping tool, and Real Estate Center®. Clients can search for homes or cars; request mortgage preapproval or prequalification; and apply for loans and credit cards. An industry-leading Preferred Rewards program, which includes lending benefits and rewards that increase as qualifying savings and investments grow. Bank of America’s Community Homeownership Commitment® helps low- and moderate-income individuals and families achieve sustainable homeownership. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210427005649/en/Amidst-a-Dynamic-Home-Buying-Market-70-of-Prospective-Buyers-Looking-For-Vibrant-and-Connected-Communities",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T09:00:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 09:00:00",
    "publisher": "Business Wire",
    "title": "Amidst a Dynamic Home Buying Market, 70% of Prospective Buyers Looking For Vibrant and Connected Communities",
    "image": "https://images.financialmodelingprep.com/news/amidst-a-dynamic-home-buying-market-70-of-prospective-20210427.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--What's driving home sales, higher home prices and bidding wars in many areas of the country? Low housing inventory and low interest rates are often factors, but Bank of America's 2021 Homebuyer Insights Report found that a sense of community and good neighbors are also key priorities for today's homebuyer. According to the survey of 2,000 adults who currently own a home or plan to in the future, half (51%) of younger buyers – those ages 18 to 43 – and nearly on",
    "url": "https://www.businesswire.com/news/home/20210427005649/en/Amidst-a-Dynamic-Home-Buying-Market-70-of-Prospective-Buyers-Looking-For-Vibrant-and-Connected-Communities/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T09:00:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 06:46:04",
    "publisher": "Zacks Investment Research",
    "title": "Wall Street Soars in Biden's First 100 Days in Office: 5 Picks",
    "image": "https://images.financialmodelingprep.com/news/wall-street-soars-in-bidens-first-100-days-in-office-20210427.jpg",
    "site": "zacks.com",
    "text": "We have narrowed down our search to five U.S. corporate bigwigs (market capital > 20 billion) with a favorable Zacks Rank. These are: XOM, GS, BAC, LRCX and NUE.",
    "url": "https://www.zacks.com/stock/news/1460750/wall-street-soars-in-bidens-first-100-days-in-office-5-picks",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T06:46:04-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-27 06:36:00",
    "publisher": "The Motley Fool",
    "title": "Warren Buffett Generates Half of His Dividend Income From These 3 Stocks",
    "image": "https://images.financialmodelingprep.com/news/warren-buffett-generates-half-of-his-dividend-income-from-20210427.jpg",
    "site": "fool.com",
    "text": "This trio will pay out $2.16 billion this year to Berkshire Hathaway.",
    "url": "https://www.fool.com/investing/2021/04/27/buffett-generates-half-dividend-income-3-stocks/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-27T06:36:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-28 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Redemption of 3.499% Fixed/Floating Rate Senior Notes, due May 2022",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-redemption-of-3499-fixedfloating-rate-20210428.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation announced today that it will redeem on May 17, 2021 all $2,250,000,000 principal amount outstanding of its 3.499% Fixed/Floating Rate Senior Notes, due May 2022 (CUSIP No. 06051GHH5) (the “Notes”). The redemption price for the Notes will be equal to 100% of the principal amount of the Notes, plus accrued and unpaid interest to, but excluding, the redemption date of May 17, 2021. Interest on the Notes will cease to accrue on the redem",
    "url": "https://www.businesswire.com/news/home/20210428006089/en/Bank-of-America-Announces-Redemption-of-3.499-FixedFloating-Rate-Senior-Notes-due-May-2022/",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-28T16:15:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2021-04-28 16:15:00",
    "publisher": "Business Wire",
    "title": "Bank of America Announces Redemption of 3.499% Fixed/Floating Rate Senior Notes, due May 2022",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-redemption-of-3499-fixedfloating-rate-senior-20210428.jpg",
    "site": "businesswire.com",
    "text": "CHARLOTTE, N.C.--(BUSINESS WIRE)--Bank of America Corporation announced today that it will redeem on May 17, 2021 all $2,250,000,000 principal amount outstanding of its 3.499% Fixed/Floating Rate Senior Notes, due May 2022 (CUSIP No. 06051GHH5) (the “Notes”). The redemption price for the Notes will be equal to 100% of the principal amount of the Notes, plus accrued and unpaid interest to, but excluding, the redemption date of May 17, 2021. Interest on the Notes will cease to accrue on the redemption date. Payment of the redemption price for the Notes will be made through the facilities of The Depository Trust Company. The Bank of New York Mellon Trust Company, N.A. is the trustee and paying agent for the Notes. Bank of America Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,700 lending centers, 2,600 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,400 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 40 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange. Forward-looking statements Certain information contained in this news release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not guarantees of future results or performance and involve certain risks, uncertainties and assumptions difficult to predict or beyond our control. You should not place undue reliance on any forward-looking statement and should consider the uncertainties and risks discussed under Item 1A. “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2020 and in any of our subsequent Securities and Exchange Commission filings. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update any forward-looking statement to reflect the impact of circumstances or events that arise after the date the forward-looking statement was made. For more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom. Click here to register for news email alerts. www.bankofamerica.com",
    "url": "https://www.businesswire.com/news/home/20210428006089/en/Bank-of-America-Announces-Redemption-of-3.499-FixedFloating-Rate-Senior-Notes-due-May-2022",
    "ticker": "BAC",
    "event_date": "2021-04-15",
    "window_start": "2021-04-01",
    "window_end": "2021-04-29",
    "publishedDateET": "2021-04-28T16:15:00-04:00",
    "date_et": "2021-04-28"
  }
]