{"symbol": "TSLA", "publishedDate": "2025-07-22 22:25:09", "publisher": "Business Insider", "title": "These are the top 5 questions Tesla investors have ahead of the company's Q2 earnings call", "image": "https://images.financialmodelingprep.com/news/these-are-the-top-5-questions-tesla-investors-have-20250722.jpg", "site": "businessinsider.com", "text": "Tesla will provide an update on its second-quarter earnings on Wednesday. Investors want to know more about the company's progress on robotaxis and affordable Tesla models.", "url": "https://www.businessinsider.com/tesla-q2-earnings-call-top-questions-robotaxi-fsd-affordable-optimus-2025-7", "publishedDateET": "2025-07-22T18:25:09-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 18:40:07", "publisher": "Yahoo Finance", "title": "How Tesla performs post earnings: A historical look back", "image": "https://images.financialmodelingprep.com/news/how-tesla-performs-post-earnings-a-historical-look-back-20250722.jpg", "site": "youtube.com", "text": "Yahoo Finance Markets and Data Editor Jared Blikre, who also hosts Yahoo Finance's Stocks in Translation podcast, takes a look at Tesla's (TSLA) historical stock moves and stock returns, as the company prepares to report its second quarter results on Wednesday after the markets close. Catch more Stocks in Translation here, with new episodes every Tuesday and Thursday.", "url": "https://www.youtube.com/watch?v=qgwvnSSN1Ss", "publishedDateET": "2025-07-22T14:40:07-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 17:18:29", "publisher": "Yahoo Finance", "title": "Ranking the Mag 7 stocks: Nvidia is the top stock", "image": "https://images.financialmodelingprep.com/news/ranking-the-mag-7-stocks-nvidia-is-the-top-20250722.jpg", "site": "youtube.com", "text": "Brian Mulberry, Zacks Investment Management Senior Client Portfolio Manager speaks with Market Domination Overtime Host Josh Lipton about why Nvidia is the top-ranked stock in the \"Magnificent 7.\" He also breaks down why AI is a key factor in the ranking, saying it \"will lead to the highest level of earnings growth and durability.", "url": "https://www.youtube.com/watch?v=3lQNHsMbOCc", "publishedDateET": "2025-07-22T13:18:29-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 16:13:42", "publisher": "CNBC Television", "title": "Google and Tesla are worth owning going into earnings, says Intelligent Alpha's Doug Clinton", "image": "https://images.financialmodelingprep.com/news/google-and-tesla-are-worth-owning-going-into-earnings-20250722.jpg", "site": "youtube.com", "text": "Doug Clinton, Intelligent Alpha, joins 'Closing Bell' to discuss the big tech earnings on deck, how to balance recent data from Google and much more.", "url": "https://www.youtube.com/watch?v=4MXNmHOgH4E", "publishedDateET": "2025-07-22T12:13:42-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 14:55:48", "publisher": "CNBC", "title": "Wall Street is upbeat on tech megacaps, but big questions loom on AI spending, China, Trump tariffs", "image": "https://images.financialmodelingprep.com/news/wall-street-is-upbeat-on-tech-megacaps-but-big-20250722.jpg", "site": "cnbc.com", "text": "Tech earnings season kicks off Wednesday with results from Alphabet and Tesla, followed by Meta, Microsoft, Amazon and Apple next week. President Trump's tariffs and AI spending were the big topics last quarter and remain top of mind for investors.", "url": "https://www.cnbc.com/2025/07/22/tech-q2-earnings-preview-ai-spending-china-and-trump-tariffs-loom.html", "publishedDateET": "2025-07-22T10:55:48-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 14:39:22", "publisher": "247 Wallst", "title": "Live: OpenDoor (Nasdaq: OPEN) & Navitas Lead Momentum Stocks on July 21", "image": "https://images.financialmodelingprep.com/news/live-opendoor-nasdaq-open-navitas-lead-momentum-stocks-on-20250722.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Has Ended Trading Day Over 4:14 pm by Eric Bleeker At the end of the day, OpenDoor closed up 42.67%. That&#8217;s a mammoth gain for any trading day, yet I&#8217;d imagine plenty of investors were disappointed with the way it ended. Options traders had been making massive bets on OpenDoor to hit $4.50, so there appears to have been some major profit taking with shares trading comfortably above that level in late trading. OpenDoor from trading for $4.88 at 2:40 p.m. ET down to $2.94 at 3:35 p.m. ET. Yet, it is worth noting that shares rallied into the bell and are up another 6.5% after-hours as of 4:18 p.m. ET. One thing is for certain: tomorrow will be another wild ride. Trading resumes 3:17 pm After losing 30% plus in value after a mega trade triggered a pause on the stock, OPEN is back up to $3.95 per share and still up 70% on the day. OPEN stock trading halted 3:12 pm After soaring as high as 115% today OPEN just received a massive sell order that prompted a trading freeze on the stock. Around 3 PM EDT, a 35 million share trade order was received the stock was set to plummet. OpenDoor Now Past 100% Gains Today 1:57 pm by Eric Bleeker OpenDoor is now up 110% on the day. Volume stands at 1.2 billion shares traded, which is 12X more than OpenDoor&#8217;s usual level. We still have two more hours of trading left in the day. OpenDoor Mentions Skyrocketing on WallStreetBets 1:12 pm by Eric Bleeker Since we first published this live blog, mentions of OpenDoor have skyrocketed even higher on WallStreetBets. Third-party tracking site AltIndex now has 263 mentions of OpenDoor, which is higher than second place Tesla&#8217;s 232. Behind those stocks is Alphabet, Robinhood, NVIDIA, UnitedHealth, RocketLab, GameStop, and AST SpaceMobile. OpenDoor Surges To New Highs 1:11 pm by Eric Bleeker As of 1:11 p.m. ET, OpenDoor shares have hit $4.37 and are now up 94% on the day. OpenDoor Tests Daily High of $4.26 12:22 pm by Eric Bleeker OpenDoor reached its high today at 11:35 a.m. when shares hit $4.26. Shortly after that peak fell back to $3.69 at 11:55 a.m. ET. As of 12:22 p.m., the rally ahs resumed and OpenDoor is trading for about $4 per share. The broader market is having a strong day today with the Nasdaq up .65% and the S&amp;P 500 up .56%. Yet, one segment of the market is outperforming everything else: that&#8217;s the new meme stocks. We&#8217;ve come a long way from the rallies in stocks like Gamestop and AMC that dominated 2021, and a crop of new companies has captured retail investors&#8217; attention. The number one stock in focus right now: OpenDoor (Nasdaq: OPEN). OpenDoor&#8217;s rally began after Eric Jackson posted on X that he believed the stock could reach $82 per share. He said: &#8220;Over the last month, my X impressions have exploded talking about $BTQQF $IREN and $CIFR because everyone is looking for the next $CVNA. We think we just found another. @EMJCapital has taken a position in $OPEN — and we believe it could be a 100-bagger over the next few years.&#8221; The price target of $82 was essentially OpenDoor&#8217;s share price at the time, times 100. Very scientific, I know. Yet, Jackson calls himself &#8220;the Carvana hedge fund guy&#8221; and his cheerleading of OpenDoor has attracted plenty of attention. After Carvana&#8217;s 100-fold surge from the bottom, investors are rabdily looking for the next great turnaround story. This live blog will be watching activity in the momentum stocks today with a focus on which stocks are seeing the biggest movements. Momentum Stock Leaderboard Among stocks that have become retail favorites in the current market rally, here&#8217;s a look at some of today&#8217;s biggest movers: OpenDoor: Up 72% as of 12:05 p.m. ET. The company is now worth more than $2 billion. Shares are now up 144% year-to-date, yet many investors buying into the rally are surely lookign at the long-term chart and seeing OpenDoor hit $35 per share back in February 2021. There&#8217;s no specific news on the company today. However, third party data tracking WallStreetBets discussions have OpenDoor passing Tesla (Nasdaq: TSLA) as the most discussed stock in the past 24 hours. Navitas Semiconductor: Up 30% midday. The company opened the day trading for about $7.44 per share, but has since zoomed higher to $8.75. There doesn&#8217;t appear to be any news related to the company, but Navitas has been a popular stock since they announced a collaboration with NVIDIA on their 800-volt HVDC architecture. Momentum Stocks Dropping Today While OpenDoor and Navitas are surging, a few popualar momentum stocks are having tougher days. Lucid (Nasdaq: LCID) is down 8.8% while QuantumScape (NYSE: QS) is down 14%. If you&#8217;re looking for news on QuantumScape, good luck. It&#8217;s largely all AI-generated slop (womp womp). The reality is there doesn&#8217;t seem to material news. The stock is up 198% in the past month and it&#8217;s likely that some large investor (or investors) is taking profits today. The story is similar for Lucid, the stock has skyrocketed in recent weeks thanks to a partnership with Uber and investors are likely taking profits today rather than any material information impacting the company&#8217;s share price. The post Live: OpenDoor (Nasdaq: OPEN) &#038; Navitas Lead Momentum Stocks on July 21 appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/21/live-opendoor-nasdaq-open-navitas-lead-momentum-stocks-on-july-21/", "publishedDateET": "2025-07-22T10:39:22-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 14:25:37", "publisher": "Yahoo Finance", "title": "Fed Chair Powell's future and Fed independence, Tesla opens a retro-futuristic diner in California", "image": "https://images.financialmodelingprep.com/news/fed-chair-powells-future-and-fed-independence-tesla-opens-20250722.jpg", "site": "youtube.com", "text": "Market Catalyst anchor Julie Hyman breaks down the latest financial news for July 22, 2025. US Treasury Secretary Scott Bessent commented that he does not see a reason for Fed Chair Powell to step down.", "url": "https://www.youtube.com/watch?v=j0VTj6e9qvA", "publishedDateET": "2025-07-22T10:25:37-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 14:22:11", "publisher": "CNBC", "title": "GM says EVs are its 'North Star' as legacy automaker chases Tesla", "image": "https://images.financialmodelingprep.com/news/gm-says-evs-are-its-north-star-as-legacy-20250722.jpg", "site": "cnbc.com", "text": "While Tesla remains the No. 1 electric vehicle manufacturer in the U.S. by far, General Motors said it has secured the No.", "url": "https://www.cnbc.com/2025/07/22/general-motors-electric-vehicles-tesla.html", "publishedDateET": "2025-07-22T10:22:11-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 13:51:52", "publisher": "Reuters", "title": "Tesla's second-quarter EV registrations in California fell 21%, industry data shows", "image": "https://images.financialmodelingprep.com/news/teslas-secondquarter-ev-registrations-in-california-fell-21-industry-20250722.jpg", "site": "reuters.com", "text": "Tesla's electric vehicle registrations in California fell 21.1% in the second quarter, according to industry data, indicating growing challenges for the Elon Musk-led automaker in the crucial U.S. market.", "url": "https://www.reuters.com/business/autos-transportation/teslas-second-quarter-ev-registrations-california-fell-21-industry-data-shows-2025-07-22/", "publishedDateET": "2025-07-22T09:51:52-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 13:16:32", "publisher": "Proactive Investors", "title": "Tesla Q2 results ‘nothing to write home about' as investors focus on Robotaxi, AI strategy", "image": "https://images.financialmodelingprep.com/news/tesla-q2-results-nothing-to-write-home-about-as-investors-20250722.jpg", "site": "proactiveinvestors.com", "text": "Tesla Inc (NASDAQ:TSLA) will hand down its second quarter earnings this week amid a dramatically different backdrop than just three months ago, according to Wedbush analysts. “While near-term and this quarter the numbers are nothing to write home about, we believe investors are instead focused on the AI future at Tesla with a motivated [CEO Elon] Musk back driving Tesla's future,” the firm wrote.", "url": "https://www.proactiveinvestors.com/companies/news/1075223", "publishedDateET": "2025-07-22T09:16:32-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 13:00:25", "publisher": "Schwab Network", "title": "GM \"Got Ahead of Itself\" Before Earnings, EV Sales Catching Up to TSLA", "image": "https://images.financialmodelingprep.com/news/gm-got-ahead-of-itself-before-earnings-ev-sales-20250722.jpg", "site": "youtube.com", "text": "Investors are taking a \"cautious\" approach to General Motors (GM) after its earnings beat, according to Bob Lang. He says the company posted strong numbers in several metrics, including EV sales, which Bob says are second to Tesla (TSLA).", "url": "https://www.youtube.com/watch?v=F_JELXezEJg", "publishedDateET": "2025-07-22T09:00:25-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 11:10:56", "publisher": "Benzinga", "title": "Tesla's Battery Boom Faces A Global Shockwave—Thanks To Trump", "image": "https://images.financialmodelingprep.com/news/teslas-battery-boom-faces-a-global-shockwavethanks-to-trump-20250722.jpg", "site": "benzinga.com", "text": "Tesla Inc.'s TSLA red-hot energy storage business is suddenly staring down a geopolitical cold front—and President Donald Trump may be at the center of it. With second-quarter earnings set for Wednesday, Wall Street is watching closely to see whether Elon Musk's energy ambitions can withstand a fresh wave of tariff tensions that threaten to hit the battery segment harder than the EV business.", "url": "https://www.benzinga.com/markets/tech/25/07/46549038/teslas-battery-boom-faces-a-global-shockwave-thanks-to-trump", "publishedDateET": "2025-07-22T07:10:56-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 10:17:52", "publisher": "Seeking Alpha", "title": "Tesla Q2 Preview: The Market's Biggest Bluff, The Trillion-Dollar Illusion Is Over", "image": "https://images.financialmodelingprep.com/news/tesla-q2-preview-the-markets-biggest-bluff-the-trilliondollar-20250722.jpg", "site": "seekingalpha.com", "text": "Tesla, Inc.'s fundamentals have deteriorated: sales are down, margins are compressed, and free cash flow is shrinking, with guidance becoming increasingly vague. TSLA stock trades at extreme valuation multiples (EV/EBITDA ~80x, P/E ~178x), unsupported by growth, profitability, or innovation relative to peers like BYD. Key risks include expiring U.S. tax credits, weak new product pipeline, operational setbacks in Cybertruck and Robotaxi, and fierce Chinese competition.", "url": "https://seekingalpha.com/article/4803026-tesla-q2-preview-markets-biggest-bluff-trillion-dollar-illusion-is-over", "publishedDateET": "2025-07-22T06:17:52-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 10:00:00", "publisher": "PRNewsWire", "title": "INVESTOR ALERT: Pomerantz Law Firm Investigates Claims On Behalf of Investors of Tesla, Inc. - TSLA", "image": "https://images.financialmodelingprep.com/news/investor-alert-pomerantz-law-firm-investigates-claims-on-behalf-of-investors-of-tesla-20250722.jpg", "site": "prnewswire.com", "text": "NEW YORK , July 22, 2025 /PRNewswire/ -- Pomerantz LLP is investigating claims on behalf of investors of  Tesla, Inc. (\"Tesla\" or the \"Company\") (NASDAQ: TSLA).  Such investors are advised to contact Danielle Peyton at newaction@pomlaw.com or 646-581-9980, ext.", "url": "https://www.prnewswire.com/news-releases/investor-alert-pomerantz-law-firm-investigates-claims-on-behalf-of-investors-of-tesla-inc---tsla-302510411.html", "publishedDateET": "2025-07-22T06:00:00-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 09:49:42", "publisher": "CNBC", "title": "Tesla Diner: Photos show opening of Musk's futuristic California drive-in", "image": "https://images.financialmodelingprep.com/news/tesla-diner-photos-show-opening-of-musks-futuristic-california-20250722.jpg", "site": "cnbc.com", "text": "Elon Musk opened a new Tesla Diner in Hollywood, California, that has charging stations and two 66-foot movie screens. The diner serves American comfort food in Tesla-themed packaging.", "url": "https://www.cnbc.com/2025/07/22/tesla-diner-photos-california.html", "publishedDateET": "2025-07-22T05:49:42-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 09:43:15", "publisher": "Seeking Alpha", "title": "Tesla: Time To Admit Overvaluation (Downgrade)", "image": "https://images.financialmodelingprep.com/news/tesla-time-to-admit-overvaluation-downgrade-20250722.jpg", "site": "seekingalpha.com", "text": "I am downgrading Tesla, Inc. stock to Hold ahead of Q2 earnings due to poor recent results, negative revisions, and a risky near-term outlook. Tesla faces declining revenue and EPS, losing market share to competitors like BYD, and domestic headwinds from high interest rates. TSLA stock's valuation looks stretched with too aggressive long-term EPS growth assumptions; consensus target price signals potential downside from current levels.", "url": "https://seekingalpha.com/article/4803016-tesla-time-to-admit-overvaluation-downgrade", "publishedDateET": "2025-07-22T05:43:15-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 08:11:05", "publisher": "Fox Business", "title": "First-ever Tesla Diner opens in Hollywood", "image": "https://images.financialmodelingprep.com/news/firstever-tesla-diner-opens-in-hollywood-20250722.jpg", "site": "foxbusiness.com", "text": "Two-story Tesla Diner welcomes all visitors, offering classic menu items and entertainment on massive screens viewable from the Skypad or cars.", "url": "https://www.foxbusiness.com/economy/first-ever-tesla-diner-opens-hollywood", "publishedDateET": "2025-07-22T04:11:05-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 07:12:48", "publisher": "Reuters", "title": "Tesla's easy money from regulatory credits set to dry up amid weakening sales", "image": "https://images.financialmodelingprep.com/news/teslas-easy-money-from-regulatory-credits-set-to-dry-up-20250722.jpg", "site": "reuters.com", "text": "A key driver of Tesla's profit is disappearing fast as the U.S. government changes policies on an environmental asset known as regulatory credits.", "url": "https://www.reuters.com/business/autos-transportation/teslas-easy-money-regulatory-credits-set-dry-up-amid-weakening-sales-2025-07-22/", "publishedDateET": "2025-07-22T03:12:48-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 06:58:00", "publisher": "Barrons", "title": "Google, Tesla and Mag 7 Fortunes Diverge. But Watch for These AI Winners.", "image": "https://images.financialmodelingprep.com/news/google-tesla-and-mag-7-fortunes-diverge-but-watch-20250722.jpg", "site": "barrons.com", "text": "Stock market momentum stalls, TSMC joins $1 trillion club, short sellers circle Opendoor, and more news to start your day.", "url": "https://www.barrons.com/articles/google-tesla-ai-winners-things-to-know-today-e4eae8fb", "publishedDateET": "2025-07-22T02:58:00-04:00"}
{"symbol": "TSLA", "publishedDate": "2025-07-22 06:00:00", "publisher": "Market Watch", "title": "Tesla earnings are coming. Investors fret things could get worse.", "image": "https://images.financialmodelingprep.com/news/tesla-earnings-are-coming-investors-fret-things-could-get-20250722.jpg", "site": "marketwatch.com", "text": "Even any good news about the Austin robotaxi rides may not be enough to lift the stock, which has lost about a quarter of its value since a record high in December.", "url": "https://www.marketwatch.com/story/tesla-earnings-are-coming-investors-fret-things-could-get-worse-c56f20db", "publishedDateET": "2025-07-22T02:00:00-04:00"}
