{"symbol": "AMZN", "publishedDate": "2022-10-26 19:34:36", "publisher": "Zacks Investment Research", "title": "The Earnings Picture Is Good, But Not Great", "image": "https://images.financialmodelingprep.com/news/the-earnings-picture-is-good-but-not-great-20221026.jpg", "site": "zacks.com", "text": "The picture emerging from the 2022 Q3 earnings season continues to go against pre-season fears of an impending earnings cliff. Overall corporate profitability isn't great, but it isn't bad either.", "url": "https://www.zacks.com/commentary/1997992/the-earnings-picture-is-good-but-not-great", "publishedDateET": "2022-10-26T15:34:36-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 19:27:56", "publisher": "InvestorPlace", "title": "The 3 Hottest Stocks to Watch This Earnings Season", "image": "https://images.financialmodelingprep.com/news/the-3-hottest-stocks-to-watch-this-earnings-season-20221026.jpg", "site": "investorplace.com", "text": "Much like the first half of the year, the second half started out just as rough. However, there are still top stocks to watch.", "url": "https://investorplace.com/2022/10/the-3-hottest-stocks-to-watch-this-earnings-season/", "publishedDateET": "2022-10-26T15:27:56-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 18:50:11", "publisher": "Zacks Investment Research", "title": "AWS Revenue to Be Key In Amazon's Q3", "image": "https://images.financialmodelingprep.com/news/aws-revenue-to-be-key-in-amazons-q3-20221026.jpg", "site": "zacks.com", "text": "In Amazon's latest quarter, AWS raked in $19.7 billion, edging out the Zacks Consensus Estimate of $19.4 billion by roughly 1.6% and reflecting a substantial 33% Y/Y uptick.", "url": "https://www.zacks.com/stock/news/1997957/aws-revenue-to-be-key-in-amazon-s-q3", "publishedDateET": "2022-10-26T14:50:11-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 18:04:04", "publisher": "Zacks Investment Research", "title": "Amazon Q3 Preview: Rebound Quarter Inbound?", "image": "https://images.financialmodelingprep.com/news/amazon-q3-preview-rebound-quarter-inbound-20221026.jpg", "site": "zacks.com", "text": "Just in its latest earnings release, the e-commerce titan registered a 33% EPS miss.", "url": "https://www.zacks.com/stock/news/1997956/amazon-q3-preview-rebound-quarter-inbound", "publishedDateET": "2022-10-26T14:04:04-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 18:03:00", "publisher": "Business Wire", "title": "AWS Announces Amazon Neptune Serverless", "image": "https://images.financialmodelingprep.com/news/aws-announces-amazon-neptune-serverless-20221026.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company (NASDAQ: AMZN), today announced Amazon Neptune Serverless, a new serverless option for Amazon Neptune that automatically scales to support unpredictable and business-critical graph database workloads. Amazon Neptune is a fast, reliable, and fully managed service that makes it easy to build and run applications that need a graph database to efficiently store and query complex and highly connected datasets. Amazon Neptune Serverless includes Amazon Neptune’s advanced capabilities for high availability, performance, and resiliency. There are no upfront commitments or additional costs to use Amazon Neptune Serverless, and customers only pay for the database resources used. To get started with Amazon Neptune Serverless, visit aws.amazon.com/neptune/serverless. Developers building applications that track relationships among many connected data points (e.g., contact tracing, fraud detection, drug discovery, and network security) use graph databases to understand and quickly connect relationships for a clearer understanding of the full dataset. Today, customers like Accenture, ADP, Cox Automotive, Merck, NBCUniversal, Siemens, Uber, and Zeta Global use Amazon Neptune to build and operate sophisticated and interactive graph-based applications that can query billions of relationships within data. Customers choose Amazon Neptune for its ease of use, durability, performance, and availability. Since many applications that rely on graph databases have variable or unpredictable workloads where the volume and complexity of database queries can be spiky or intermittent, capacity planning can be difficult. For example, a knowledge graph that models commercial airline flights in the United States might see a sudden spike during the holidays, or a knowledge graph that models traffic patterns of New York City taxis might see a sudden spike during rush hour. Traditionally, customers with variable or unpredictable workloads must constantly monitor and reconfigure capacity to maintain consistently fast performance, or over-provision for peak capacity, which results in unnecessary excess costs. With Amazon Neptune Serverless, customers no longer need to provision, scale, and manage clusters of database instances. Amazon Neptune Serverless automatically provisions and scales graph database workloads to hundreds of thousands of queries to maintain consistently fast performance for applications with variable and unpredictable workloads. With Amazon Neptune Serverless, customers only pay for the database resources their applications use, saving customers up to 90% compared to provisioning for peak capacity. Amazon Neptune Serverless supports the same popular, easy-to-write graph query languages as Amazon Neptune. The new serverless offering provides the full breadth of Amazon Neptune capabilities, including supporting multiple AWS Availability Zones for high availability, read replicas for high performance, and fully managed software patching, updates, and backups for ease of use. “Customers tell us that they appreciate the ability to use Amazon Neptune to understand complex relationships among highly connected data points. They have also asked us to take care of the heavy lifting associated with managing capacity and optimizing for cost and performance,” said Swami Sivasubramanian, vice president of Databases, Analytics, and Machine Learning at AWS. “Now, with Amazon Neptune Serverless, customers have a graph database that automatically provisions and seamlessly scales clusters to provide just the right amount of capacity to meet demand, allowing them to build and run applications for even the most variable and unpredictable workloads without having to worry about provisioning capacity, scaling clusters, or incurring costs for unused resources.” Amazon Neptune Serverless is generally available today to customers running Amazon Neptune in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Tokyo), Europe (Ireland), and Europe (London), with availability in additional AWS Regions coming soon. LexisNexis Legal & Professional is a leading global provider of information and analytics. \"Connecting networks of related data is a key source of innovation for our legal research platform, and graph databases enable us to continually expand the sets of legal data which can be linked and queried,\" said Kyle Patrick, senior architect at LexisNexis Legal & Professional. \"With Amazon Neptune Serverless, our ability to scale from data science experiments to large-scale production systems can be far smoother and more cost effective. Since Amazon Neptune Serverless automatically scales capacity based on demand, we can build and share graph models with less concern around hitting capacity limitations or overprovisioning.\" Snap Inc. is a camera company focused on empowering people to express themselves, live in the moment, learn about the world, and have fun together. “We use graphs to manage the relationships among 347 million people who use Snapchat every day to Snap with family and friends, watch Stories, and explore content from top publishers around the world,” said Martin Qian, senior manager of Software Engineering at Snap. “We are excited about Amazon Neptune Serverless, which will allow us to scale up our graph database workload performance only when we need it. With Amazon Neptune Serverless, our developers will be able to move faster and focus more on innovating on behalf of our customers rather than building and operating graph database infrastructure.” Wiz is a cloud security platform that transforms how organizations secure their cloud using a graph-based approach. “At Wiz, we use Amazon Neptune to identify and map toxic combinations of cloud risks to reveal which of these pose the greatest threat. This allows our customers, including over 25% of the Fortune 100 and some of the largest cloud environments in the world, to fix what really matters,\" said Roy Reznik, co-founder and vice president of Research and Development at Wiz. “With Amazon Neptune Serverless, graph database workloads scale automatically to meet demand, so we never need to worry about managing database infrastructure and capacity and can instead focus on delivering more value for our customers.” About Amazon Web Services For over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 87 Availability Zones within 27 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and Thailand. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com. About Amazon Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit www.amazon.com/about and follow @AmazonNews.", "url": "https://www.businesswire.com/news/home/20221026006081/en/AWS-Announces-Amazon-Neptune-Serverless", "publishedDateET": "2022-10-26T14:03:00-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 18:03:00", "publisher": "Business Wire", "title": "AWS Announces Amazon Neptune Serverless", "image": "https://images.financialmodelingprep.com/news/aws-announces-amazon-neptune-serverless-20221026.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Amazon Neptune Serverless automatically scales to support unpredictable and business-critical graph database workloads", "url": "https://www.businesswire.com/news/home/20221026006081/en/AWS-Announces-Amazon-Neptune-Serverless/", "publishedDateET": "2022-10-26T14:03:00-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 15:25:17", "publisher": "InvestorPlace", "title": "7 Undervalued Blue-Chip Stocks to Buy Now", "image": "https://images.financialmodelingprep.com/news/7-undervalued-bluechip-stocks-to-buy-now-20221026.jpg", "site": "investorplace.com", "text": "Undervalued blue-chip stocks are a little easier to find in the midst of the current bear market. There are bargains to be found for investors who can stomach short-term volatility.", "url": "https://investorplace.com/undervalued-blue-chip-stocks/", "publishedDateET": "2022-10-26T11:25:17-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 14:36:17", "publisher": "The Motley Fool", "title": "Why The Trade Desk, Meta Platforms, Amazon, and Other Digital Advertising Stocks Were Falling Today", "image": "https://images.financialmodelingprep.com/news/why-the-trade-desk-meta-platforms-amazon-and-other-20221026.jpg", "site": "fool.com", "text": "Alphabet's warning sent a shiver through the digital advertising and adtech industries.", "url": "https://www.fool.com/investing/2022/10/26/why-the-trade-desk-meta-platforms-amazon-and-other/", "publishedDateET": "2022-10-26T10:36:17-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 10:41:36", "publisher": "Seeking Alpha", "title": "Amazon Is Leveraging AWS To Boost Advertising Revenue", "image": "https://images.financialmodelingprep.com/news/amazon-is-leveraging-aws-to-boost-advertising-revenue-20221026.jpg", "site": "seekingalpha.com", "text": "Amazon has recently launched Amazon Marketing Stream (Beta), which is a cloud-powered solution that ultimately strives to improve conversion rates and RoAS for its sellers. While the initial responses from the \"Beta\" group are positive, proclaiming higher conversion rates and lower ACOS, these benefits are unlikely to prove sustainable amid a broader rollout.", "url": "https://seekingalpha.com/article/4549299-amazon-is-leveraging-aws-to-boost-advertising-revenue", "publishedDateET": "2022-10-26T06:41:36-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 10:23:35", "publisher": "Proactive Investors", "title": "Lloyds, Shell, Apple and Amazon on a jam-packed Thursday", "image": "https://images.financialmodelingprep.com/news/lloyds-shell-apple-and-amazon-on-a-jampacked-thursday-20221026.jpg", "site": "proactiveinvestors.co.uk", "text": "For Lloyds Banking Group PLC (LSE:LLOY), which is due to post a quarterly update on Thursday, an economic downturn is worse for business than for peers like Barclays and HSBC that have less of a focus on traditional banking in the UK. Investors and analysts will be keeping an eye on impairment charges as the bank prepares for more people defaulting on their loan repayments (read the Lloyds preview here), while the lender became the first in the industry to stop direct finance for new oil and gas development.", "url": "https://www.proactiveinvestors.co.uk/companies/news/996514?SNAPI", "publishedDateET": "2022-10-26T06:23:35-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 09:53:52", "publisher": "Forbes", "title": "Amazon Will Start Accepting Venmo Payments", "image": "https://images.financialmodelingprep.com/news/amazon-will-start-accepting-venmo-payments-20221026.jpg", "site": "forbes.com", "text": "Amazon and Venmo announced a partnership to offer Venmo as a payment option for Amazon purchases. Here's what it means for tech investors.", "url": "https://www.forbes.com/sites/qai/2022/10/26/amazon-will-start-accepting-venmo-payments/", "publishedDateET": "2022-10-26T05:53:52-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 07:00:35", "publisher": "Reuters", "title": "Big Tech tumbles as results sound alarm bells", "image": "https://images.financialmodelingprep.com/news/big-tech-tumbles-as-results-sound-alarm-bells-20221026.jpg", "site": "reuters.com", "text": "Grim results from Alphabet Inc and Microsoft Corp stoked fears of a global economic downturn and slammed the brakes on a fragile recovery in stock markets ahead of earnings from other tech megacaps.", "url": "https://www.reuters.com/markets/europe/big-tech-tumbles-results-sound-alarm-bells-2022-10-26/", "publishedDateET": "2022-10-26T03:00:35-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 06:20:00", "publisher": "The Motley Fool", "title": "A Hidden Risk for Amazon's Cloud Business", "image": "https://images.financialmodelingprep.com/news/a-hidden-risk-for-amazons-cloud-business-20221026.jpg", "site": "fool.com", "text": "The cloud is not always the answer.", "url": "https://www.fool.com/investing/2022/10/26/a-hidden-risk-for-amazons-cloud-business/", "publishedDateET": "2022-10-26T02:20:00-04:00"}
{"symbol": "AMZN", "publishedDate": "2022-10-26 05:27:00", "publisher": "The Motley Fool", "title": "3 Top Growth Stocks That Could Soar by 40.3% to 62.1%, According to Wall Street", "image": "https://images.financialmodelingprep.com/news/3-top-growth-stocks-that-could-soar-by-403-20221026.jpg", "site": "fool.com", "text": "Analysts are extremely upbeat about these beaten-down stocks.", "url": "https://www.fool.com/investing/2022/10/26/3-top-growth-stocks-that-could-soar-403-to-621-acc/", "publishedDateET": "2022-10-26T01:27:00-04:00"}
