{"symbol": "AMZN", "publishedDate": "2021-02-04 01:31:03", "publisher": "Zacks Investment Research", "title": "Tech Sector Shows Its Enormous Earnings Power", "image": "https://images.financialmodelingprep.com/news/tech-sector-shows-its-enormous-earnings-power-20210204.jpg", "site": "zacks.com", "text": "Tech Sector Shows Its Enormous Earnings Power", "url": "https://www.zacks.com/commentary/1257118/tech-sector-shows-its-enormous-earnings-power", "publishedDateET": "2021-02-03T20:31:03-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-04 01:31:02", "publisher": "Zacks Investment Research", "title": "Tech Sector Shows Its Enormous Earnings Power", "image": "https://images.financialmodelingprep.com/news/tech-sector-shows-its-enormous-earnings-power-20210204.jpg", "site": "zacks.com", "text": "Tech Sector Shows Its Enormous Earnings Power", "url": "https://www.zacks.com/commentary/1257129/tech-sector-shows-its-enormous-earnings-power", "publishedDateET": "2021-02-03T20:31:02-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-04 00:10:48", "publisher": "Seeking Alpha", "title": "SPYG: Market-Mania Signals Potential Peak For Big Tech", "image": "https://images.financialmodelingprep.com/news/spyg-marketmania-signals-potential-peak-for-big-tech-20210204.jpg", "site": "seekingalpha.com", "text": "SPYG: Market-Mania Signals Potential Peak For Big Tech", "url": "https://seekingalpha.com/article/4403240-spyg-market-mania-signals-potential-peak-for-big-tech", "publishedDateET": "2021-02-03T19:10:48-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 20:08:50", "publisher": "CNBC", "title": "Amazon is using AI-equipped cameras in delivery vans and some drivers are concerned about privacy", "image": "https://images.financialmodelingprep.com/news/amazon-is-using-aiequipped-cameras-in-delivery-vans-and-some-20210203.jpeg", "site": "cnbc.com", "text": "Amazon has deployed the cameras from Netradyne in Amazon-branded cargo vans used by a handful of companies that are part of its delivery service partner program.", "url": "https://www.cnbc.com/2021/02/03/amazon-using-ai-equipped-cameras-in-delivery-vans.html", "publishedDateET": "2021-02-03T15:08:50-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 18:34:05", "publisher": "Benzinga", "title": "Here's What The Street Thinks Of Amazon's New Boss", "image": "https://images.financialmodelingprep.com/news/heres-what-the-street-thinks-of-amazons-new-boss-20210203.jpg", "site": "benzinga.com", "text": "Jeff Bezos' era of running Amazon.com, Inc. (NASDAQ: AMZN) as CEO comes to an end later this year. His replacement is Andy Jassy, a veteran of Amazon since 1997 and is credited with founding Amazon Web Services (AWS).", "url": "https://www.benzinga.com/news/21/02/19472952/heres-what-the-street-thinks-of-amazons-new-boss", "publishedDateET": "2021-02-03T13:34:05-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 17:18:54", "publisher": "InvestorPlace", "title": "4 Top Stock Trades for Thursday: AMZN, SPOT, BMY, ABBV", "image": "https://images.financialmodelingprep.com/news/4-top-stock-trades-for-thursday-amzn-spot-bmy-20210203.jpg", "site": "investorplace.com", "text": "Amazon, Spotify, Bristol-Myers Squibb and AbbVie were our top stock trades for Thursday. Let's look at the charts of these earnings movers.", "url": "https://investorplace.com/2021/02/4-top-stock-trades-for-thursday-amzn-spot-bmy-abbv/", "publishedDateET": "2021-02-03T12:18:54-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 16:20:55", "publisher": "Benzinga", "title": "PreMarket Prep Stock Of The Day: Amazon", "image": "https://images.financialmodelingprep.com/news/premarket-prep-stock-of-the-day-amazon-20210203.jpg", "site": "benzinga.com", "text": "Every earnings season takes on a character of its own. For example, in the second quarter of 2020, many of the companies that posted staggering losses as a result of the pandemic were given a pass, with investors buying the dip.", "url": "https://www.benzinga.com/news/earnings/21/02/19475331/premarket-prep-stock-of-the-day-amazon", "publishedDateET": "2021-02-03T11:20:55-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 15:56:19", "publisher": "InvestorPlace", "title": "Stock Market Movers & Shakers: 5 Big Names in Business Ready to Move Stocks", "image": "https://images.financialmodelingprep.com/news/stock-market-movers-shakers-5-big-names-in-business-20210203.jpg", "site": "investorplace.com", "text": "Stock market movers this week include Robinhood CEO Vlad Tenev and outgoing Amazon CEO Jeff Bezos. Here's how they are influencing Wall Street now.", "url": "https://investorplace.com/2021/02/stock-market-movers-big-names-business-tsla-amzn-blue-origin-bitcoin-bmbl-ipo/", "publishedDateET": "2021-02-03T10:56:19-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 15:47:56", "publisher": "Business Insider", "title": "'Jassy's the captain now': Here's what 4 Wall Street banks had to say about Amazon's 4th-quarter earnings", "image": "https://images.financialmodelingprep.com/news/jassys-the-captain-now-heres-what-4-wall-street-20210203.jpg", "site": "businessinsider.com", "text": "Amazon's fourth-quarter earnings impressed on Tuesday, matching high analyst expectations. The company managed a 44% year-over-year revenue jump in the quarter, breaking the $100 billion net sales mark for the first time just days after Apple managed a similar feat.", "url": "https://www.businessinsider.com/amazon-q4-earnings-reaction-ecommerce-aws-bezos-jassy-2021-2", "publishedDateET": "2021-02-03T10:47:56-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 15:25:00", "publisher": "Reuters", "title": "With Bezos out as Amazon CEO, is this the end of his ominous question-mark emails?", "image": "https://images.financialmodelingprep.com/news/with-bezos-out-as-amazon-ceo-is-this-the-end-20210203.jpg", "site": "reuters.com", "text": "For staff at Amazon.com Inc, the departure of CEO Jeff Bezos may spell the end of one of the company's unusual and, for some managers, frightening practices: the \"question-mark\" email.", "url": "https://www.reuters.com/article/us-amazon-com-bezos/with-bezos-out-as-amazon-ceo-is-this-the-end-of-his-ominous-question-mark-emails-idUSKBN2A32Z8", "publishedDateET": "2021-02-03T10:25:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 14:59:10", "publisher": "Business Insider", "title": "Amazon will surge 21% as deliveries stay elevated in a post-pandemic world, Canaccord says", "image": "https://images.financialmodelingprep.com/news/amazon-will-surge-21-as-deliveries-stay-elevated-in-20210203.jpg", "site": "businessinsider.com", "text": "The coronavirus drove a massive influx of consumer spending to Amazon. That boost could very well outlive the pandemic and help shares charge higher still, analysts at Canaccord Genuity said Tuesday. The team led by Michael Graham lifted their price target for Amazon stock to $4,100 from $3,800, reflecting expectations for a 21% climb from Tuesday's closing level. The move comes after the e-commerce giant reported fourth-quarter figures that beat estimates for profit and revenue. Quarterly sales grew 44% and passed $100 billion for the first time ever.", "url": "https://www.businessinsider.com/amazon-stock-price-target-lifted-ecommerce-spending-economic-aws-amzn-2021-2", "publishedDateET": "2021-02-03T09:59:10-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 14:56:41", "publisher": "Benzinga", "title": "Who Is Andy Jassy, The Soon-To-Be CEO Of Amazon?", "image": "https://images.financialmodelingprep.com/news/who-is-andy-jassy-the-soontobe-ceo-of-amazon-20210203.jpg", "site": "benzinga.com", "text": "When Amazon.com, Inc. (NASDAQ: AMZN) released its fourth-quarter earnings on Tuesday, it had another big announcement: Jeff Bezos would be stepping down as CEO, moving to the role of executive chair in the third quarter of 2021. His replacement is Andy Jassy, current CEO of Amazon Web Services (AWS), an on-demand cloud computing subsidiary of Amazon.", "url": "https://www.benzinga.com/news/21/02/19469822/who-is-andy-jassy-the-soon-to-be-ceo-of-amazon", "publishedDateET": "2021-02-03T09:56:41-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 14:49:20", "publisher": "PYMNTS", "title": "Jeff Bezos Steps Away As The Amazon Effect Intensifies", "image": "https://images.financialmodelingprep.com/news/jeff-bezos-steps-away-as-the-amazon-effect-intensifies-20210203.jpg", "site": "pymnts.com", "text": "Jeff Bezos is stepping away. After over two and a half decades at the helm of Amazon, Bezos will be handing off CEO responsibilities at the behemoth he built to the head of Amazon Web Services, Andy Jassy, and transitioning into the role of executive chairman starting in Q3 of 2021.", "url": "https://www.pymnts.com/amazon/2021/jeff-bezos-steps-away-as-the-amazon-effect-intensifies/", "publishedDateET": "2021-02-03T09:49:20-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 14:35:00", "publisher": "Market Watch", "title": "5 things to know about new Amazon CEO Andy Jassy", "image": "https://images.financialmodelingprep.com/news/5-things-to-know-about-new-amazon-ceo-andy-20210203.jpg", "site": "marketwatch.com", "text": "Jeff Bezos is stepping down as Amazon's CEO and will be replaced by AWS head Andy Jassy", "url": "https://www.marketwatch.com/story/5-things-to-know-about-new-amazon-ceo-andy-jassy-11612380924", "publishedDateET": "2021-02-03T09:35:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 13:03:25", "publisher": "InvestorPlace", "title": "Bezos Will Be Missed, But Jassy Could Shift Amazon Into Hypergrowth", "image": "https://images.financialmodelingprep.com/news/bezos-will-be-missed-but-jassy-could-shift-amazon-into-20210203.jpg", "site": "investorplace.com", "text": "Bezos is the man. But under Jassy's leadership, Amazon could unlock its full potential as a cloud computing giant, making AMZN stock a buy.", "url": "https://investorplace.com/hypergrowthinvesting/2021/02/bezos-will-be-missed-but-jassy-could-shift-amazon-into-hypergrowth/", "publishedDateET": "2021-02-03T08:03:25-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:13:00", "publisher": "Market Watch", "title": "Mark Hulbert: The key lesson for Amazon investors as Andy Jassy takes over from Jeff Bezos", "image": "https://images.financialmodelingprep.com/news/mark-hulbert-the-key-lesson-for-amazon-investors-as-andy-20210203.jpg", "site": "marketwatch.com", "text": "Academic research says promoting a company insider to CEO rather than recruiting a superstar CEO is the smarter move.", "url": "https://www.marketwatch.com/story/the-key-lesson-for-amazon-investors-as-andy-jassy-takes-over-from-jeff-bezos-11612372431", "publishedDateET": "2021-02-03T07:13:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:08:00", "publisher": "Market Watch", "title": "The Ratings Game: Jeff Bezos' successor as Amazon CEO, Andy Jassy, gets the thumbs up from analysts", "image": "https://images.financialmodelingprep.com/news/the-ratings-game-jeff-bezos-successor-as-amazon-ceo-20210203.jpg", "site": "marketwatch.com", "text": "Wedbush analysts say the change is \"largely inconsequential\"", "url": "https://www.marketwatch.com/story/jeff-bezos-successor-as-amazon-ceo-andy-jassy-gets-the-thumbs-up-from-analysts-11612372110", "publishedDateET": "2021-02-03T07:08:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:07:21", "publisher": "Zacks Investment Research", "title": "Amazon (AMZN) Q4 Earnings Surpass Estimates, Sales Rise Y/Y", "image": "https://images.financialmodelingprep.com/news/amazon-amzn-q4-earnings-surpass-estimates-sales-rise-yy-20210203.jpg", "site": "zacks.com", "text": "Amazon's (AMZN) fourth-quarter results reflect robust holiday performance and strength across online store sales, third-party seller, Prime and AWS.", "url": "https://www.zacks.com/stock/news/1256802/amazon-amzn-q4-earnings-surpass-estimates-sales-rise-y-y", "publishedDateET": "2021-02-03T07:07:21-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:06:00", "publisher": "The Motley Fool", "title": "These 2 Nasdaq Tech Titans Are Getting the Stock Market's Attention", "image": "https://images.financialmodelingprep.com/news/these-2-nasdaq-tech-titans-are-getting-the-stock-20210203.jpg", "site": "fool.com", "text": "The broader market is taking a break despite some big earnings reports.", "url": "https://www.fool.com/investing/2021/02/03/these-2-nasdaq-tech-titans-are-getting-the-stock-m/", "publishedDateET": "2021-02-03T07:06:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:03:00", "publisher": "Business Wire", "title": "Amazon Continues Investment in Tennessee with Alcoa Fulfillment Center", "image": "https://images.financialmodelingprep.com/news/amazon-continues-investment-in-tennessee-with-alcoa-fulfillment-center-20210203.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Amazon.com, Inc. (NASDAQ: AMZN) today announced plans to open a fulfillment center in Alcoa, Tennessee. The site, which is anticipated to launch in 2022, will create nearly 800 new, full-time jobs with benefits and opportunities to engage with advanced robotics. The company currently has fulfillment and sortation centers in Charleston, Chattanooga, Lebanon, Murfreesboro, Memphis and Nashville. “We are excited to continue creating a positive economic impact in the region with job opportunities and industry-leading benefits that start on the first day of the job,” said Holly Sullivan, Amazon’s head of worldwide economic development. “Tennessee is a great state for business and we are excited to have the opportunity to partner, grow and better serve our customers throughout this region.” “Over the past year, Amazon has announced projects in each of Tennessee’s grand divisions, accounting for nearly 3,000 new jobs. As we continue to navigate through the pandemic and reboot our economy, we know our recovery is supported by the success of our Tennessee businesses. We are grateful that Amazon continues to provide jobs to thousands of Tennesseans, and we congratulate the company on its newest fulfillment center in Alcoa,” said Tennessee Governor Bill Lee. The Alcoa facility will be Amazon’s third fulfillment center in Tennessee to use innovative robotics technology and the company’s eighth fulfillment center in the Volunteer State. Amazon employees at the more than 634,812 square-foot fulfillment center will pick, pack and ship smaller customer items, such as books, electronics and consumer goods. “It is a testament to the strength of Tennessee’s business climate that companies are attracted to our state and choose to operate and expand here. Amazon is a global brand that has invested $1.5 billion and created more than 25,000 jobs across all three grand divisions of our state, and we appreciate their team for choosing to grow in East Tennessee,” said Bob Rolfe, commissioner of the Tennessee Department of Economic and Community Development. “We would also like to thank Tennessee Department of Transportation Commissioner Clay Bright and his outstanding leadership team for their many contributions to help bring this project to fruition.” On top of the company’s industry-leading starting wage from $15, the company offers full-time employees comprehensive benefits including full medical, vision, and dental insurance as well as a 401(k) with 50 percent match starting on day one. The company also offers up to 20 weeks of maternal and parental paid leave and innovative benefits such as Leave Share and Ramp Back, which give new parents flexibility with their growing families. In addition, Amazon has pledged to invest over $700 million to provide upskilling training for 100,000 U.S. employees for in demand jobs. Programs will help Amazonians from all backgrounds access training to move into highly skilled roles across the company’s corporate offices, tech hubs, fulfillment centers, retails stores, and transportation network, or pursue career paths outside of Amazon. \"Blount County, along with the cities of Alcoa and Maryville, are delighted Amazon made its decision to locate here. The jobs and worldwide recognition it brings are extremely beneficial to this area,” said Blount County Mayor Ed Mitchell. “We thank Amazon, Governor Bill Lee, Tennessee ECD Commissioner Bob Rolfe, Tennessee Department of Transportation, and our county and city commissioners for tirelessly working together to bring this project to fruition. I, along with the citizens of Blount County, wish them great success and look forward to working with them for many years to come.\" All associates will go through hours of safety training and have access to continuing education opportunities through Amazon’s upskilling programs such as Career Choice. In this program, the company will pre-pay up to 95 percent of tuition for courses related to in-demand fields, regardless of whether the skills are relevant to a career at Amazon. Since the program’s launch, more than 25,000 employees have pursued degrees in game design and visual communications, nursing, IT programming and radiology, to name a few. “Having Amazon locate in a community has proven to be beneficial for everyone involved, and on behalf of the Blount County Industrial Development Board, I’m happy to welcome its leadership to Blount County and East Tennessee,” said Blount County Industrial Development Board Chair Matt Murray. “The regional economic impact of an operation like this will be felt almost immediately. We are excited to get this project progressing quickly and look forward to watching it grow.” Amazon’s fulfillment network supports millions of businesses of all sizes worldwide through its Fulfillment by Amazon offering, and many of those local organizations are based in Tennessee. There are more than 30,000 authors, small and medium-sized businesses, and developers in Tennessee growing their companies and reaching new customers on Amazon products and services. The project is being developed by Hillwood Development Company, Inc. To learn more about working at an Amazon fulfillment center, visit www.amazondelivers.jobs. About Amazon: Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Fire tablets, Fire TV, Amazon Echo, and Alexa are some of the products and services pioneered by Amazon. For more information, visit https://www.aboutamazon.com/ and follow @AmazonNews.", "url": "https://www.businesswire.com/news/home/20210203005744/en/Amazon-Continues-Investment-in-Tennessee-with-Alcoa-Fulfillment-Center", "publishedDateET": "2021-02-03T07:03:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 12:03:00", "publisher": "Business Wire", "title": "Amazon Continues Investment in Tennessee with Alcoa Fulfillment Center", "image": "https://images.financialmodelingprep.com/news/amazon-continues-investment-in-tennessee-with-alcoa-fulfillment-center-20210203.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Amazon.com, Inc. (NASDAQ: AMZN) today announced plans to open a fulfillment center in Alcoa, Tennessee. The site, which is anticipated to launch in 2022, will create nearly 800 new, full-time jobs with benefits and opportunities to engage with advanced robotics. The company currently has fulfillment and sortation centers in Charleston, Chattanooga, Lebanon, Murfreesboro, Memphis and Nashville. “We are excited to continue creating a positive economic impact in the regio", "url": "https://www.businesswire.com/news/home/20210203005744/en/Amazon-Continues-Investment-in-Tennessee-with-Alcoa-Fulfillment-Center/", "publishedDateET": "2021-02-03T07:03:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:34:47", "publisher": "Benzinga", "title": "'Replacing The Irreplaceable': Amazon Analysts React To Bezos Departure, Earnings Beat", "image": "https://images.financialmodelingprep.com/news/replacing-the-irreplaceable-amazon-analysts-react-to-bezos-departure-20210203.jpg", "site": "benzinga.com", "text": "Amazon.com, Inc. (NASDAQ: AMZN) shares ticked slightly lower on Wednesday after the company reported some impressive fourth-quarter earnings numbers. Amazon reported adjusted earnings per share of $14.09 on $125.5 billion in revenue.", "url": "https://www.benzinga.com/analyst-ratings/analyst-color/21/02/19469716/replacing-the-irreplaceable-amazon-analysts-react-to-bezos-departure-earnings-beat", "publishedDateET": "2021-02-03T06:34:47-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:31:49", "publisher": "InvestorPlace", "title": "Watch Out, SpaceX! Blue Origin Threatens Space Stocks as Bezos Renews Focus", "image": "https://images.financialmodelingprep.com/news/watch-out-spacex-blue-origin-threatens-space-stocks-as-20210203.jpg", "site": "investorplace.com", "text": "Jeff Bezos is stepping down from his role as Amazon CEO to focus on Blue Origin. Here is what that means for SpaceX and top space stocks.", "url": "https://investorplace.com/2021/02/blue-origin-spacex-jeff-bezos-space-stocks-spce-arkx-hol-srac-npa/", "publishedDateET": "2021-02-03T06:31:49-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:31:39", "publisher": "CNBC", "title": "Here are the top candidates to replace Andy Jassy as head of Amazon Web Services", "image": "https://images.financialmodelingprep.com/news/here-are-the-top-candidates-to-replace-andy-jassy-20210203.jpg", "site": "cnbc.com", "text": "Amazon has decided Andy Jassy won't run cloud and all other parts of Amazon. A few names have emerged as Jassy's possible successors, and one stands out most.", "url": "https://www.cnbc.com/2021/02/03/who-will-replace-andy-jassy-as-head-of-amazon-web-services.html", "publishedDateET": "2021-02-03T06:31:39-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:22:16", "publisher": "Zacks Investment Research", "title": "5 ETFs to Buy on Amazon's Blockbuster Q4 Earnings", "image": "https://images.financialmodelingprep.com/news/5-etfs-to-buy-on-amazons-blockbuster-q4-earnings-20210203.jpg", "site": "zacks.com", "text": "Amazon posted blockbuster results for Q4. The company has emerged a winner, providing an alternative to stores and benefiting from the accelerated adoption of e-commerce driven by video streaming and remote working.", "url": "https://www.zacks.com/stock/news/1256723/5-etfs-to-buy-on-amazons-blockbuster-q4-earnings", "publishedDateET": "2021-02-03T06:22:16-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:01:30", "publisher": "InvestorPlace", "title": "7 Top Stocks for 2021 Portfolios", "image": "https://images.financialmodelingprep.com/news/7-top-stocks-for-2021-portfolios-20210203.jpg", "site": "investorplace.com", "text": "These seven top stocks for 2021 reflect a mix of strong performance in 2020, environmental impact and financial muscle to prosper. The post 7 Top Stocks for 2021 Portfolios appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/02/7-top-stocks-to-buy-for-2021-xpev-hyln-chwy-amazn-msft-plug-cgc/", "publishedDateET": "2021-02-03T06:01:30-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 11:00:01", "publisher": "CNBC", "title": "Parler's survival is uncertain after it was dropped by Amazon, Apple and Google", "image": "https://images.financialmodelingprep.com/news/parlers-survival-is-uncertain-after-it-was-dropped-by-20210203.jpeg", "site": "cnbc.com", "text": "During the 2020 election, many conservatives flocked to social media platform Parler decrying Big Tech's labeling of posts. Now the upstart site is struggling.", "url": "https://www.cnbc.com/2021/02/03/parlers-survival-is-uncertain-after-it-was-dropped-by-big-tech.html", "publishedDateET": "2021-02-03T06:00:01-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:58:21", "publisher": "Schaeffers Research", "title": "Amazon Names New CEO Amid Blowout Q4 Earnings Report", "image": "https://images.financialmodelingprep.com/news/amazon-names-new-ceo-amid-blowout-q4-earnings-report-20210203.jpg", "site": "schaeffersresearch.com", "text": "Amazon.com, Inc. (NASDAQ:AMZN) is the talk of the town today, after the e-tail giant reported jaw-dropping fourth-quarter earnings of $14.09 per share -- nearly double Wall Street's estimates of $7.23 per share.", "url": "https://www.schaeffersresearch.com/content/news/2021/02/03/amazon-names-new-ceo-amid-blowout-q4-earnings-report", "publishedDateET": "2021-02-03T05:58:21-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:42:23", "publisher": "CNBC", "title": "Amazon's next CEO will inherit a company riddled with challenges Bezos leaves behind", "image": "https://images.financialmodelingprep.com/news/amazons-next-ceo-will-inherit-a-company-riddled-with-20210203.jpeg", "site": "cnbc.com", "text": "Amazon still has a bright future ahead of it, but given its size and influence, Jassy will grapple with new issues his predecessor never had to.", "url": "https://www.cnbc.com/2021/02/03/amazons-new-ceo-andy-jassy-will-tackle-issues-bezos-never-had-to.html", "publishedDateET": "2021-02-03T05:42:23-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:29:00", "publisher": "Reuters", "title": "Alphabet shares power S&P 500, Nasdaq; Amazon dips", "image": "https://images.financialmodelingprep.com/news/alphabet-shares-power-sp-500-nasdaq-amazon-dips-20210203.jpg", "site": "reuters.com", "text": "The S&P 500 and the Nasdaq climbed on Wednesday, lifted by heavyweight Alphabet Inc's shares after its strong results, while investors counted on more fiscal stimulus to ride out the economic downturn.", "url": "https://www.reuters.com/article/us-usa-stocks/alphabet-shares-power-sp-500-nasdaq-amazon-dips-idUSKBN2A31QJ", "publishedDateET": "2021-02-03T05:29:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:28:59", "publisher": "CNBC", "title": "Amazon and Google reaped big rewards from a rebound in Q4 ad spend", "image": "https://images.financialmodelingprep.com/news/amazon-and-google-reaped-big-rewards-from-a-rebound-20210203.jpeg", "site": "cnbc.com", "text": "Amazon and Alphabet's Google, which posted fourth quarter earnings Tuesday, showed the benefits of a rebound in advertising following a pandemic dip in 2020.", "url": "https://www.cnbc.com/2021/02/03/amazon-and-google-earnings-showed-big-rewards-rebound-in-q4-ad-spend.html", "publishedDateET": "2021-02-03T05:28:59-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:26:10", "publisher": "Market Watch", "title": "Jeff Bezos built Amazon into a monolith — but did it hurt American workers?", "image": "https://images.financialmodelingprep.com/news/jeff-bezos-built-amazon-into-a-monolith-but-did-20210203.jpg", "site": "marketwatch.com", "text": "Research has found that Amazon warehouses don't boost local employment where they open.", "url": "https://www.marketwatch.com/story/jeff-bezos-built-amazon-into-a-monolith-but-did-it-hurt-american-workers-2021-02-03", "publishedDateET": "2021-02-03T05:26:10-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 10:04:30", "publisher": "Fox Business", "title": "Amazon investors take Jeff Bezos exit in stride", "image": "https://images.financialmodelingprep.com/news/amazon-investors-take-jeff-bezos-exit-in-stride-20210203.jpg", "site": "foxbusiness.com", "text": "Amazon Inc. investors, waiting for earnings, got the surprise news that CEO Jeff Bezos plans to step aside.", "url": "https://www.foxbusiness.com/markets/amazon-investors-take-jeff-bezos-exit-in-stride", "publishedDateET": "2021-02-03T05:04:30-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 09:53:05", "publisher": "Forbes", "title": "Why Andy Jassy's Appointment Signals That Cloud, Not E-Commerce, Is Amazon's Future", "image": "https://images.financialmodelingprep.com/news/why-andy-jassys-appointment-signals-that-cloud-not-ecommerce-20210203.jpg", "site": "forbes.com", "text": "Jassy will lead Amazon with an intimate understanding of an industry that hosts much of the world's data and computing power.", "url": "https://www.forbes.com/sites/davidjeans/2021/02/03/andy-jassy-amazon-aws-ceo-cloud-future-jeff-bezos/", "publishedDateET": "2021-02-03T04:53:05-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 09:06:13", "publisher": "Zacks Investment Research", "title": "Pandemic Boosts Spending on Streaming Services: 4 Stocks to Watch", "image": "https://images.financialmodelingprep.com/news/pandemic-boosts-spending-on-streaming-services-4-stocks-to-20210203.jpg", "site": "zacks.com", "text": "From Netflix (NFLX) to Apple's (AAPL) Apple TV to Amazon's (AMZN) Amazon Prime, streaming services have seen a surge in subscribers during the pandemic, which is boosting their revenues.", "url": "https://www.zacks.com/stock/news/1256568/pandemic-boosts-spending-on-streaming-services-4-stocks-to-watch", "publishedDateET": "2021-02-03T04:06:13-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 09:00:00", "publisher": "The Motley Fool", "title": "Amazon's Earnings Demolish Expectations: 5 Metrics You Should See", "image": "https://images.financialmodelingprep.com/news/amazons-earnings-demolish-expectations-5-metrics-you-should-see-20210203.jpg", "site": "fool.com", "text": "In Q4, the e-commerce titan's business continued to get a boost from the pandemic, but investors are probably anxious about Jeff Bezos stepping down as CEO.", "url": "https://www.fool.com/investing/2021/02/03/amazons-earnings-demolish-expectations-5-metrics-y/", "publishedDateET": "2021-02-03T04:00:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 08:49:00", "publisher": "Market Watch", "title": "Amazon's electric delivery vehicles hit the road in L.A.", "image": "https://images.financialmodelingprep.com/news/amazons-electric-delivery-vehicles-hit-the-road-in-la-20210203.jpg", "site": "marketwatch.com", "text": "The vehicles will be in other cities throughout 2021", "url": "https://www.marketwatch.com/story/amazons-electric-delivery-vehicles-hit-the-road-in-l-a-11612360140", "publishedDateET": "2021-02-03T03:49:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 08:00:00", "publisher": "The Motley Fool", "title": "Who Is the Amazon of Real Estate?", "image": "https://images.financialmodelingprep.com/news/who-is-the-amazon-of-real-estate-20210203.jpg", "site": "fool.com", "text": "Hint: It's not Zillow.", "url": "https://www.fool.com/investing/2021/02/03/who-is-the-amazon-of-real-estate/", "publishedDateET": "2021-02-03T03:00:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 07:49:29", "publisher": "Pulse2", "title": "AMZN Stock Price: $5,200 Target (Up From $4,000) By Susquehanna", "image": "https://images.financialmodelingprep.com/news/amzn-stock-price-5200-target-up-from-4000-by-20210203.jpg", "site": "pulse2.com", "text": "Amazon.com, Inc. (NASDAQ: AMZN) has received a price target increase from $4,000 to $5,200 by Susquehanna. These are the details.", "url": "https://pulse2.com/amzn-stock-price-nasdaq-amzn-5200-target-up-from-4000-by-susquehanna/", "publishedDateET": "2021-02-03T02:49:29-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 07:23:16", "publisher": "Market Watch", "title": "Amazon gets first $5,000+ stock price target, and Alphabet gets first $3,000 target", "image": "https://images.financialmodelingprep.com/news/amazon-gets-first-5000-stock-price-target-and-alphabet-20210203.jpg", "site": "marketwatch.com", "text": "Analyst Shyam Patil at Susquehanna is now Wall Street's most bullish on Amazon.com Inc.'s stock, after he raised his price target to $5,200 from $4,000, while reiterating his positive rating, in the wake of the e-commerce giant'srecord fourth-quarter results. Patil is also the most bullish on Google-parent Alphabet Inc. , after he boosted his target by 50% to $3,000 from $2,000.", "url": "https://www.marketwatch.com/story/amazon-gets-first-5000-stock-price-target-and-alphabet-gets-first-3000-target-2021-02-03", "publishedDateET": "2021-02-03T02:23:16-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 06:54:51", "publisher": "CNBC", "title": "Three ways investors can play Big Tech on the back of earnings", "image": "https://images.financialmodelingprep.com/news/three-ways-investors-can-play-big-tech-on-the-20210203.jpg", "site": "cnbc.com", "text": "One Apple supplier could make for a good \"catch-up\" trade to the Big Tech bounce, says Mark Tepper, president and CEO of Strategic Wealth Partners.", "url": "https://www.cnbc.com/2021/02/03/three-ways-investors-can-play-big-tech-on-the-back-of-earnings.html", "publishedDateET": "2021-02-03T01:54:51-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 06:15:58", "publisher": "InvestorPlace", "title": "7 Great Retirement Funds To Consider For Those 50+ and Planning for 2030", "image": "https://images.financialmodelingprep.com/news/7-great-retirement-funds-to-consider-for-those-50-20210203.jpg", "site": "investorplace.com", "text": "If you're in your 50s, now can be a good time to review your investments to be sure you have the best retirement funds for your goals. The post 7 Great Retirement Funds To Consider For Those 50+ and Planning for 2030 appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/02/7-great-retirement-funds-if-you-are-50/", "publishedDateET": "2021-02-03T01:15:58-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 06:14:24", "publisher": "Business Insider", "title": "A single line from Jeff Bezos' first Amazon job ad, posted 27 years ago, tells you everything about his obsession with speed", "image": "https://images.financialmodelingprep.com/news/a-single-line-from-jeff-bezos-first-amazon-job-20210203.jpg", "site": "businessinsider.com", "text": "Amazon's motto may be \"customer obsession,\" but it has another infatuation — speed. Amazon's brand identity has long rested on the promise of getting parcels to customers as quickly as possible. Its CEO Jeff Bezos announced on Tuesday he would be stepping down to take on the role of executive chairman, but it seems unlikely this ethos will change.", "url": "https://www.businessinsider.com/jeff-bezos-first-amazon-job-ad-reveals-obsession-with-speed-2019-7", "publishedDateET": "2021-02-03T01:14:24-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 06:11:00", "publisher": "Barron's", "title": "Tech Leads Global Stocks Higher After Amazon and Google Earnings", "image": "https://images.financialmodelingprep.com/news/tech-leads-global-stocks-higher-after-amazon-and-google-20210203.jpg", "site": "barrons.com", "text": "Global stocks are higher, but it's all about tech stocks after big-name results, with more earnings ahead and ADP employment data in focus for later.", "url": "https://www.barrons.com/articles/tech-leads-global-stocks-higher-after-amazon-and-google-earnings-51612350691", "publishedDateET": "2021-02-03T01:11:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 06:00:01", "publisher": "CNBC", "title": "Amazon is testing Rivian electric delivery vans in Los Angeles", "image": "https://images.financialmodelingprep.com/news/amazon-is-testing-rivian-electric-delivery-vans-in-los-20210203.jpg", "site": "cnbc.com", "text": "In Sept. 2019, Amazon announced it would buy 100,000 electric vehicles from Rivian. Now it's testing them in L.A.", "url": "https://www.cnbc.com/2021/02/03/amazon-is-testing-rivian-electric-delivery-vans-in-los-angeles.html", "publishedDateET": "2021-02-03T01:00:01-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 05:35:17", "publisher": "Huffington Post", "title": "Amazon To Pay $61.7 Million To Settle Charges It Stole Driver Tips", "image": "https://images.financialmodelingprep.com/news/amazon-to-pay-617-million-to-settle-charges-it-20210203.jpg", "site": "huffpost.com", "text": "“In total, Amazon stole nearly one-third of drivers' tips to pad its own bottom line,” Commissioner Rohit Chopra said.", "url": "https://www.huffpost.com/entry/amazon-settle-charges-stole-driver-tips_n_601a797fc5b6c2d891a4a8bb", "publishedDateET": "2021-02-03T00:35:17-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 05:21:29", "publisher": "Forbes", "title": "Why Andy Jassy Is The Right Successor For Jeff Bezos", "image": "https://images.financialmodelingprep.com/news/why-andy-jassy-is-the-right-successor-for-jeff-20210203.jpg", "site": "forbes.com", "text": "Amazon founder and CEO Jeff Bezos is replacing himself with Andy Jassy who runs AWS. The choice of Jassy brings to mind David Glass who successfully followed Walmart founder Sam Walton.", "url": "https://www.forbes.com/sites/petercohan/2021/02/03/why-andy-jassy-is-the-right-successor-for-jeff-bezos/", "publishedDateET": "2021-02-03T00:21:29-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 05:00:56", "publisher": "Business Insider", "title": "Read the memo Amazon's next CEO Andy Jassy sent employees after he was revealed as Jeff Bezos' successor", "image": "https://images.financialmodelingprep.com/news/read-the-memo-amazons-next-ceo-andy-jassy-sent-20210203.jpg", "site": "businessinsider.com", "text": "Amazon Web Services' CEO Andy Jassy sent a memo to employees on Tuesday night, following the news that he would replace Amazon's CEO Jeff Bezos later this year. New York Times journalist Kara Swisher obtained the memo and shared it on Twitter late on Tuesday.", "url": "https://www.businessinsider.com/jeff-bezos-steps-down-andy-jassy-amazon-ceo-employee-memo-2021-2", "publishedDateET": "2021-02-03T00:00:56-05:00"}
{"symbol": "AMZN", "publishedDate": "2021-02-03 05:00:03", "publisher": "The Guardian", "title": "Amazon intensifies 'severe' effort to discourage first-ever US warehouse union", "image": "https://images.financialmodelingprep.com/news/amazon-intensifies-severe-effort-to-discourage-firstever-us-warehouse-20210203.jpg", "site": "theguardian.com", "text": "Movement to unionize workers in Alabama faces tough opposition as the retail giant launches aggressive anti-union drive", "url": "https://www.theguardian.com/technology/2021/feb/03/amazon-intensifies-severe-effort-discourage-first-warehouse-union", "publishedDateET": "2021-02-03T00:00:03-05:00"}
