{"symbol": "AMZN", "publishedDate": "2022-02-03 03:01:00", "publisher": "Business Wire", "title": "Best Buy Selects AWS as Its Strategic Cloud Provider", "image": "https://images.financialmodelingprep.com/news/best-buy-selects-aws-as-its-strategic-cloud-provider-20220203.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Today, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, (NASDAQ: AMZN), announced that Best Buy Co., Inc. (NASDAQ: BBY) has selected AWS as its preferred cloud provider for cloud infrastructure services and its strategic partner for developing cloud engineering talent. This collaboration will help Best Buy further apply cloud technology across its retail operations and support the rapid innovation of its customer experiences and the work of its teams to create world-class digital experiences that can enrich the lives of millions. “Our purpose to enrich lives through technology has never been more important, and this new partnership with AWS is another step in our commitment to deliver outstanding experiences for our customers,” said Brian Tilzer, Chief Digital and Technology Officer of Best Buy Co., Inc. “Not only will AWS’s cloud technologies help us in this work, but in combination with our culture of innovation and reinvention, they will give our teams invaluable development opportunities as we continue to grow our skilled teams and remain one of the best places for amazing technology talent to thrive.” Best Buy—recently named one of Fast Company’s Best Workplaces for Innovators—is known for its culture of innovation and use of technology and analytics to better serve customers, including responding with significant flexibility to external challenges. For example, using advanced cloud technologies, part of which were already supported by AWS, Best Buy was able to deploy an industry-leading curbside pickup experience in just two days at the beginning of the COVID-19 pandemic. Almost two years later, this service continues to allow customers to safely pick up technology products essential to working and learning from home. Using the breadth and depth of AWS Cloud capabilities, Best Buy’s product teams and engineers continue to transform the way people buy technology. By applying AWS compute, storage, database, and security services, Best Buy creates new experiences for its customers, including the ability to interact virtually with experts to receive live demos of physical products. Combining AWS’s advanced cloud technologies with Best Buy’s company-wide agile development model fuels new offerings such as Best Buy’s Totaltech program. Totaltech provides members with access to 24x7 tech expertise delivered via an AWS-powered chatbot and a heightened sense of confidence that their tech support needs can be resolved quickly. “Best Buy is transforming the way people buy technology and is using AWS’s comprehensive set of cloud services to accelerate its innovation. Thousands of retailers like Best Buy continue to trust AWS as their cloud provider of choice because of our ability to help them remain agile and innovate faster to meet the demands of the constantly evolving retail landscape,” said Werner Vogels, Vice President and Chief Technology Officer of Amazon.com, Inc. “Our shared culture of customer obsession and innovation will help us work together to ensure that the cloud will benefit every customer across every aspect of their business.” Through this strategic collaboration with AWS, Best Buy will also accelerate the pace of its cloud migration and implementation of its cloud-first strategy, beginning with moving additional retail operations workloads from on-premises data centers to AWS. Moving forward, Best Buy will expand its use of AWS capabilities and AWS Marketplace, a digital catalog with thousands of software listings from independent software vendors that makes it easy to find, test, buy, and deploy software that runs on AWS, to increase resilience, gain agility, and accelerate innovation. In addition, the collaboration will give Best Buy’s growing teams of skilled technologists access to AWS Training and Certification’s comprehensive cloud training curriculum and resources. These training resources will give Best Buy teams new skills development opportunities and help Best Buy achieve its goal of being one of the best companies to work for, especially for technical talent. Best Buy has committed to hiring 1,000 new employees to its technology team—with 30% of them being diverse, specifically Black, Latinx, Indigenous, and women—and has growing tech and data science hubs in Atlanta, Boston, Seattle, and Minneapolis. About Amazon Web Services For over 15 years, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud offering. AWS has been continually expanding its services to support virtually any cloud workload, and it now has more than 200 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 84 Availability Zones (AZs) within 26 geographic regions, with announced plans for 24 more Availability Zones and eight more AWS Regions in Australia, Canada, India, Israel, New Zealand, Spain, Switzerland, and the United Arab Emirates. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com. About Amazon Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews. About Best Buy Best Buy’s purpose is to enrich lives through technology. Best Buy does that by leveraging its unique combination of tech expertise and human touch to meet its customers’ everyday needs, whether they come to a Best Buy store, BestBuy.com, the Best Buy App or invite us into their homes. For more information, visit corporate.bestbuy.com.", "url": "https://www.businesswire.com/news/home/20220203005266/en/Best-Buy-Selects-AWS-as-Its-Strategic-Cloud-Provider", "publishedDateET": "2022-02-02T22:01:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-03 03:01:00", "publisher": "Business Wire", "title": "Best Buy Selects AWS as Its Strategic Cloud Provider", "image": "https://images.financialmodelingprep.com/news/best-buy-selects-aws-as-its-strategic-cloud-provider-20220203.jpg", "site": "businesswire.com", "text": "SEATTLE--(BUSINESS WIRE)--Today, Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. company, (NASDAQ: AMZN), announced that Best Buy Co., Inc. (NASDAQ: BBY) has selected AWS as its preferred cloud provider for cloud infrastructure services and its strategic partner for developing cloud engineering talent. This collaboration will help Best Buy further apply cloud technology across its retail operations and support the rapid innovation of its customer experiences and the work of its teams to cr", "url": "https://www.businesswire.com/news/home/20220203005266/en/Best-Buy-Selects-AWS-as-Its-Strategic-Cloud-Provider/", "publishedDateET": "2022-02-02T22:01:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 19:06:39", "publisher": "CNET", "title": "More Amazon warehouse workers in New York file for a union election", "image": "https://images.financialmodelingprep.com/news/more-amazon-warehouse-workers-in-new-york-file-for-20220202.jpg", "site": "cnet.com", "text": "It's the second location in Staten Island to make the formal request. A separate election begins in Alabama on Friday.", "url": "https://www.cnet.com/tech/services-and-software/more-amazon-warehouse-workers-in-new-york-file-for-a-union-election/", "publishedDateET": "2022-02-02T14:06:39-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 18:31:50", "publisher": "GeekWire", "title": "Amazon discloses 5% ownership of Aurora, confirms Rivian and Air Transport stakes", "image": "https://images.financialmodelingprep.com/news/amazon-discloses-5-ownership-of-aurora-confirms-rivian-and-20220202.jpg", "site": "geekwire.com", "text": "Amazon says it owns 5.", "url": "https://www.geekwire.com/2022/amazon-discloses-5-ownership-of-aurora-confirms-rivian-and-air-transport-stakes/", "publishedDateET": "2022-02-02T13:31:50-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 15:55:29", "publisher": "Investopedia", "title": "Will Amazon (AMZN) Earnings Follow the Trend?", "image": "https://images.financialmodelingprep.com/news/will-amazon-amzn-earnings-follow-the-trend-20220202.jpg", "site": "investopedia.com", "text": "Ahead of earnings, option traders appear to be positioning themselves for the Amazon share price to fall.", "url": "https://www.investopedia.com/will-amazon-earnings-follow-trend-5217917", "publishedDateET": "2022-02-02T10:55:29-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 14:55:29", "publisher": "Investopedia", "title": "Amazon Earnings: What to Look For", "image": "https://images.financialmodelingprep.com/news/amazon-earnings-what-to-look-for-20220202.jpeg", "site": "investopedia.com", "text": "Amazon (AMZN) reports Q4 earnings after market close on Feb. 3. Can it continue to boost growth in AWS cloud revenue?", "url": "https://www.investopedia.com/amazon-q4-fy2021-earnings-report-preview-5217866", "publishedDateET": "2022-02-02T09:55:29-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 14:46:56", "publisher": "GeekWire", "title": "Amazon facing increasing unionization pressure at two New York warehouse facilities", "image": "https://images.financialmodelingprep.com/news/amazon-facing-increasing-unionization-pressure-at-two-new-york-20220202.jpg", "site": "geekwire.com", "text": "Another Amazon warehouse in New York could be gearing up for a unionization vote.", "url": "https://www.geekwire.com/2022/amazon-facing-increasing-unionization-pressure-at-two-new-york-warehouse-facilities/", "publishedDateET": "2022-02-02T09:46:56-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 14:13:47", "publisher": "CNBC", "title": "Amazon workers at a second Staten Island warehouse file petition for union election", "image": "https://images.financialmodelingprep.com/news/amazon-workers-at-a-second-staten-island-warehouse-file-20220202.jpeg", "site": "cnbc.com", "text": "Amazon Labor Union is now seeking to represent workers at two Amazon warehouses on New York's Staten Island.", "url": "https://www.cnbc.com/2022/02/02/amazon-workers-in-new-york-file-petition-for-union-election.html", "publishedDateET": "2022-02-02T09:13:47-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 12:18:16", "publisher": "Zacks Investment Research", "title": "Will Amazon's (AMZN) Q4 Earnings Benefit From AWS Momentum?", "image": "https://images.financialmodelingprep.com/news/will-amazons-amzn-q4-earnings-benefit-from-aws-momentum-20220202.jpg", "site": "zacks.com", "text": "Amazon's (AMZN) fourth-quarter results are likely to reflect benefits from AWS's expanding customer base, driven by the strengthening services portfolio.", "url": "https://www.zacks.com/stock/news/1861353/will-amazon-s-amzn-q4-earnings-benefit-from-aws-momentum", "publishedDateET": "2022-02-02T07:18:16-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 12:18:14", "publisher": "Zacks Investment Research", "title": "Tuesday Earnings Snapshot & A Chartist's Technical Outlay", "image": "https://images.financialmodelingprep.com/news/tuesday-earnings-snapshot-a-chartists-technical-outlay-20220202.jpg", "site": "zacks.com", "text": "The focus is turning from the implications of a more hawkish central bank and towards the value proposition that the overdone growth-focused sell-off created", "url": "https://www.zacks.com/stock/news/1861324/tuesday-earnings-snapshot-a-chartist-s-technical-outlay", "publishedDateET": "2022-02-02T07:18:14-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 11:35:55", "publisher": "24/7 Wall Street", "title": "3 More Companies That Could Benefit Big From a Stock Split", "image": "https://images.financialmodelingprep.com/news/3-more-companies-that-could-benefit-big-from-a-20220202.jpg", "site": "247wallst.com", "text": "Alphabet Inc. (NASDAQ: GOOGL) is the headline story across the markets on Wednesday, as the company is planning to conduct a 20-for-1 stock split.", "url": "https://247wallst.com/investing/2022/02/02/companies-that-could-benefit-from-a-stock-split-amazon-autozone-chipotle-mexican-grill/", "publishedDateET": "2022-02-02T06:35:55-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 11:00:32", "publisher": "TechCrunch", "title": "Twitch partners with indie music label group Merlin", "image": "https://images.financialmodelingprep.com/news/twitch-partners-with-indie-music-label-group-merlin-20220202.jpeg", "site": "techcrunch.com", "text": "Twitch will strike up a partnership with massive indie label group Merlin, marking the Amazon-owned livestreaming platform's latest effort to get cozy with the recording industry. The deal emphasizes how Merlin's independent artists can leverage Twitch's livestreaming ecosystem and in turn how those artists will bolster Twitch's vision to expand further into content beyond gaming.", "url": "https://techcrunch.com/2022/02/02/twitch-merlin-partnership-music/", "publishedDateET": "2022-02-02T06:00:32-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 10:35:55", "publisher": "24/7 Wall Street", "title": "Earnings Previews: Activision Blizzard, Amazon, Ford, Snap", "image": "https://images.financialmodelingprep.com/news/earnings-previews-activision-blizzard-amazon-ford-snap-20220202.jpg", "site": "247wallst.com", "text": "Quarterly results reported after the closing bell on Tuesday led to sharp changes in several tech stocks.", "url": "https://247wallst.com/investing/2022/02/02/earnings-previews-activision-blizzard-amazon-ford-snap/", "publishedDateET": "2022-02-02T05:35:55-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 09:42:51", "publisher": "PYMNTS", "title": "Amazon Workers in Alabama Prep for Union Bid Vote After Regulator Ordered Second Vote", "image": "https://images.financialmodelingprep.com/news/amazon-workers-in-alabama-prep-for-union-bid-vote-20220202.jpg", "site": "pymnts.com", "text": "More than 6,100 Amazon employees at an Alabama warehouse are set to take their second vote to unionize on Friday (Feb. 4), The Wall Street Journal reported. The National Labor Relations Board (NLRB), an independent federal agency created by Congress to assure fair labor practices, said the votes are due by Friday, March 25.", "url": "https://www.pymnts.com/amazon/2022/amazon-workers-in-alabama-prep-for-second-union-bid-vote/", "publishedDateET": "2022-02-02T04:42:51-05:00"}
{"symbol": "AMZN", "publishedDate": "2022-02-02 08:42:00", "publisher": "The Motley Fool", "title": "Could the Dow Finally Beat the Nasdaq in 2022?", "image": "https://images.financialmodelingprep.com/news/could-the-dow-finally-beat-the-nasdaq-in-2022-20220202.jpg", "site": "fool.com", "text": "A shift from growth stocks to value stocks could help the Dow.", "url": "https://www.fool.com/investing/2022/02/02/could-the-dow-finally-beat-the-nasdaq-in-2022/", "publishedDateET": "2022-02-02T03:42:00-05:00"}
