{"symbol": "AMZN", "publishedDate": "2025-02-06 01:00:00", "publisher": "Barrons", "title": "Amazon Earnings Are Today. Why It's All About AWS.", "image": "https://images.financialmodelingprep.com/news/amazon-earnings-are-today-why-its-all-about-aws-20250206.jpg", "site": "barrons.com", "text": "Wall Street expects Amazon Web Servicesrevenue of $28.8 billion for the quarter, an increase from last year's $24.2 billion.", "url": "https://www.barrons.com/articles/amazon-earnings-stock-price-83b5239a", "publishedDateET": "2025-02-05T20:00:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 19:06:25", "publisher": "PYMNTS", "title": "Amazon and Walmart Focus on Revamping Malls", "image": "https://images.financialmodelingprep.com/news/amazon-and-walmart-focus-on-revamping-malls-20250205.jpg", "site": "pymnts.com", "text": "Walmart is expanding its real estate portfolio with a major acquisition. The retail giant has purchased Monroeville Mall near Pittsburgh for $34 million and plans to redevelop the site.", "url": "https://www.pymnts.com/news/retail/2025/amazon-and-walmart-focus-on-revamping-malls/", "publishedDateET": "2025-02-05T14:06:25-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 18:57:55", "publisher": "Investopedia", "title": "Amazon Earnings May Signal Strong Year Ahead for Retailers—But Risks Abound", "image": "https://images.financialmodelingprep.com/news/amazon-earnings-may-signal-strong-year-ahead-for-retailersbut-risks-20250205.jpg", "site": "investopedia.com", "text": "Amazon will kick off the earnings reporting season for major retailers this week, offering investors a snapshot of consumer spending in the wake of a blockbuster holiday season.", "url": "https://www.investopedia.com/amazon-earnings-could-signal-strong-2025-for-major-retailers-walmart-costco-target-8784749", "publishedDateET": "2025-02-05T13:57:55-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 18:34:31", "publisher": "CNBC", "title": "Trump sued over purge at NLRB, regulator targeted by SpaceX, Amazon and others", "image": "https://images.financialmodelingprep.com/news/trump-sued-over-purge-at-nlrb-regulator-targeted-by-20250205.jpg", "site": "cnbc.com", "text": "Former National Labor Relations Board chair Gwynne Wilcox accused President Donald Trump of effectively shutting down NLRB operations by \"illegally\" firing her. Wilcox, an appointee of Democratic former President Joe Biden, in a federal lawsuit asked a judge to reinstate her as an NLRB member and declare that her firing was unlawful.", "url": "https://www.cnbc.com/2025/02/05/trump-sued-nlrb-spacex-amazon-musk.html", "publishedDateET": "2025-02-05T13:34:31-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 18:15:00", "publisher": "The Motley Fool", "title": "3 Reasons to Buy Amazon Stock Like There's No Tomorrow", "image": "https://images.financialmodelingprep.com/news/3-reasons-to-buy-amazon-stock-like-theres-no-20250205.jpg", "site": "fool.com", "text": "Amazon (AMZN -2.43%) stock is up about 38% over the past year, and even though it's already the second-largest company in the U.S. by sales, it's in an excellent position to keep growing and rewarding shareholders. Here are three reasons why investors can feel confident about Amazon's future and why you might want to add it to your portfolio today.", "url": "https://www.fool.com/investing/2025/02/05/3-reasons-to-buy-amazon-stock-like-theres-no-tomor/", "publishedDateET": "2025-02-05T13:15:00-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 18:09:15", "publisher": "247 Wallst", "title": "Live Markets: GOOGL, AMD, AMZN Weigh on Nasdaq", "image": "https://images.financialmodelingprep.com/news/live-markets-googl-amd-amzn-weigh-on-nasdaq-20250205.jpg", "site": "https://247wallst.com", "text": "Today’s trading reveals technology investors see the glass half empty at the moment. A tech malaise fueled by Google parent Alphabet (Nasdaq: GOOGL) and chipmaker AMD (Nasdaq: AMD) is pressuring the Nasdaq Composite and S&amp;P 500 moderately lower while the Dow Jones Industrial Average is eking out a gain. The tech malaise can be blamed on Alphabet’s steep 8% drop, owing to a revenue shortfall coupled on top of an aggressive AI spending plan that didn’t sit well with Wall Street. AMD stock, a member of the Nasdaq Composite, is currently down 9% as of mid-morning. Amazon (Nasdaq: AMZN) shares are down in sympathy ahead of the company’s earnings report after the closing bell tomorrow. Key Points Tech is weighing on the Nasdaq Composite and S&amp;P 500 while the Dow Jones Industrial Average is eking out modest gains. Google parent Alphabet stock is sinking 8% on aggressive AI capex plans despite a revenue miss. AMD shares are down a steep 9% on weak data center results, but Wall Street says the quarter was “better than feared.” Amazon shares are down in sympathy ahead of the company’s quarterly results on Thursday. Despite selling pressure the S&amp;P 500 is managing to hover above the key 6,000 level, buoyed by stocks like Newmont Mining (NYSE: NEM) with a 4% gain and trucking company Old Dominion Freight Line (Nasdaq: ODFL) with a 6% jump in response to earnings. On the economic front, the economy appears to be humming as the workforce added a higher than expected 183,000 private payrolls in January, fueled by service providers, while wages rose, according to ADP data. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: up 38.57 (+0.09%) Nasdaq Composite: down 78.77 (-0.41%) S&amp;P 500: down 7.76 (-0.13%) Tech Earnings Roundup Alphabet’s Q4 revenue missed consensus estimates while the company has earmarked a whopping $75 billion in AI capex, including the development of data centers, amid fierce competitive headwinds from the U.S. and China. Google’s YouTube was another drag as its ad revenue slowed. AMD’s stock is reeling after its data center revenue failed to meet high expectations. It shows how much AI is running the show, as AMD’s top and bottom lines came in better than expected. Wall Street Moves A slew of analysts responded to AMD’s earnings print. Among them, Citi described AMD’s results as “decent” but lacking on AI revenue guidance. Goldman Sachs analysts called the results “better than feared” while the data center performance fell short. As for Alphabet, Goldman Sachs maintains a “buy” rating with a $220 price target, while BofA said, “Street could be underestimating AI Overview benefits for Search monetization in 2025.” Grab Holdings (Nasdaq: GRAB) is down 6% on the heels of a JPMorgan analyst downgrade to a “neutral” rating from “overweight” with a $5.60 price target, saying they are looking to better entry levels on the stock. The post Live Markets: GOOGL, AMD, AMZN Weigh on Nasdaq appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/02/05/live-markets-googl-amd-amzn-weigh-on-nasdaq/", "publishedDateET": "2025-02-05T13:09:15-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 18:09:15", "publisher": "247 Wallst", "title": "Finally! Shake Shack Is Expanding Into These 10 Areas", "image": "https://images.financialmodelingprep.com/news/finally-shake-shack-is-expanding-into-these-10-areas-20250205.jpg", "site": "https://247wallst.com", "text": "As one of the most popular burger chains in America, not named McDonald’s, Shake Shack has its sights set on expansion in a big way. In January 2025, the company announced its plans to operate “at least” 1,500 restaurants in the long term, a whopping 356% increase in the number of restaurants it has today. Key Points Shake Shack is already a fast-food favorite, even though it only has 329 locations. You can’t visit a Shake Shack location without trying out one of its famous milkshakes. Whether you try the regular or curly fries, you’re in for a treat. 4 million Americans are set to retire this year. If you want to join them, click here now to see if you’re behind, or ahead. It only takes a minute. (Sponsor) This means there will be a massive expansion for this beloved chain with its excellent french fries, burgers, and milkshakes. At the end of 2024, Shake Shack only had 329 restaurants as part of its US footprint, so there is no question it’s setting its sights on becoming a formidable force for fast food in various markets around the country. 15. Why People Love Shake Shack Shake Shack has won over its fans time and time again. The biggest question anyone should be asking is why Shake Shack is so beloved that it plans to open over 1,500 new locations in the near future successfully. First and foremost, the chain is known for its high-quality, gourmet-style burgers that use 100% Angus beef. Coupled with outstanding milkshakes and french fries, there’s something that feels tastier and more upscale than McDonald’s. 14. Specific Things To Enjoy At Shake Shack The most important thing to try is the company’s secret sauce. First and foremost, you can’t stop at Shake Shack without trying out the brand’s “Shacksauce” secret sauce. Described as being “creamy and tangy,” this is something fans of this restaurant love more than anything else. The same can be said for its crinkle-cut fries, which saw fans revolt online the last time the restaurant tried to take them off the menu. 13. Is Shake Shack Overrated? Any questions about Shake Shack being overrated should be shut down. With all this conversation around new store openings, the question becomes whether Shake Shack is overrated. Some people may find the hype too much, so it’s easy to be let down. However, the reality is that most online reviews point out little things, such as the burgers being smaller than anticipated. Still, the overall verdict always points to the milkshakes and fries making any trip worthwhile. 12. The Best Milkshakes Going to Shake Shack and not getting a milkshake is wrong. You can point to many reasons to visit a Shake Shack, but none is more important than stopping by to grab a Brownie Batter Hot Cocoa shake, a personal favorite. Of course, you have standards like chocolate, vanilla, and strawberry, but you haven’t lived until you have tried the Thai Iced Tea Shake or the Cherry Blossom Shake. 11. Six-Point Plan The company CEO has a six-point plan to grow the brand. As part of the company’s efforts to open up new stores in 2025 and beyond, Shake Shack has introduced a six-point strategy, according to CEO Rob Lynch. This includes 1) Bolstering its leadership, 2) Optimizing restaurant operations, 3) Driving comp sales by boosting the frequency of returning guests, 4) Building and operating Shake Shack with “best-in-class returns,” 5) Accelerating its licensed business, 6) Investing in long-term strategic capabilities. 10. Sterling, Virginia Get ready Sterling, Virginia as a new location is coming soon. Anticipated opening date: February/March 2025 The newest Shake Shack location arriving in the US will occupy a 3,000-square-foot space previously occupied by a McDonald’s. Located at 21000 Southbank St., the area will open as part of the Cascades Marketplace shopping center. 9. Short Pump, Virginia Anticipated opening date: 2025 Short Pump, Virginia, should be excited for its newest location. Scheduled to arrive as part of a mixed-use development including 100 condominiums, the newest Shake Shack in the Richmond area will be ready sometime in 2025. This marks the third location in Richmond as the company looks to dominate up and down the East Coast. 8. Cincinnati, Ohio University students will soon have one more fast food option available. Anticipated opening date: Late 2025 Opening toward the end of 2025 near the University of Cincinnati at 259 Calhoun Street, the newest Shake Shake is ready to cater to university students galore. Centrally located near University Square, there is every reason to believe this location will be a bona fide hit. 7. Charlotte, North Carolina Charlotte is ready for its next Shake Shack location to arrive. Anticipated opening date: Late 2025 Charlotte, North Carolina residents better prepare as a new Shake Shack is coming to the Charlotte Premium Outlets near the Saks Off 5th Avenue entrance. This is the perfect combination of shopping and milkshakes for residents of the area. 6. Mount Kisco, New York Get ready, Mount Kisco. Your next Shake Shack is almost here. Anticipated opening date: Summer 2025 Arriving in Mount Kisco, New York, in 2025, this new Shake Shack is set to open at 176 N. Bedford Road. The space, formerly occupied by Dunkin’ Donuts, will be the company’s first in Westchester, New York. 5. Long Island, New York Long Island will soon be home to the first Shake Shack drive-through. Anticipated opening date: Late 2025 Get ready, Long Island, New York, as a new Shake Shack is coming in 2025, and this time, it’s arriving with a drive-through. Shake Shack had to receive special permits to open up this location at the corner of Blue Point and Middle Country roads. 4. Holbrook, New York Crumbl cookies and Shake Shack are the perfect combination of dining. Anticipated opening date: Late 2025 A new Shake Shack is coming along with the opening of a new shopping center on Sunrise Highway in The Shops at SunVet in Holbrook. The chain is set to be located near Crumbl Cookies, Whole Foods, Nordstrom Rack, Sephora, and other popular shopping destinations. 3. Atlanta, Georgia Sorry, Wahlburgers, a new Atlanta burger spot, is ready to take over. Anticipated opening date: 2025 Shake Shack is surprisingly replacing an outgoing Wahlburgers location at Heritage Court and Battery Ave. Along with eight other Shake Shack locations in the Atlanta area, this location will be the first restaurant among any of the company’s locations in the US to have a bar. 2. Naples, Florida This Naples location will be Florida’s 21st Shake Shack. Anticipated opening date: TBD (sometime in 2025) A new Shake Shack at 9105 Strada Place will become the 21st Florida location. While the company’s efforts have been concentrated in the tri-county and Orlando areas, this marks the chain’s first attempt to dominate the west coast of Florida. 1. Elk Grove, California Another Shake Shack is getting ready to battle In-And-Out in California. Anticipated opening date: End of 2025, early 2026 The fourth Shake Shack location is a highly anticipated option that will arrive before the end of the year at the intersection of Big Horn Blvd and Wymark Drive. While the shopping center is still under construction, the hope is that it will take less than a year for this new Elk Grove, California, location to open. The post Finally! Shake Shack Is Expanding Into These 10 Areas appeared first on 24/7 Wall St..", "url": "https://247wallst.com/food/2025/02/05/finally-shake-shack-is-expanding-into-these-10-areas/", "publishedDateET": "2025-02-05T13:09:15-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 17:21:44", "publisher": "24/7 Wall Street", "title": "3 Top Tech Stocks to Buy in February", "image": "https://images.financialmodelingprep.com/news/3-top-tech-stocks-to-buy-in-february-20250205.jpg", "site": "247wallst.com", "text": "The technology sector is projected to experience significant growth in 2025, with worldwide IT spending expected to reach approximately", "url": "https://247wallst.com/investing/2025/02/05/3-top-tech-stocks-to-buy-in-february/", "publishedDateET": "2025-02-05T12:21:44-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 17:04:12", "publisher": "PYMNTS", "title": "Report: Amazon to Introduce GenAI-Powered Alexa on Feb. 26", "image": "https://images.financialmodelingprep.com/news/report-amazon-to-introduce-genaipowered-alexa-on-feb-26-20250205.jpg", "site": "pymnts.com", "text": "Amazon is reportedly set to introduce a new, generative artificial intelligence (AI)-powered version of its Alexa voice assistant. The company sent out invitations to a Feb. 26 event featuring the head of its devices and services team, Panos Panay, and the event is expected to preview the new Alexa, Reuters reported Wednesday (Feb. 5), citing unnamed sources.", "url": "https://www.pymnts.com/amazon/2025/report-amazon-to-introduce-genai-powered-alexa-on-feb-26/", "publishedDateET": "2025-02-05T12:04:12-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 16:33:43", "publisher": "Bloomberg Technology", "title": "Amazon's War on Worker Bloat", "image": "https://images.financialmodelingprep.com/news/amazons-war-on-worker-bloat-20250205.jpg", "site": "youtube.com", "text": "Amazon's efforts to slash middle management workers is sending ripples across the company and impacting morale, while Wall Street sees it as a positive signal. Bloomberg's Spencer Soper joins Caroline Hyde and Jackie Davalos on \"Bloomberg Technology\" to discuss.", "url": "https://www.youtube.com/watch?v=3LKge7TaudE", "publishedDateET": "2025-02-05T11:33:43-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 16:11:01", "publisher": "PYMNTS", "title": "Report: Amazon Employees Say Restructuring Leaves Fewer Opportunities to Advance", "image": "https://images.financialmodelingprep.com/news/report-amazon-employees-say-restructuring-leaves-fewer-opportunities-to-20250205.jpg", "site": "pymnts.com", "text": "Amazon's efforts to restructure its workforce have reportedly left staffers with fewer opportunities to move up the corporate ladder. These concerns result from Amazon CEO Andy Jassy's plan to reduce the company's middle management ranks and free up funds for its investments in data centers and artificial intelligence, Bloomberg reported Wednesday (Feb. 5).", "url": "https://www.pymnts.com/amazon/2025/report-amazon-employees-say-restructuring-leaves-fewer-opportunities-to-advance/", "publishedDateET": "2025-02-05T11:11:01-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 14:46:05", "publisher": "CNBC", "title": "Amazon announces hardware event for Feb. 26 as it races to release new Alexa", "image": "https://images.financialmodelingprep.com/news/amazon-announces-hardware-event-for-feb-26-as-it-20250205.jpg", "site": "cnbc.com", "text": "Amazon will host a hardware event in New York City on Feb. 26. A company spokesperson confirmed the event will include news from its Alexa team.", "url": "https://www.cnbc.com/2025/02/05/amazon-announces-february-event-as-it-races-to-release-new-alexa.html", "publishedDateET": "2025-02-05T09:46:05-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 14:44:03", "publisher": "24/7 Wall Street", "title": "Institutions Just Bet $2.6 Million on Amazon Upside", "image": "https://images.financialmodelingprep.com/news/institutions-just-bet-26-million-on-amazon-upside-20250205.jpg", "site": "247wallst.com", "text": "Investors should keep an eye on Amazon (NASDAQ:AMZN). Just recently, an institution picked up $1.33 million worth of the AMZN March 21, 2025 calls. Another picked up $1.31 million worth of those same call options.", "url": "https://247wallst.com/investing/2025/02/05/institutions-just-bet-2-6-million-on-amazon-upside/", "publishedDateET": "2025-02-05T09:44:03-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 13:42:46", "publisher": "Reuters", "title": "Exclusive: Amazon set to release long-delayed Alexa generative AI revamp", "image": "https://images.financialmodelingprep.com/news/exclusive-amazon-set-to-release-longdelayed-alexa-generative-ai-20250205.jpg", "site": "reuters.com", "text": "Amazon is set to release its long-awaited - and delayed - Alexa generative artificial intelligence voice service, said three people familiar with the matter, and has scheduled a press event for later this month to preview it.", "url": "https://www.reuters.com/technology/amazon-set-release-long-delayed-alexa-generative-ai-revamp-2025-02-05/", "publishedDateET": "2025-02-05T08:42:46-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 13:32:53", "publisher": "GeekWire", "title": "Amazon earnings preview: AWS cloud growth, AI demand, trade wars among key issues to watch", "image": "https://images.financialmodelingprep.com/news/amazon-earnings-preview-aws-cloud-growth-ai-demand-trade-20250205.jpg", "site": "geekwire.com", "text": "Amazon's cloud growth rate has been increasing steadily in recent quarters, and investors are looking for the trend to continue when the company reports earnings Thursday for the December quarter and 2024 fiscal year.", "url": "https://www.geekwire.com/2025/amazon-earnings-preview-aws-cloud-growth-ai-demand-trade-wars-among-key-issues-to-watch/", "publishedDateET": "2025-02-05T08:32:53-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 12:19:42", "publisher": "24/7 Wall Street", "title": "Could AMZN Stock Drop 5% After Feb. 6?", "image": "https://images.financialmodelingprep.com/news/could-amzn-stock-drop-5-after-feb-6-20250205.jpg", "site": "247wallst.com", "text": "There's perhaps no bigger or more important stock left on the earnings docket this quarter than Amazon (NASDAQ:AMZN), which is set to report its earnings on February 6.", "url": "https://247wallst.com/investing/2025/02/05/could-amzn-stock-drop-5-after-feb-6/", "publishedDateET": "2025-02-05T07:19:42-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 11:45:34", "publisher": "Zacks Investment Research", "title": "Are Amazon ETFs a Buy Ahead of Q4 Earnings?", "image": "https://images.financialmodelingprep.com/news/are-amazon-etfs-a-buy-ahead-of-q4-earnings-20250205.jpg", "site": "zacks.com", "text": "Amazon soars to new all-time highs ahead of fourth-quarter earnings and sees positive earnings revision activity, which is generally a precursor to an earnings beat.", "url": "https://www.zacks.com/stock/news/2410253/are-amazon-etfs-a-buy-ahead-of-q4-earnings?cid=CS-STOCKNEWSAPI-FT-etf_news_and_commentary-2410253", "publishedDateET": "2025-02-05T06:45:34-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 11:22:49", "publisher": "247 Wallst", "title": "Live Markets: GOOGL, AMD, AMZN Weigh on Nasdaq", "image": "https://images.financialmodelingprep.com/news/live-markets-googl-amd-amzn-weigh-on-nasdaq-20250205.jpg", "site": "https://247wallst.com", "text": "Today’s trading reveals technology investors see the glass half empty at the moment. A tech malaise fueled by Google parent Alphabet (Nasdaq: GOOGL) and chipmaker AMD (Nasdaq: AMD) is pressuring the Nasdaq Composite and S&amp;P 500 moderately lower while the Dow Jones Industrial Average is eking out a gain. The tech malaise can be blamed on Alphabet’s steep 8% drop, owing to a revenue shortfall coupled on top of an aggressive AI spending plan that didn’t sit well with Wall Street. AMD stock, a member of the Nasdaq Composite, is currently down 9% as of mid-morning. Amazon (Nasdaq: AMZN) shares are down in sympathy ahead of the company’s earnings report after the closing bell tomorrow. Key Points Tech is weighing on the Nasdaq Composite and S&amp;P 500 while the Dow Jones Industrial Average is eking out modest gains. Google parent Alphabet stock is sinking 8% on aggressive AI capex plans despite a revenue miss. AMD shares are down a steep 9% on weak data center results, but Wall Street says the quarter was “better than feared.” Amazon shares are down in sympathy ahead of the company’s quarterly results on Thursday. Despite selling pressure the S&amp;P 500 is managing to hover above the key 6,000 level, buoyed by stocks like Newmont Mining (NYSE: NEM) with a 4% gain and trucking company Old Dominion Freight Line (Nasdaq: ODFL) with a 6% jump in response to earnings. On the economic front, the economy appears to be humming as the workforce added a higher than expected 183,000 private payrolls in January, fueled by service providers, while wages rose, according to ADP data. Here’s a look at the performance as of morning trading: Dow Jones Industrial Average: up 38.57 (+0.09%) Nasdaq Composite: down 78.77 (-0.41%) S&amp;P 500: down 7.76 (-0.13%) Tech Earnings Roundup Alphabet’s Q4 revenue missed consensus estimates while the company has earmarked a whopping $75 billion in AI capex, including the development of data centers, amid fierce competitive headwinds from the U.S. and China. Google’s YouTube was another drag as its ad revenue slowed. AMD’s stock is reeling after its data center revenue failed to meet high expectations. It shows how much AI is running the show, as AMD’s top and bottom lines came in better than expected. Wall Street Moves A slew of analysts responded to AMD’s earnings print. Among them, Citi described AMD’s results as “decent” but lacking on AI revenue guidance. Goldman Sachs analysts called the results “better than feared” while the data center performance fell short. As for Alphabet, Goldman Sachs maintains a “buy” rating with a $220 price target, while BofA said, “Street could be underestimating AI Overview benefits for Search monetization in 2025.” Grab Holdings (Nasdaq: GRAB) is down 6% on the heels of a JPMorgan analyst downgrade to a “neutral” rating from “overweight” with a $5.60 price target, saying they are looking to better entry levels on the stock. The post Live Markets: GOOGL, AMD, AMZN Weigh on Nasdaq appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/02/05/live-markets-googl-amd-amzn-weigh-on-nasdaq/", "publishedDateET": "2025-02-05T06:22:49-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 11:18:50", "publisher": "CNBC Television", "title": "Disney or Amazon could be contenders for second place behind Netflix, says Loop Capital's Alan Gould", "image": "https://images.financialmodelingprep.com/news/disney-or-amazon-could-be-contenders-for-second-place-20250205.jpg", "site": "youtube.com", "text": "Alan Gould, analyst at Loop Capital, joins CNBC's 'Squawk on the Street' to discuss reactions to Disney's earnings.", "url": "https://www.youtube.com/watch?v=XbNHcqUtPSk", "publishedDateET": "2025-02-05T06:18:50-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 10:36:46", "publisher": "Reuters", "title": "Amazon's cloud business faces crucial test after rivals Microsoft, Google stumble", "image": "https://images.financialmodelingprep.com/news/amazons-cloud-business-faces-crucial-test-after-rivals-microsoft-20250205.jpg", "site": "reuters.com", "text": "The pressure is on Amazon.com to deliver on lofty expectations for cloud computing in its fourth-quarter results on Thursday, after Microsoft and Google's lackluster reports jolted investor faith in Big Tech's billion-dollar investments in AI.", "url": "https://www.reuters.com/technology/amazons-cloud-business-faces-crucial-test-after-rivals-microsoft-google-stumble-2025-02-05/", "publishedDateET": "2025-02-05T05:36:46-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 10:21:31", "publisher": "Zacks Investment Research", "title": "Will Amazon's Q4 Earnings Benefit From Healthy AWS Momentum?", "image": "https://images.financialmodelingprep.com/news/will-amazons-q4-earnings-benefit-from-healthy-aws-momentum-20250205.jpg", "site": "zacks.com", "text": "AMZN's fourth-quarter results are expected to reflect steady gains from AWS momentum, driven by growing generative AI capabilities through Amazon Bedrock.", "url": "https://www.zacks.com/stock/news/2410001/will-amazon-s-q4-earnings-benefit-from-healthy-aws-momentum?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_preview-2410001", "publishedDateET": "2025-02-05T05:21:31-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 08:54:26", "publisher": "Benzinga", "title": "JPMorgan Picks Winners, Losers After DeepSeek Debut: How Alphabet, Amazon, Intel And Oracle Rank", "image": "https://images.financialmodelingprep.com/news/jpmorgan-picks-winners-losers-after-deepseek-debut-how-alphabet-20250205.jpg", "site": "benzinga.com", "text": "JPMorgan analysts Claudia Hueston and Pedro Martins just dropped a major AI ripple effect report, and the verdict is clear: DeepSeek's latest LLM is shaking up the tech hierarchy.", "url": "https://www.benzinga.com/analyst-ratings/analyst-color/25/02/43494592/jpmorgan-picks-winners-losers-after-deepseek-debut-how-alphabet-amazon-intel-and-or", "publishedDateET": "2025-02-05T03:54:26-05:00"}
{"symbol": "AMZN", "publishedDate": "2025-02-05 06:04:00", "publisher": "Barrons", "title": "USPS Suspends Parcels From China. Amazon, Temu Owner PDD and Alibaba Stocks Fall.", "image": "https://images.financialmodelingprep.com/news/usps-suspends-parcels-from-china-amazon-temu-owner-pdd-20250205.jpg", "site": "barrons.com", "text": "Shares in e-commerce companies slide as the trade war between Washington and Beijing heats up.", "url": "https://www.barrons.com/articles/pdd-temu-alibaba-jd-china-usps-51fc555f", "publishedDateET": "2025-02-05T01:04:00-05:00"}
