{"symbol": "MA", "publishedDate": "2021-07-15 06:33:00", "publisher": "The Motley Fool", "title": "The First Stock I'm Going to Buy in the Next Stock Market Correction", "image": "https://images.financialmodelingprep.com/news/the-first-stock-im-going-to-buy-in-the-20210715.jpg", "site": "fool.com", "text": "The company has several tailwinds, but it's being priced like a different business since the pandemic began.", "url": "https://www.fool.com/investing/2021/07/15/stock-im-going-to-buy-in-stock-market-correction/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-15T06:33:00-04:00", "date_et": "2021-07-15"}
{"symbol": "MA", "publishedDate": "2021-07-15 06:35:38", "publisher": "CNN", "title": "Mastercard has been banned from issuing new cards in India", "image": "https://images.financialmodelingprep.com/news/mastercard-has-been-banned-from-issuing-new-cards-in-20210715.jpg", "site": "cnn.com", "text": "Mastercard has been ordered to stop taking new customers in India, as authorities there say it violated the country's rules on how data should be stored.", "url": "https://www.cnn.com/2021/07/15/business/mastercard-india-rbi-intl-hnk/index.html", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-15T06:35:38-04:00", "date_et": "2021-07-15"}
{"symbol": "MA", "publishedDate": "2021-07-15 13:53:26", "publisher": "Zacks Investment Research", "title": "Will MasterCard (MA) Beat Estimates Again in Its Next Earnings Report?", "image": "https://images.financialmodelingprep.com/news/will-mastercard-ma-beat-estimates-again-in-its-next-earnings-20210715.jpg", "site": "zacks.com", "text": "MasterCard (MA) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.", "url": "https://www.zacks.com/stock/news/1762245/will-mastercard-ma-beat-estimates-again-in-its-next-earnings-report", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-15T13:53:26-04:00", "date_et": "2021-07-15"}
{"symbol": "MA", "publishedDate": "2021-07-16 03:08:24", "publisher": "Seeking Alpha", "title": "Buffett 46 July Holdings Include 28 Dividend Payers", "image": "https://images.financialmodelingprep.com/news/buffett-46-july-holdings-include-28-dividend-payers-20210716.jpg", "site": "seekingalpha.com", "text": "This Buffett holdings list from Kiplinger first appeared 5/17/21 on line. YCharts and Dogs of The Dow also track this Buffett/Berkshire Batch. Here is your update from 7/13/21 YCharts data. 8 of 46 current Berkshire Hathaway owned stocks pay dividends. As of 7/13/21 the top ten ranged 2.72%-5.16% by annual yield and ranged 19.87%-67.17% per broker estimated price target upsides.", "url": "https://seekingalpha.com/article/4439478-buffett-46-july-holdings-include-28-dividend-payers", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-16T03:08:24-04:00", "date_et": "2021-07-16"}
{"symbol": "MA", "publishedDate": "2021-07-16 10:25:52", "publisher": "PYMNTS", "title": "Mastercard Introduces Real-Time Payments Gateway PayPort+", "image": "https://images.financialmodelingprep.com/news/mastercard-introduces-realtime-payments-gateway-payport-20210716.jpg", "site": "pymnts.com", "text": "Mastercard is rolling out PayPort+, a next-generation real-time payments gateway, powered by Vocalink and technology partner Form3. The new solution offers easy entry into the U.K.'s real-time payments infrastructure for financial institutions (FIs) and payment service providers (PSP).", "url": "https://www.pymnts.com/news/payment-methods/2021/mastercard-introduces-real-time-payments-gateway-payport/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-16T10:25:52-04:00", "date_et": "2021-07-16"}
{"symbol": "MA", "publishedDate": "2021-07-16 19:14:34", "publisher": "Zacks Investment Research", "title": "MasterCard (MA) Dips More Than Broader Markets: What You Should Know", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-dips-more-than-broader-markets-what-you-should-20210716.jpg", "site": "zacks.com", "text": "MasterCard (MA) closed the most recent trading day at $387.12, moving -0.8% from the previous trading session.", "url": "https://www.zacks.com/stock/news/1763044/mastercard-ma-dips-more-than-broader-markets-what-you-should-know", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-16T19:14:34-04:00", "date_et": "2021-07-16"}
{"symbol": "MA", "publishedDate": "2021-07-20 07:00:00", "publisher": "Business Wire", "title": "Mastercard Creates Simplified Payments Card Offering for Cryptocurrency Companies", "image": "https://images.financialmodelingprep.com/news/mastercard-creates-simplified-payments-card-offering-for-cryptocurrency-companies-20210720.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard announced today it will enhance its card program for cryptocurrency wallets and exchanges, making it simpler for partners to convert cryptocurrency to traditional fiat currency. Working with Evolve Bank & Trust and Paxos Trust Company, the leading blockchain infrastructure and regulated stablecoin issuance platform, and Circle, a global financial technology firm and the principal operator of the USD Coin (USDC), a dollar digital currency or stablecoin, Mastercard and its partners will test this new capability to enable more banks and crypto companies to offer a card option to people wanting to spend their digital assets anywhere Mastercard is accepted. Today, when people spend cryptocurrency such as Bitcoin, Bitcoin Cash, Ether, or Litecoin, it must enter and settle on Mastercard’s network as traditional fiat currency, such as the U.S. dollar. Until now, crypto providers planning to launch or expand card programs could find it operationally challenging to perform the currency conversion, a critical step preceding the settlement on Mastercard’s network. Mastercard’s engagement with Evolve, Paxos and Circle solves this challenge for players across the industry. Mastercard announced in February 2021 it is preparing to enable select stablecoins directly on its network, expanding the future potential of digital assets and payments. Today’s news, enhancing the experience for cryptocurrency exchanges, is a critical step in expanding the ecosystem and safely, securely and compliantly setting the stage for the future of crypto payments. Raj Dhamodharan, executive vice president of digital asset and blockchain products & partnerships at Mastercard, commented: “Today not all crypto companies have the foundational infrastructure to convert cryptocurrency to traditional fiat currency, and we’re making it easier. Through our engagement with Evolve, Paxos, Circle and the larger digital assets community, Mastercard expects to deliver on our promise of consumer choice to provide options to people around the world on how and when to pay.” The enhancement to Mastercard’s existing Crypto Card Program includes a suite of partners. Mastercard is in discussions with Evolve Bank & Trust and Metropolitan Commercial Bank to issue cards, Uphold and BitPay to provide real-time crypto wallet technology, and i2c Inc., Apto Payments and Galileo Financial Technologies® to support processing and program management. With this enhancement to Mastercard’s Crypto Card Program, Paxos and Circle will use their platforms to facilitate the conversion of crypto to fiat through fiat-backed stablecoins, a class of cryptocurrency that offers price stability and is backed by reserve assets. Making the process simpler will allow more banks and crypto partners the opportunity to offer their consumers the choice of paying with cryptocurrency. Hear from Our Partners “As pioneers in crypto-backed debit card issuance, we are absolutely thrilled to see the level of investment that Mastercard and all the associated partners are demonstrating for innovative products,” said Apto Payments CEO Meg Nakamura. “BitPay believes the future of payments is on the blockchain because it transforms how consumers send, receive, and store money around the world,” said Stephen Pair, co-founder and CEO of BitPay. “Working with Mastercard’s pilot to turn digital assets into dollars for everyday spending will accelerate consumers’ use of crypto as a means of commerce.” Dante Disparte, Chief Strategy Officer and Head of Global Policy at Circle, commented: “The collaboration between Circle and Mastercard demonstrates that dollar digital currencies like USDC play a foundational role in making payments more efficient and can facilitate new economic activity for businesses worldwide.” “We are thrilled to be partnering with Mastercard and other leaders to evolve the payments landscape,” said Scot Lenoir, chairman of Evolve. “Evolve is a known leader that supports all forms of stored value and money movement for our diverse array of fintech customers. To support the tremendous consumer and business adoption of digital currencies over the last few years, we see settlement via USDC and other stablecoins as our next step in our journey to continue to modernize banking for all.” \"Galileo is excited to partner with Mastercard to simplify payments and provide the modern API technology that enables a seamless cryptocurrency conversion process of new currencies and coins to fiat currency and U.S. stablecoins,” said Derek White, CEO Galileo Financial Technologies. \"As one of the world's leading issuer-processors powering millions of active crypto-backed cards globally, i2c couldn't be more enthusiastic or honored to be counted as a key Mastercard partner for crypto,\" said Jim McCarthy, president, i2c Inc. \"We look forward to helping visionary crypto companies bring their card programs to market quickly through a single global platform, offering product diversity, robust applications, services, scale and unprecedented reliability.\" \"Metropolitan Commercial Bank is proud to be named a key partner with Mastercard and its plan to enhance its existing Crypto Card Program,” said Nick Rosenberg, executive vice president and head of Global Payments at Metropolitan Commercial Bank. \"We are excited to join Mastercard in making it simpler to convert cryptocurrency to traditional fiat currency.\" Charles Cascarilla, CEO and co-founder of Paxos, added, “Paxos builds the underlying technology that will usher in an open digital economy. Our stablecoins are trusted, regulated and always fully backed one-to-one by U.S. dollars. We can facilitate instant settlement for transactions on a 24/7 basis, 365 days a year. By partnering with Mastercard, we'll bring the benefits of crypto and blockchain to the everyday lives of consumers globally.” JP Thieriot, CEO of Uphold, said: “We’re thrilled to be working with Mastercard to advance the payments landscape and enable next generation transactionality for consumers and merchants alike. Removing friction and barriers to entry is critical to ensure the wide adoption of digital payments, and Mastercard is in position to lead the way.” About Mastercard (NYSE:MA): Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20210720005413/en/Mastercard-Creates-Simplified-Payments-Card-Offering-for-Cryptocurrency-Companies", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-20T07:00:00-04:00", "date_et": "2021-07-20"}
{"symbol": "MA", "publishedDate": "2021-07-20 10:53:24", "publisher": "Zacks Investment Research", "title": "Delta Variant Pulls Back Payment Stocks: Should You Worry?", "image": "https://images.financialmodelingprep.com/news/delta-variant-pulls-back-payment-stocks-should-you-worry-20210720.jpg", "site": "zacks.com", "text": "The recent spike in COVID-19 Delta variant cases and the consequent restriction on travel drag payment stocks.", "url": "https://www.zacks.com/stock/news/1764085/delta-variant-pulls-back-payment-stocks-should-you-worry", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-20T10:53:24-04:00", "date_et": "2021-07-20"}
{"symbol": "MA", "publishedDate": "2021-07-20 13:10:18", "publisher": "PYMNTS", "title": "Mastercard To Help Cardholders Spend Crypto By Easing Conversions To Fiat", "image": "https://images.financialmodelingprep.com/news/mastercard-to-help-cardholders-spend-crypto-by-easing-conversions-20210720.jpg", "site": "pymnts.com", "text": "Mastercard plans to bolster its card program for digital currency wallets and exchanges by streamlining the way partners change digital currency into fiat currency. The firm and its partners will pilot this new functionality by working with Circle, Paxos Trust Company and Evolve Bank & Trust, according to a Tuesday (July 20) announcement.", "url": "https://www.pymnts.com/mastercard/2021/mastercard-to-help-cardholders-spend-crypto-by-easing-conversions-to-fiat/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-20T13:10:18-04:00", "date_et": "2021-07-20"}
{"symbol": "MA", "publishedDate": "2021-07-20 14:17:29", "publisher": "InvestorPlace", "title": "MA Stock Takes Off As Mastercard Teams Up With Circle to Help People Spend Their Crypto", "image": "https://images.financialmodelingprep.com/news/ma-stock-takes-off-as-mastercard-teams-up-with-20210720.jpg", "site": "investorplace.com", "text": "Today, investors in MA stock are seeing impressive gains as the payments processing company announced a crypto pilot project. The post MA Stock Takes Off As Mastercard Teams Up With Circle to Help People Spend Their Crypto appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/07/ma-stock-takes-off-as-mastercard-teams-up-with-circle-to-help-people-spend-their-crypto/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-20T14:17:29-04:00", "date_et": "2021-07-20"}
{"symbol": "MA", "publishedDate": "2021-07-21 10:50:14", "publisher": "Zacks Investment Research", "title": "Mastercard (MA) Ties Up to Enhance Crypto Card Payments", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-ties-up-to-enhance-crypto-card-payments-20210721.jpg", "site": "zacks.com", "text": "Mastercard (MA) collaborates with some crypto companies in a bid to unveil a card offering and offer seamless cryptocurrency conversion, thereby broadening the crypto ecosystem.", "url": "https://www.zacks.com/stock/news/1765030/mastercard-ma-ties-up-to-enhance-crypto-card-payments", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-21T10:50:14-04:00", "date_et": "2021-07-21"}
{"symbol": "MA", "publishedDate": "2021-07-21 20:05:19", "publisher": "PYMNTS", "title": "Mastercard's Finicity Teams With Green Dot To Advance Data Access", "image": "https://images.financialmodelingprep.com/news/mastercards-finicity-teams-with-green-dot-to-advance-data-20210721.jpg", "site": "pymnts.com", "text": "Open banking platform Finicity, a Mastercard company, signed a data access agreement with the digital banking platform Green Dot.  Finicity CEO Steve Smith said in a press release on Wednesday (July 21) that the collaboration with Green Dot is “next in our data access agreements lineup,” and the companies align in offering “greater transparency to […]", "url": "https://www.pymnts.com/data/2021/mastercards-finicity-teams-with-green-dot-to-advance-data-access/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-21T20:05:19-04:00", "date_et": "2021-07-21"}
{"symbol": "MA", "publishedDate": "2021-07-23 13:49:07", "publisher": "Zacks Investment Research", "title": "Will Higher Consumer Spend Aid Mastercard's (MA) Q2 Earnings?", "image": "https://images.financialmodelingprep.com/news/will-higher-consumer-spend-aid-mastercards-ma-q2-earnings-20210723.jpg", "site": "zacks.com", "text": "Solid consumer spending spurred shoppers to use Mastercard's (MA) branded-cards, which in turn, will likely aid its Q2 results.", "url": "https://www.zacks.com/stock/news/1766996/will-higher-consumer-spend-aid-mastercard-s-ma-q2-earnings", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-23T13:49:07-04:00", "date_et": "2021-07-23"}
{"symbol": "MA", "publishedDate": "2021-07-26 06:58:02", "publisher": "PYMNTS", "title": "Mastercard Teams With Lloyds Bank For Open Banking API", "image": "https://images.financialmodelingprep.com/news/mastercard-teams-with-lloyds-bank-for-open-banking-api-20210726.jpg", "site": "pymnts.com", "text": "Lloyds Bank is teaming up with Mastercard to launch PayFrom Bank, a solution that gives people the power to make direct payments to merchants from their bank accounts. Mastercard's open banking merchant solution offers freedom of choice to both sellers and consumers when it is time to check out, Kelly Devine, divisional president of Mastercard UK […]", "url": "https://www.pymnts.com/news/payment-methods/2021/mastercard-teams-with-lloyds-bank-for-open-banking-api/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-26T06:58:02-04:00", "date_et": "2021-07-26"}
{"symbol": "MA", "publishedDate": "2021-07-26 09:00:00", "publisher": "Business Wire", "title": "JetBlue Renews Long-Term Partnership Agreements with Barclays and Mastercard", "image": "https://images.financialmodelingprep.com/news/jetblue-renews-longterm-partnership-agreements-with-barclays-and-mastercard-20210726.png", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JetBlue (NASDAQ: JBLU) today announced a multi-year extension of their co-branded credit card agreements with both Barclays and Mastercard. The partnership renewal will extend and expand their consumer and small business credit card portfolios. The agreement will center on the continued delivery of innovative, digital-centric card offerings that meet consumer’s evolving needs and foster engagement and loyalty. “We have had a highly successful collaboration with both Barclays and Mastercard. Building on our current best-in-class products, we are already acting on a plan that will disrupt the industry and bring even more value to our cardmembers,” said Don Uselmann, vice president loyalty, JetBlue. “Over time, we will introduce an enhanced product set, reimagined benefits, and a high degree of personalization and choice.” Since 2016, Barclays has been the exclusive issuer and Mastercard has been the exclusive network of JetBlue’s co-branded credit card program in the United States. “During the past five years, we have built a sizeable credit card portfolio with JetBlue. We are thrilled to have the privilege to continue our strong and collaborative partnership, and we look forward to providing JetBlue cardmembers with robust rewards, benefits and experiences for years to come,” said Bob Highland, head of cards and partnerships, Barclays US Consumer Bank. “Barclays’ ‘partner-first’ approach enables us to invest in highly customized solutions that outperform our brand-focused competitors in growing the size, scale, and customer penetration of our programs.” “Mastercard’s suite of benefit offerings and Priceless platforms, coupled with the Barclays and JetBlue custom curated benefits, ensure that consumers can enjoy an enhanced travel experience from booking through departure,” said John Levitsky, EVP account management in North America for Mastercard. “With cardmember needs at the core of the partnership, Mastercard will also leverage its Test & Learn platform and loyalty solutions to enable continued innovation within the card offerings.” JetBlue cardmembers will continue to see the same great benefits from both Barclays and Mastercard, as well as see enhanced value from a new, long-term exclusive agreement. ​​As part of the enhanced product set, they will creatively work together to help provide credit options to customers who may be unbanked or underserved. About JetBlue Airways JetBlue is New York's Hometown Airline®, and a leading carrier in Boston, Fort Lauderdale-Hollywood, Los Angeles, Orlando and San Juan. JetBlue carries customers across the U.S., Caribbean and Latin America. For more information, visit jetblue.com. About Barclays Barclays US Consumer Bank is a leading co-branded credit card issuer and financial services partner in the United States that creates highly customized programs to drive customer loyalty and engagement for some of the country's most successful travel, entertainment, retail and affinity institutions. The bank offers co-branded credit cards, small business credit cards, installment loans, POS Finance, online savings accounts, and CDs. For more information, please visit www.BarclaysUS.com. Barclays is a British universal bank. We are diversified by business, by different types of customer and client, and geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations and functional services across the Group. For further information about Barclays, please visit www.Barclays.com. About Mastercard (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com.", "url": "https://www.businesswire.com/news/home/20210726005395/en/JetBlue-Renews-Long-Term-Partnership-Agreements-with-Barclays-and-Mastercard", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-26T09:00:00-04:00", "date_et": "2021-07-26"}
{"symbol": "MA", "publishedDate": "2021-07-27 09:00:00", "publisher": "Business Wire", "title": "Mastercard Launches New Start Path Cryptocurrency and Blockchain Program for Startups", "image": "https://images.financialmodelingprep.com/news/mastercard-launches-new-start-path-cryptocurrency-and-blockchain-program-20210727.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard announced today a new Start Path global startup engagement program dedicated to supporting fast-growing digital assets, blockchain and cryptocurrency companies. As a continuation of Mastercard’s digital assets work, seven startups have joined the program, including GK8, Domain Money, Mintable, SupraOracles, STACS, Taurus, and Uphold, and together with Mastercard seek to expand and accelerate innovation around digital asset technology and make it safer and easier for people and institutions to buy, spend and hold cryptocurrencies and digital assets. Among the new program participants is Mintable (Singapore), a non-fungible token (NFT) marketplace where users can create, buy and sell digital and physical assets backed by the blockchain such as digital collectibles, avant-garde artwork and even music. The Mintable platform is packed with novel features such as gasless minting and credit card purchasing that are designed to empower the everyday person to get involved with NFTs without any prior knowledge in crypto or coding. GK8 (Israel) is a self-managed end-to-end institutional crypto custody platform that offers a true air-gapped cold vault. This means that the platform is capable of creating, signing and sending secure blockchain transactions without receiving input from the internet, eliminating any potential cyberattack vectors. Taurus (Switzerland) delivers enterprise-grade infrastructure to manage any digital asset with one single platform, including crypto assets, digital currencies and tokenized assets covering issuance, custody, asset servicing and trading. Other participating startups and fast-growing digital asset and blockchain companies have been selected to join the inaugural track of the Start Path program: Domain Money (USA) looks to build a next generation investment platform, bridging the gap between digital assets and traditional finance for retail investors. SupraOracles (Switzerland) is a powerful blockchain oracle that helps businesses bridge real-world data to both public and private chains, enabling interoperable smart contracts to automate, simplify and secure the future of financial markets. STACS (Singapore) provides a blockchain infrastructure for the financial industry to unlock massive value and enable effective sustainable financing. Its clients and partners include global banks, national stock exchanges, and asset managers. Uphold (USA) is a crypto-native, multi-asset digital money platform offering investment and payment services to consumers and businesses worldwide. Uphold's unique ‘Anything-to-Anything’ trading experience enables customers to trade directly between asset classes with embedded payments facilitating a future where everyone has access to financial services. Founders of the digital asset and blockchain companies participating in the new Start Path program aim to address a host of pain points including asset tokenization, data accuracy, digital security and seamless access between the traditional and digital economy. Each startup is focused on solving a unique industry challenge and, throughout the program, will leverage Mastercard’s expertise to support the continued growth and development of their solutions. Jess Turner, executive vice president of New Digital Infrastructure and Fintech, commented: “Mastercard has been engaging with the digital currency ecosystem since 2015. As a leading technology player, we believe we can play a key role in digital assets, helping to shape the industry, and provide consumer protections and security. Part of our role is to forge the future of cryptocurrency, and we’re doing that by bridging mainstream financial principles with digital assets innovations.” Digital Assets and Fintech Innovation Supporting the startup ecosystem is a core part of Mastercard’s ethos, and more than 250 startups have participated in the Start Path program since 2014. With the expansion of Start Path to include fast-growing crypto, blockchain and digital assets startups, Mastercard is providing access to its latest tools and solutions to help these companies scale their innovations and cutting-edge technologies. These startups use the program to connect with our ecosystem of banks, merchants, partners and digital players across the globe to deliver new solutions. About Mastercard (NYSE:MA): Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20210727005244/en/Mastercard-Launches-New-Start-Path-Cryptocurrency-and-Blockchain-Program-for-Startups", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-27T09:00:00-04:00", "date_et": "2021-07-27"}
{"symbol": "MA", "publishedDate": "2021-07-27 09:21:03", "publisher": "PYMNTS", "title": "Mastercard Debuts Startup Program For Blockchain, Crypto Companies", "image": "https://images.financialmodelingprep.com/news/mastercard-debuts-startup-program-for-blockchain-crypto-companies-20210727.jpg", "site": "pymnts.com", "text": "Mastercard has rolled out a new Start Path global startup engagement program, which will work with digital assets, blockchain and cryptocurrency companies, according to a press release emailed to PYMNTS. The goal is to grow digital asset technology and make it safer for both customers and businesses to buy, spend and hold crypto, the release […]", "url": "https://www.pymnts.com/mastercard/2021/mastercard-debuts-startup-program-blockchain-cryptocurrency-companies/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-27T09:21:03-04:00", "date_et": "2021-07-27"}
{"symbol": "MA", "publishedDate": "2021-07-28 08:30:00", "publisher": "Forbes", "title": "Mastercard Stock To Top The Street Expectations In Q2?", "image": "https://images.financialmodelingprep.com/news/mastercard-stock-to-top-the-street-expectations-in-q2-20210728.jpg", "site": "forbes.com", "text": "Mastercard (NYSE: MA) is scheduled to report its fiscal Q2 2021 results on Thursday, July 29. We expect Mastercard﻿﻿ to top the consensus estimates for revenues and earnings.", "url": "https://www.forbes.com/sites/greatspeculations/2021/07/28/mastercard-stock-to-top-the-street-expectations-in-q2/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-28T08:30:00-04:00", "date_et": "2021-07-28"}
{"symbol": "MA", "publishedDate": "2021-07-28 19:25:35", "publisher": "Investopedia", "title": "Mastercard (MA) Option Traders Optimistic Into Earnings", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-option-traders-optimistic-into-earnings-20210728.jpg", "site": "investopedia.com", "text": "A sizable amount of call options are growing in the open interest for Mastercard and option premiums are unusually high right now.", "url": "https://www.investopedia.com/mastercard-ma-option-traders-optimistic-into-earnings-5194562", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-28T19:25:35-04:00", "date_et": "2021-07-28"}
{"symbol": "MA", "publishedDate": "2021-07-29 08:01:00", "publisher": "Business Wire", "title": "Mastercard Incorporated Second-Quarter 2021 Financial Results Available on Company’s Website", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-secondquarter-2021-financial-results-available-on-companys-website-20210729.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its second quarter 2021 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: U.S. dial-in: 833-714-0894 International dial-in (outside the U.S.): +1-778-560-2664 U.K. local dial-in: 02035478612 Conference ID: 4561068 A replay of the call will be available for 30 days using the following dial-in: U.S. dial-in: 800-585-8367 International dial-in (outside the U.S.): +1-416-621-4642 Conference ID: 4561068 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.", "url": "https://www.businesswire.com/news/home/20210729005596/en/Mastercard-Incorporated-Second-Quarter-2021-Financial-Results-Available-on-Company%E2%80%99s-Website", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T08:01:00-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 08:01:00", "publisher": "Business Wire", "title": "Mastercard Incorporated Second-Quarter 2021 Financial Results Available on Company's Website", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-secondquarter-2021-financial-results-available-on-companys-20210729.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard announced its second quarter 2021 financial results through an earnings release available on the company's Investor Relations website.", "url": "https://www.businesswire.com/news/home/20210729005596/en/Mastercard-Incorporated-Second-Quarter-2021-Financial-Results-Available-on-Company%E2%80%99s-Website/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T08:01:00-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 08:09:00", "publisher": "Reuters", "title": "Mastercard profit jumps 36% on vaccine-fueled spending boost", "image": "https://images.financialmodelingprep.com/news/mastercard-profit-jumps-36-on-vaccinefueled-spending-boost-20210729.jpg", "site": "reuters.com", "text": "Mastercard Inc reported a nearly 36% jump in second quarter profit on Thursday, helped by an improvement in overall spending and a recovery in cross-border volumes.", "url": "https://www.reuters.com/business/finance/mastercard-profit-jumps-36-vaccine-fueled-spending-boost-2021-07-29/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T08:09:00-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 08:17:00", "publisher": "Market Watch", "title": "Earnings Results: Mastercard tops earnings expectations as spending recovery continues", "image": "https://images.financialmodelingprep.com/news/earnings-results-mastercard-tops-earnings-expectations-as-spending-recovery-20210729.jpg", "site": "marketwatch.com", "text": "Mastercard Inc. topped expectations with its second-quarter results Thursday amid a continued recovery in spending trends.", "url": "https://www.marketwatch.com/story/mastercard-tops-earnings-expectations-as-spending-recovery-continues-11627561062", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T08:17:00-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 10:52:00", "publisher": "Barron's", "title": "Mastercard Stock Is Rallying After Earnings. What It Means for Its Visa Rivalry.", "image": "https://images.financialmodelingprep.com/news/mastercard-stock-is-rallying-after-earnings-what-it-means-20210729.jpg", "site": "barrons.com", "text": "Investors seem more encouraged by Mastercard's results than Visa's, but both credit card companies face headwinds from the Covid-19 Delta variant.", "url": "https://www.barrons.com/articles/mastercard-stock-earnings-visa-51627570302", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T10:52:00-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 14:15:43", "publisher": "PYMNTS", "title": "Mastercard X-Border Volumes Surge 58 Pct On ‘Pent Up' Demand", "image": "https://images.financialmodelingprep.com/news/mastercard-xborder-volumes-surge-58-pct-on-pent-up-demand-20210729.jpg", "site": "pymnts.com", "text": "Second-quarter earnings results for Mastercard, like Visa before it and the big banks too, show a rebound in consumer spending and a snapback in cross-border activity as international travel is in its early innings of recovery. To that end, the payments giant reported consolidated net revenues of $4.5 billion, which on a currency neutral basis […]", "url": "https://www.pymnts.com/earnings/2021/mastercard-x-border-volumes-surge-58-pct-on-pent-up-demand/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T14:15:43-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 15:14:04", "publisher": "Zacks Investment Research", "title": "Mastercard's (MA) Q2 Earnings Top on Steady Domestic Spending", "image": "https://images.financialmodelingprep.com/news/mastercards-ma-q2-earnings-top-on-steady-domestic-spending-20210729.jpg", "site": "zacks.com", "text": "Higher consumer spending drives Mastercard's (MA) earnings in Q2.", "url": "https://www.zacks.com/stock/news/1770768/mastercard-s-ma-q2-earnings-top-on-steady-domestic-spending", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T15:14:04-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-29 16:12:04", "publisher": "Seeking Alpha", "title": "Mastercard Incorporated (MA) CEO Michael Miebach on Q2 2021 Results - Earnings Call Transcript", "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-ma-ceo-michael-miebach-on-q2-2021-20210729.jpg", "site": "seekingalpha.com", "text": "Mastercard Incorporated (MA) CEO Michael Miebach on Q2 2021 Results - Earnings Call Transcript", "url": "https://seekingalpha.com/article/4442761-mastercard-incorporated-ma-ceo-michael-miebach-on-q2-2021-results-earnings-call-transcript", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-29T16:12:04-04:00", "date_et": "2021-07-29"}
{"symbol": "MA", "publishedDate": "2021-07-30 08:09:00", "publisher": "Reuters", "title": "Mastercard submits new audit to India after ban over data handling", "image": "https://images.financialmodelingprep.com/news/mastercard-submits-new-audit-to-india-after-ban-over-data-20210730.jpg", "site": "reuters.com", "text": "Mastercard has submitted a new audit report to India's central bank, it told Reuters, as it seeks to overturn a ban on card issuance linked to concerns over the U.S. giant's handling of data processed abroad.", "url": "https://www.reuters.com/article/us-india-mastercard/mastercard-submits-new-audit-to-india-after-ban-over-data-handling-idUSKBN2F01PG", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-30T08:09:00-04:00", "date_et": "2021-07-30"}
{"symbol": "MA", "publishedDate": "2021-07-30 11:28:21", "publisher": "CNBC", "title": "U.S. consumers ready and willing to spend more now than before Covid, Mastercard CFO says", "image": "https://images.financialmodelingprep.com/news/us-consumers-ready-and-willing-to-spend-more-now-20210730.jpeg", "site": "cnbc.com", "text": "An \"aversion to cash\" is leading to an increase in digital payments, Mastercard CFO Sachin Mehra told CNBC.", "url": "https://www.cnbc.com/2021/07/30/mastercard-cfo-consumers-ready-to-spend-more-now-than-before-covid.html", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-30T11:28:21-04:00", "date_et": "2021-07-30"}
{"symbol": "MA", "publishedDate": "2021-07-30 11:48:43", "publisher": "24/7 Wall Street", "title": "Amazon, Mastercard, Pinterest and More Friday Afternoon Analyst Upgrades and Downgrades", "image": "https://images.financialmodelingprep.com/news/amazon-mastercard-pinterest-and-more-friday-afternoon-analyst-upgrades-20210730.jpg", "site": "247wallst.com", "text": "With the trading day nearly halfway over, the broad markets were pulling back into the weekend.", "url": "https://247wallst.com/investing/2021/07/30/amazon-mastercard-pinterest-and-more-friday-afternoon-analyst-upgrades-and-downgrades/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-30T11:48:43-04:00", "date_et": "2021-07-30"}
{"symbol": "MA", "publishedDate": "2021-07-31 05:51:00", "publisher": "The Motley Fool", "title": "A Stock Market Crash Is on the Way: 3 Stocks to Buy When It Happens", "image": "https://images.financialmodelingprep.com/news/a-stock-market-crash-is-on-the-way-3-20210731.jpg", "site": "fool.com", "text": "Short-term pain can lead to long-term gain for opportunistic investors.", "url": "https://www.fool.com/investing/2021/07/31/a-stock-market-crash-is-on-the-way-3-stocks-to-buy/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-07-31T05:51:00-04:00", "date_et": "2021-07-31"}
{"symbol": "MA", "publishedDate": "2021-08-01 18:52:16", "publisher": "Seeking Alpha", "title": "Mastercard: Volume Now 30% Above 2019, Strong Earnings Rebound To Come", "image": "https://images.financialmodelingprep.com/news/mastercard-volume-now-30-above-2019-strong-earnings-rebound-20210801.jpg", "site": "seekingalpha.com", "text": "Mastercard: Volume Now 30% Above 2019, Strong Earnings Rebound To Come", "url": "https://seekingalpha.com/article/4443885-mastercard-volume-now-30-percent-above-2019-strong-earnings-rebound-to-come", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-01T18:52:16-04:00", "date_et": "2021-08-01"}
{"symbol": "MA", "publishedDate": "2021-08-02 12:00:00", "publisher": "Business Wire", "title": "Mastercard Partners with Birmingham Department of Innovation & Economic Opportunity to Launch Ascend Birmingham Helping Local Businesses Get Digital", "image": "https://images.financialmodelingprep.com/news/mastercard-partners-with-birmingham-department-of-innovation-economic-opportunity-to-20210802.jpg", "site": "businesswire.com", "text": "BIRMINGHAM, Ala. and PURCHASE, N.Y.--(BUSINESS WIRE)--With spend already declining in Birmingham pre-COVID, the decrease rapidly accelerated in Birmingham’s downtown and surrounding tracts because of the pandemic significantly impacting the city’s small businesses. Minority owned businesses in the region saw an outsized impact from the downturn and are a priority focus amidst recovery. Mastercard and the Birmingham Department of Innovation and Economic Opportunity are working to address this with the introduction of Ascend Birmingham. The program is focused on helping local small businesses pivot to digital operations and thrive in an age of a more digitally engaged consumer. \"The City of Birmingham is thrilled to partner with Mastercard on this key initiative, which will go a long way in reaching our goal of making Birmingham a hub for minority-owned small businesses,\" Mayor Woodfin said. \"Allowing these businesses to flourish in digital spaces not only increases their reach but their creative potential as well. It's an incredible opportunity for our business community.\" With support from Square, Accion Opportunity Fund and Sunrise by Lendio, Ascend Birmingham will provide education, tools and resources focused on building out an effective digital presence, accepting digital payments, growing and managing your business, gaining access to capital, and keeping your business and your customers protected. Participants in the program will also be provided a custom curated business kit that includes solutions such as a Square Reader for Contactless & Chip along with website development software, bookkeeping software and a professional bookkeeper from Sunrise by Lendio, advisory expertise from Accion Opportunity Fund, Mastercard cybersecurity and data insight solutions and other City-provided resources. Mastercard and the City of Birmingham have also partnered to deliver a city focused Digital Doors platform with always-on content and resources for local owners. “We applaud the efforts of Mayor Woodfin and the Department of Innovation & Economic Opportunity to ensure the endurance of Birmingham-based small businesses and are proud to partner with the city so that owners have access to the tools and resources necessary to thrive in today’s digital age,” said Michael Froman, vice chairman and president Strategic Growth for Mastercard. “The resiliency and drive of small business owners is unprecedented and supporting their recovery is the single most important thing we can all do for economic and social vitality.” Birmingham-based small businesses interested in learning more and signing up for an upcoming Ascend Birmingham cohort can visit here. Mayor Woodfin and Mastercard will also recognize three Birmingham businesses selected to be part of the national Priceless campaign, which highlights creative businesses offering unique experiences for patrons. Ursula Smith, founder of the Ursula Smith Dance Co.; Evan and Eleny Christen, owners of Pinspiration Birmingham; and Tanesha Sims-Summers, founder and CEO of Naughty But Nice Kettle Corn Co. are the Birmingham honorees. “Leveraging data-driven insights, we are partnering with the City of Birmingham to assess the impact of the pandemic on the local economy and help protect local communities and businesses that are most at-risk,” said Linda Kirkpatrick, president of North America for Mastercard. “With these insights we can engage our network of partners and prioritize investments in order to proactively build a foundation that fosters an equitable recovery.” “As an entrepreneur, I have had to adapt to a number of obstacles and uncertainties. When confronted with a problem or difficult situation I never run, which cultivated my faith, resilience, courage and fortitude needed to thrive in life and business. Opening a new studio location, a month before the pandemic hit Alabama forced me to pivot to a digital platform. This allowed me to expand my reach from Florida to Germany,” said Ursula Smith, Owner of Ursula Smith Company. In Solidarity with Birmingham As part of its In Solidarity initiative, Mastercard has embarked on a multi-city road show with Birmingham as the focus for the next stop. To support the region in helping close the racial wealth and opportunity gap for Black communities and business owners Mastercard and Blavity, Inc. the pre-eminent media resource for Black millennials, are partnering to launch a virtual discussion addressing a financial system that has systemically disadvantaged and excluded Black communities with a view to advancing opportunity and equitable growth in Birmingham. Speakers include: The honorable Randall Woodfin, Mayor of Birmingham, the Birmingham Office of Social Justice and Racial Equity, Rev. Arthur Price, Regions Bank and Morgan DeBaun, CEO, Blavity. Expanding Digitally with Customer Experience and Safety Prioritized Ascend Birmingham is part of Mastercard’s wider recovery efforts designed to support businesses and governments across the globe looking for resources to help better manage the health, safety and economic risks presented by the recent pandemic. Recovery Insights offers a set of tools, innovation and research that can provide some certainty today and support data-driven decision-making for a more digital tomorrow. More information on Mastercard Recovery Insights can be found here. About Mastercard Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20210802005515/en/Mastercard-Partners-with-Birmingham-Department-of-Innovation-Economic-Opportunity-to-Launch-Ascend-Birmingham-Helping-Local-Businesses-Get-Digital", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-02T12:00:00-04:00", "date_et": "2021-08-02"}
{"symbol": "MA", "publishedDate": "2021-08-02 12:00:00", "publisher": "Business Wire", "title": "Mastercard Partners with Birmingham Department of Innovation & Economic Opportunity to Launch Ascend Birmingham Helping Local Businesses Get Digital", "image": "https://images.financialmodelingprep.com/news/mastercard-partners-with-birmingham-department-of-innovation-economic-opportunity-20210802.jpg", "site": "businesswire.com", "text": "BIRMINGHAM, Ala. and PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard partners with Birmingham Department of Innovation & Economic Opportunity to launch Ascend Birmingham helping local businesses get digital", "url": "https://www.businesswire.com/news/home/20210802005515/en/Mastercard-Partners-with-Birmingham-Department-of-Innovation-Economic-Opportunity-to-Launch-Ascend-Birmingham-Helping-Local-Businesses-Get-Digital/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-02T12:00:00-04:00", "date_et": "2021-08-02"}
{"symbol": "MA", "publishedDate": "2021-08-03 08:00:00", "publisher": "Business Wire", "title": "Mastercard and Jennifer Hudson Partner to Celebrate Black Women Business Owners with Strivers Celebration and Historic Performance at Apollo Theater", "image": "https://images.financialmodelingprep.com/news/mastercard-and-jennifer-hudson-partner-to-celebrate-black-women-20210803.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--In honor of Black Business Month, Mastercard is announcing a series of celebratory events in partnership with Mastercard ambassador, Jennifer Hudson, to acknowledge and reinforce the impact of Black women entrepreneurs across the U.S. The celebration is anticipated to kick off with the premiere of the long-awaited Aretha Franklin feature film Respect and continue with a Strivers Celebration event, and special concert by Jennifer Hudson at the World Famous Apollo Theater in Harlem, NYC. Respect Movie Premiere Mastercard is providing a limited number of cardholders with special access to the red carpet premiere of Respect at the Regency Village Theater ahead of the film's global release on August 13th to underscore the impact of Black women in business and music. During the event, these select cardholders will be among the stars as they arrive at the historic venue before taking their seats as the first audience to view the film. Cardholders can visit Priceless.com here to purchase this one-of-a-kind experience while supply lasts, with 100% of sales benefiting Fearless Fund, a venture capital fund built by women of color for women of color, to further support funding for Black women entrepreneurs. Rolling out the Red Carpet for Strivers Mastercard, Fearless Fund and Create & Cultivate will host a red carpet celebration to honor the entrepreneurs featured throughout the Strivers Initiative at the Apollo Theater on August 18th. During the event Jennifer Hudson will make a special appearance as Mastercard unveils the “Strivers Gallery” featuring portraits of the guests of honor and Fearless Strivers Grant Contest recipients. Chicago-based creator, Tyler Clark, will create the portraits of the honorees using her unique 3D hair technique. \"I'm excited to celebrate the Black-women owned business entrepreneurs that Mastercard's Strivers Initiative spotlights both at the event in their honor and at the intimate concert at the Apollo. It's a dream come true to perform at the Apollo and an honor to celebrate with Ms. Franklin's music, who has been an inspiration to me my entire life,” Jennifer Hudson shared. “I continue to be in awe of Black female role models who serve as activists and advocates in their communities and I am thrilled, through my partnership with Mastercard, to shine a light on them.\" Jennifer Hudson Live at the Apollo Mastercard will present the “Jennifer Hudson Live at The Apollo” concert on August 19th, the first live audience performance at the Apollo Theater since March 2020. At this intimate gathering of Black women entrepreneurs and select cardholders, Ms. Hudson will perform classic Aretha Franklin hits featured in Respect as well as songs from her own catalogue. Limited tickets are available for purchase on Priceless.com here, with 100% of sales benefiting Fearless Fund. “Black women continue to build businesses at a rate far greater than any other demographic, however in order to maintain and scale their business, they need access to the funding and tools they deserve,” said Cheryl Guerin, EVP Marketing and Communications in North America for Mastercard. “Mastercard remains committed to acknowledging the impact of Black women small business owners and delivering on their needs to ensure they continue to thrive and empower their communities. Together with Jennifer Hudson, we are proud to celebrate and elevate these women through our Strivers Initiative efforts.” Supporting RESPECT Film Mastercard is excited to team with Metro Goldwyn Mayer (MGM) on Respect, the long-awaited film starring Academy Award®-winner Jennifer Hudson, who was handpicked by Ms. Franklin to portray her on the big screen. Following the rise of Aretha Franklin’s career from a child singing in her father’s church’s choir to her international superstardom, Respect is the remarkable story of Franklin’s journey to find her voice. Respect opens in-theatres nationwide on Friday, August 13th. Continuing to Support Strivers with Mentorship and Resources To further deliver on the needs of the community, Mastercard and Create & Cultivate will launch its third season of “Priceless Conversations: Strivers Edition” with weekly episodes focused on business verticals across Beauty, Fashion, Wellness, and Food & Bev – featuring industry expert conversations and virtual shopping segments highlighting businesses to shop, share and support. Mastercard will also provide cardholders a unique collection of content and experiences curated by Black women-owned businesses on its Priceless.com platform. To discover these Priceless experiences and support these businesses go to priceless.com/local-biz. These efforts are grounded in Mastercard’s sustained efforts to build a more inclusive digital economy and previously announced half-billion-dollar commitment to support Black communities over the next five years. Through mastercard.com/smallbiz visitors can learn more about this initiative, as well as shop Black-women owned businesses and support their work. About Mastercard Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com About Metro Goldwyn Mayer Metro Goldwyn Mayer (MGM) is a leading entertainment company focused on the production and global distribution of film and television content across all platforms. The company owns one of the world's deepest libraries of premium film and television content as well as the premium pay television network EPIX, which is available throughout the U.S. via cable, satellite, telco, and digital distributors. In addition, MGM has investments in numerous other television channels, digital platforms, interactive ventures, and is producing premium short-form content for distribution. For more information, visit www.mgm.com.", "url": "https://www.businesswire.com/news/home/20210803005632/en/Mastercard-and-Jennifer-Hudson-Partner-to-Celebrate-Black-Women-Business-Owners-with-Strivers-Celebration-and-Historic-Performance-at-Apollo-Theater", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-03T08:00:00-04:00", "date_et": "2021-08-03"}
{"symbol": "MA", "publishedDate": "2021-08-03 14:01:06", "publisher": "Seeking Alpha", "title": "The Highest Quality Dividend Growth Stocks", "image": "https://images.financialmodelingprep.com/news/the-highest-quality-dividend-growth-stocks-20210803.jpg", "site": "seekingalpha.com", "text": "This article updates one published by David Van Knapp in June 2020.", "url": "https://seekingalpha.com/article/4444407-the-highest-quality-dividend-growth-stocks", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-03T14:01:06-04:00", "date_et": "2021-08-03"}
{"symbol": "MA", "publishedDate": "2021-08-03 15:30:00", "publisher": "The Motley Fool", "title": "Don't Be Surprised if Warren Buffett Has Bought This Stock", "image": "https://images.financialmodelingprep.com/news/dont-be-surprised-if-warren-buffett-has-bought-this-20210803.jpg", "site": "fool.com", "text": "Discover Financial has a lot of the things that the Oracle of Omaha looks for in an investment.", "url": "https://www.fool.com/investing/2021/08/03/dont-be-surprised-if-warren-buffett-has-bought-thi/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-03T15:30:00-04:00", "date_et": "2021-08-03"}
{"symbol": "MA", "publishedDate": "2021-08-04 10:09:34", "publisher": "Seeking Alpha", "title": "Dividend Growth Stock Watchlist - August 2021", "image": "https://images.financialmodelingprep.com/news/dividend-growth-stock-watchlist-august-2021-20210804.jpeg", "site": "seekingalpha.com", "text": "There are 25 stocks on my dividend growth watchlist for August 2021. Eight of the stocks on my watchlist are currently undervalued.", "url": "https://seekingalpha.com/article/4444778-dividend-growth-stock-watchlist-august-2021", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-04T10:09:34-04:00", "date_et": "2021-08-04"}
{"symbol": "MA", "publishedDate": "2021-08-05 09:01:00", "publisher": "Business Wire", "title": "Mastercard SpendingPulse: Child Tax Credit Helps Lift U.S. Retail Sales Growth to 10.9%* in July", "image": "https://images.financialmodelingprep.com/news/mastercard-spendingpulse-child-tax-credit-helps-lift-us-retail-20210805.jpg", "site": "businesswire.com", "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Retail sales in the U.S. grew for the 11th consecutive month in July, according to Mastercard SpendingPulse™, which measures in-store and online retail sales across all forms of payment. With more cash in hand—fueled in part by the Child Tax Credit and pent-up savings—consumers drove U.S. retail spending growth, excluding automotive and gasoline, to +10.9% compared to July 2020. This is nearly quadruple the average growth in the month of July**. At a national level, back-to-school shopping is well underway, impacting a number of sectors as anticipated in our forecast. Overall, key retail trends from July include: Child Tax Credit Boosts Department Stores and Apparel Sales: The first of six monthly Child Tax Credit payments provided parents with an infusion of cash during the peak back-to-school shopping season, with Apparel (+80% YOY) and Department Store (+44.8% YOY) sectors seeing an uptick in sales for the month. This was concentrated in the days immediately following the first distribution on July 15. Return of the In-Store Shopper: Brick-and-mortar browsing is making its return, with in-stores sales making up 81.9% of total retail sales (ex auto) for the month. According to Mastercard SpendingPulse, in-store sales were up +15.5% YOY in July and weekends experienced positive spikes in spending as a result of in-store shoppers returning to physical stores. Making a House a Home: According to data released by the U.S. Census Bureau, new home sales have fallen to an 18-month low. However, consumers are still eager to turn their houses into homes as the Furniture & Furnishings sector continues to grow on a YOY (+3.2%) and YO2Y (+26.8%) basis. “While e-commerce continues to play an increasingly significant role for retail, nothing replaces the in-store experience,” said Steve Sadove, senior advisor for Mastercard and former CEO and Chairman of Saks Incorporated. “July numbers reflect a return to the store. Consumers are shopping, spending and splurging across channels.” Mastercard’s chief economist and head of the Mastercard Economics Institute Bricklin Dwyer said, “Back to school shopping is back. Combined with greater savings and higher demand, the Child Tax Credit has provided a boost for families and is putting more money into retailers’ pockets.” *Excluding auto and gas **The average year-over-year growth in July over the past four years was 2.9% About Mastercard SpendingPulse Mastercard SpendingPulse™ reports on national retail sales across all payment types in select markets around the world. The findings are based on aggregate sales activity in the Mastercard payments network, coupled with survey-based estimates for certain other payment forms, such as cash and check. As such, SpendingPulse™ insights do not in any way contain, reflect or relate to actual Mastercard operational or financial performance, or specific payment-card-issuer data. Mastercard SpendingPulse defines “U.S. retail sales” as sales at retailers and food services merchants of all sizes. Sales activity within the services sector (for example, travel services such as airlines and lodging) are not included. About Mastercard (NYSE:MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com", "url": "https://www.businesswire.com/news/home/20210805005340/en/Mastercard-SpendingPulse-Child-Tax-Credit-Helps-Lift-U.S.-Retail-Sales-Growth-to-10.9*-in-July", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-05T09:01:00-04:00", "date_et": "2021-08-05"}
{"symbol": "MA", "publishedDate": "2021-08-06 09:51:29", "publisher": "Benzinga", "title": "Coinbase Rolls Out Crypto Purchases Via Visa And Mastercard Debit Cards Linked To Apple Pay", "image": "https://images.financialmodelingprep.com/news/coinbase-rolls-out-crypto-purchases-via-visa-and-mastercard-20210806.jpg", "site": "benzinga.com", "text": "Crypto exchange Coinbase Global Inc (NASDAQ:COIN) has added more ways to make swift purchases of cryptocurrency on its platform. What Happened: In an announcement on Thursday, the exchange said it was introducing crypto buys with linked debit cards to Apple Inc (NASDAQ:AAPL) Pay and Alphabet Inc (NASDAQ:GOOG) (NASDAQ: GOOGL) Google Pay, with instant cashouts up to $100,000 per transaction available 24/7.", "url": "https://www.benzinga.com/markets/cryptocurrency/21/08/22369036/coinbase-rolls-out-crypto-purchases-via-visa-and-mastercard-debit-cards-linked-to-apple-pa", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-06T09:51:29-04:00", "date_et": "2021-08-06"}
{"symbol": "MA", "publishedDate": "2021-08-07 06:40:00", "publisher": "The Motley Fool", "title": "This Low-Risk Stock Is a Long-Term Winner", "image": "https://images.financialmodelingprep.com/news/this-lowrisk-stock-is-a-longterm-winner-20210807.jpg", "site": "fool.com", "text": "Investors' expectations may never catch up with the company's performance.", "url": "https://www.fool.com/investing/2021/08/07/this-low-risk-stock-is-a-long-term-winner/", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-07T06:40:00-04:00", "date_et": "2021-08-07"}
{"symbol": "MA", "publishedDate": "2021-08-09 08:46:37", "publisher": "Business Insider", "title": "Mastercard positions itself for growth as consumers ramp up retail spending", "image": "https://images.financialmodelingprep.com/news/mastercard-positions-itself-for-growth-as-consumers-ramp-up-20210809.jpg", "site": "businessinsider.com", "text": "Mastercard is making moves that can help it capitalize on rising retail spending as legislators mull new fee restrictions.", "url": "https://www.businessinsider.com/mastercard-poised-for-growth-but-regulations-loom-2021-8", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-09T08:46:37-04:00", "date_et": "2021-08-09"}
{"symbol": "MA", "publishedDate": "2021-08-10 11:38:20", "publisher": "Zacks Investment Research", "title": "Mastercard (MA) Ties Up With Penny Software to Ease B2B Payments", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-ties-up-with-penny-software-to-ease-20210810.jpg", "site": "zacks.com", "text": "Mastercard (MA) collaborates with Penny Software in a bid to automate the procurement process of businesses and upgrade the B2B payments ecosystem of the wider MENA region.", "url": "https://www.zacks.com/stock/news/1777627/mastercard-ma-ties-up-with-penny-software-to-ease-b2b-payments", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-10T11:38:20-04:00", "date_et": "2021-08-10"}
{"symbol": "MA", "publishedDate": "2021-08-12 11:40:27", "publisher": "Zacks Investment Research", "title": "Mastercard (MA) Teams Up to Aid Mpamba's Mobile Money Clients", "image": "https://images.financialmodelingprep.com/news/mastercard-ma-teams-up-to-aid-mpambas-mobile-money-clients-20210812.jpg", "site": "zacks.com", "text": "Mastercard (MA) ties up with TNM Mpamba, which has unveiled a Mastercard solution aimed at offering seamless e-commerce transactions for its mobile money wallet users.", "url": "https://www.zacks.com/stock/news/1780995/mastercard-ma-teams-up-to-aid-mpamba-s-mobile-money-clients", "ticker": "MA", "event_date": "2021-07-29", "window_start": "2021-07-15", "window_end": "2021-08-12", "publishedDateET": "2021-08-12T11:40:27-04:00", "date_et": "2021-08-12"}
