[
  {
    "symbol": "MA",
    "publishedDate": "2023-01-12 04:03:28",
    "publisher": "PYMNTS",
    "title": "Mastercard: How Banking as a Service Will Scale in 2023 and Beyond",
    "image": "https://images.financialmodelingprep.com/news/mastercard-how-banking-as-a-service-will-scale-in-20230112.jpg",
    "site": "pymnts.com",
    "text": "“Banking as a service, and embedded finance, taken together — they just represent where the world is going.” As Sherri Haymond, executive vice president, Global Digital Partnerships at Mastercard, told PYMNTS' Karen Webster, BaaS is slated to become big business — at scale — in a short timeframe.",
    "url": "https://www.pymnts.com/digital-first-banking/2023/mastercard-how-banking-as-a-service-will-scale-in-2023-and-beyond/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-12T04:03:28-05:00",
    "date_et": "2023-01-12"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-12 08:30:00",
    "publisher": "Business Wire",
    "title": "Mastercard Names Devin Corr as Head of Investor Relations",
    "image": "https://images.financialmodelingprep.com/news/mastercard-names-devin-corr-as-head-of-investor-relations-20230112.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today appointed Devin Corr as executive vice president of investor relations, effective May 1, 2023. This appointment comes as Warren Kneeshaw announced he will retire from Mastercard. Kneeshaw joined Mastercard in 2016. Under his leadership, Mastercard’s investor relations program has been highly recognized, as he effectively managed investor interactions, including during both a CEO and CFO transition. Kneeshaw will continue to serve in an advisory capacity and work on special projects through the end of the year. Prior to joining Mastercard, Kneeshaw held various finance and investor relations roles at Qualcomm, Textron, Nortel Networks and Procter & Gamble. “Warren has played a key role in the continued growth of the company’s profile across the investor community over the past six-plus years,” said Sachin Mehra, chief financial officer. “His deep relationships with the investment community – and across the organization – have helped us advance our strategy and navigate a unique economic environment over the past few years.” As executive vice president of investor relations, Corr will oversee the team responsible for cultivating relationships with the investment community. His team will continue to focus on educating and updating investors and providing management and the board with feedback on how the market views the company. Corr will work closely with several groups, including with the management committee, the corporate controller and corporate secretary, to deliver key information to a range of stakeholders. “Devin brings a unique perspective to this role. Not only does he have a deep knowledge of our diverse business, but his tenure working on several equities’ desks will help continue to evolve our relationship with our stockholders and the broader investment community,” said Mehra. Corr currently serves as the chief financial officer for Mastercard’s Data and Services activities. Before moving into this role, he served in a number of finance leadership positions, including support of Consumer Products and the company’s UK, Ireland, Nordic and Baltics division. Corr originally joined Mastercard in 2013 to manage customer risk management activities across the Americas. Earlier in his career, Corr worked in equity trading at UBS and equity research at Bank of America/ Merrill Lynch. He also spent time at General Motors treasurer’s office. Corr earned his Master of Business Administration at Harvard Business School and a bachelor’s degree in Mathematics and Economics from Cornell University. About Mastercard Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.",
    "url": "https://www.businesswire.com/news/home/20230112005440/en/Mastercard-Names-Devin-Corr-as-Head-of-Investor-Relations",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-12T08:30:00-05:00",
    "date_et": "2023-01-12"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-12 08:30:00",
    "publisher": "Business Wire",
    "title": "Mastercard Names Devin Corr as Head of Investor Relations",
    "image": "https://images.financialmodelingprep.com/news/mastercard-names-devin-corr-as-head-of-investor-relations-20230112.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--( BUSINESS WIRE )--Mastercard Incorporated (NYSE: MA) today appointed Devin Corr as executive vice president of investor relations, effective May 1, 2023. This appointment comes as Warren Kneeshaw announced he will retire from Mastercard.",
    "url": "https://www.businesswire.com/news/home/20230112005440/en/Mastercard-Names-Devin-Corr-as-Head-of-Investor-Relations/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-12T08:30:00-05:00",
    "date_et": "2023-01-12"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-13 03:10:43",
    "publisher": "Seeking Alpha",
    "title": "Mastercard: Reliable But Expensive",
    "image": "https://images.financialmodelingprep.com/news/mastercard-reliable-but-expensive-20230113.jpg",
    "site": "seekingalpha.com",
    "text": "Mastercard has a stable business but remains expensive at this time. Their growth potential does not warrant a multiple as high as the market is giving it.",
    "url": "https://seekingalpha.com/article/4569690-mastercard-stock-reliable-but-expensive-hold",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-13T03:10:43-05:00",
    "date_et": "2023-01-13"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-14 00:13:48",
    "publisher": "Seeking Alpha",
    "title": "Dividend Growth Stock Watchlist - January 2023",
    "image": "https://images.financialmodelingprep.com/news/dividend-growth-stock-watchlist-january-2023-20230114.jpg",
    "site": "seekingalpha.com",
    "text": "There are 17 stocks on my dividend growth watchlist for January 2023. A little more than half of the stocks on my watchlist for this month are currently undervalued based on dividend yield theory.",
    "url": "https://seekingalpha.com/article/4569903-dividend-growth-stock-watchlist-january-2023",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-14T00:13:48-05:00",
    "date_et": "2023-01-14"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-14 07:30:00",
    "publisher": "Seeking Alpha",
    "title": "How I'd Invest A $1.5 Billion Jackpot",
    "image": "https://images.financialmodelingprep.com/news/how-id-invest-a-15-billion-jackpot-20230114.jpg",
    "site": "seekingalpha.com",
    "text": "Lotto fever is sweeping America, with the Mega Millions Jackpot hitting potentially hitting $1.5 billion by Friday's drawing. The lottery curse has laid many to ruin because with great wealth comes great power, more than many people can handle responsibly.",
    "url": "https://seekingalpha.com/article/4569812-invest-lottery-jackpot-portfolio-strategy",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-14T07:30:00-05:00",
    "date_et": "2023-01-14"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-15 09:45:00",
    "publisher": "Forbes",
    "title": "8 Top Tech Stocks To Buy Now - How To Take Advantage Of The Market Dip",
    "image": "https://images.financialmodelingprep.com/news/8-top-tech-stocks-to-buy-now-how-to-take-20230115.jpg",
    "site": "forbes.com",
    "text": "It's no secret that 2022 was a volatile year for the economy, and tech stocks are always among the first to take a big dip. Here's what investors need to know about the tech companies most likely to make a comeback in 2023.",
    "url": "https://www.forbes.com/sites/qai/2023/01/15/8-top-tech-stocks-to-buy-nowhow-to-take-advantage-of-the-market-dip/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-15T09:45:00-05:00",
    "date_et": "2023-01-15"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-16 22:14:04",
    "publisher": "Seeking Alpha",
    "title": "Mastercard's Strong Growth Potential Is Worth The Premium Price",
    "image": "https://images.financialmodelingprep.com/news/mastercards-strong-growth-potential-is-worth-the-premium-price-20230116.jpg",
    "site": "seekingalpha.com",
    "text": "Mastercard possesses a sustainable competitive advantage through their leading presence in electronic payment infrastructure. Pandemic fallout looks to be clearing up, and a full recovery is likely to drive strong growth in the near term.",
    "url": "https://seekingalpha.com/article/4570239-mastercard-strong-growth-potential-worth-premium-price",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-16T22:14:04-05:00",
    "date_et": "2023-01-16"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-17 12:48:18",
    "publisher": "Zacks Investment Research",
    "title": "Mastercard (MA), Tradeling to Boost Digitization for UAE's SMEs",
    "image": "https://images.financialmodelingprep.com/news/mastercard-ma-tradeling-to-boost-digitization-for-uaes-smes-20230117.jpg",
    "site": "zacks.com",
    "text": "Mastercard (MA) joins forces with Tradeling to let SMEs in the UAE avail discount offers on the latter's platform and subsequently, plans to extend the tie-up to other regions.",
    "url": "https://www.zacks.com/stock/news/2040251/mastercard-ma-tradeling-to-boost-digitization-for-uae-s-smes",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-17T12:48:18-05:00",
    "date_et": "2023-01-17"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-18 04:00:57",
    "publisher": "PYMNTS",
    "title": "BetMGM Wagers That Mastercard Send Fast Payouts Is a Winner",
    "image": "https://images.financialmodelingprep.com/news/betmgm-wagers-that-mastercard-send-fast-payouts-is-a-20230118.jpg",
    "site": "pymnts.com",
    "text": "Players using online betting platforms want winnings now, and digital innovation is enabling it. Another way of looking at it is that online sports betting makes consumers happiest when the payment experience is real-time or close to it, as in physical casinos.",
    "url": "https://www.pymnts.com/disbursements/2023/betmgm-wagers-that-mastercard-send-fast-payouts-is-a-winner/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-18T04:00:57-05:00",
    "date_et": "2023-01-18"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-18 22:52:13",
    "publisher": "24/7 Wall Street",
    "title": "10 Biggest Companies Reporting Earnings in the 4th Week of Jan 2023",
    "image": "https://images.financialmodelingprep.com/news/10-biggest-companies-reporting-earnings-in-the-4th-week-20230118.jpg",
    "site": "247wallst.com",
    "text": "The fourth quarter earnings season is always the most important because it reveals the full year performance of the companies as well.",
    "url": "https://247wallst.com/investing/2023/01/18/10-biggest-companies-reporting-earnings-in-the-4th-week-of-jan-2023/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-18T22:52:13-05:00",
    "date_et": "2023-01-18"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-19 08:03:00",
    "publisher": "Market Watch",
    "title": "Exclusive: Mastercard expands relationship with Citizens in exclusive arrangement",
    "image": "https://images.financialmodelingprep.com/news/exclusive-mastercard-expands-relationship-with-citizens-in-exclusive-arrangement-20230119.jpg",
    "site": "marketwatch.com",
    "text": "Mastercard Inc. is expanding its partnership with Citizens Financial Group to become the bank's exclusive payments network, the companies will announce Thursday.",
    "url": "https://www.marketwatch.com/story/exclusive-mastercard-expands-relationship-with-citizens-in-exclusive-arrangement-11674133427",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-19T08:03:00-05:00",
    "date_et": "2023-01-19"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-19 09:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard and Citizens Financial Group Announce Exclusive Payments Partnership",
    "image": "https://images.financialmodelingprep.com/news/mastercard-and-citizens-financial-group-announce-exclusive-payments-partnership-20230119.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y. & PROVIDENCE, R.I.--(BUSINESS WIRE)--Mastercard and Citizens today announced an expanded partnership, making Mastercard the exclusive payments network across Citizens’ credit, debit and commercial portfolios, as well as services provider in the U.S. With shared values and vision, Citizens and Mastercard are united in the goal to provide access, inclusion and innovation to the communities they serve. “Mastercard is thrilled to enhance our partnership with Citizens to become their exclusive payments provider across all product portfolios,” said Linda Kirkpatrick, president, North America at Mastercard. “We are proud to work with a brand that champions financial empowerment, and we look forward to bringing new products, services and capabilities to complement the strong value proposition Citizens provides to consumers and businesses.” “Citizens’ recent growth has been fueled by our development of new and innovative customer-centric capabilities,” said Brendan Coughlin, Head of Consumer Banking at Citizens. “Customer expectations around payments are rapidly increasing, and our expanded partnership with Mastercard enables us to accelerate our market position and provide customers with industry-leading solutions and experiences.” Strengthening and Supporting U.S. Communities Together, Mastercard and Citizens will enable consumers and businesses with greater financial access, benefits and experiences. Citizens will leverage Mastercard’s network, technology and services to develop innovative new products and features to support consumer and business payments offerings: Empowering small businesses: using unique and specialized tools and resources needed to thrive, Citizens will work with Mastercard to support the health and growth of small businesses in the communities they serve. Increasing financial access: leveraging Mastercard’s open banking technology, Citizens will provide consumers and businesses with greater financial access and control over their data. Delivering trust in today’s digital economy: with Mastercard’s leading digital identity solutions, Citizens’ consumer and business customers will benefit from cutting edge authentication and fraud mitigation tools. Accelerating innovation: Citizens and Mastercard will collaborate to foster advancements in payments technologies, fraud prevention tools and open banking to benefit consumers in the communities where they live and work. Commercial digitization: Citizens will utilize Mastercard’s commercial solutions to intelligently optimize and streamline business-to-business payments for today’s digital environment. Scaling inclusive payment experiences: with a shared goal to provide choice and optionality to consumers, Citizens and Mastercard will partner to drive inclusive growth across channels and products for customers. Connecting Citizens customers to Priceless Experiences: aligning passion and purpose, Citizens customers will receive exclusive access to iconic events, Priceless experiences, and opportunities to participate in purpose-driven initiatives. Additional details around the partnerships and services availability, including details on new customer cards, will be released later this year. About Citizens Financial Group, Inc. Citizens Financial Group, Inc. is one of the nation’s oldest and largest financial institutions, with $226.7 billion in assets as of December 31, 2022. Headquartered in Providence, Rhode Island, Citizens offers a broad range of retail and commercial banking products and services to individuals, small businesses, middle-market companies, large corporations and institutions. Citizens helps its customers reach their potential by listening to them and by understanding their needs in order to offer tailored advice, ideas and solutions. In Consumer Banking, Citizens provides an integrated experience that includes mobile and online banking, a full-service customer contact center and the convenience of approximately 3,400 ATMs and more than 1,100 branches in 14 states and the District of Columbia. Consumer Banking products and services include a full range of banking, lending, savings, wealth management and small business offerings. In Commercial Banking, Citizens offers a broad complement of financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, interest rate and commodity risk management solutions, as well as loan syndication, corporate finance, merger and acquisition, and debt and equity capital markets capabilities. More information is available at www.citizensbank.com or visit us on Twitter, LinkedIn or Facebook. About Mastercard Mastercard (NYSE: MA) is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and network, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com",
    "url": "https://www.businesswire.com/news/home/20230119005219/en/Mastercard-and-Citizens-Financial-Group-Announce-Exclusive-Payments-Partnership",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-19T09:00:00-05:00",
    "date_et": "2023-01-19"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-19 09:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard and Citizens Financial Group Announce Exclusive Payments Partnership",
    "image": "https://images.financialmodelingprep.com/news/mastercard-and-citizens-financial-group-announce-exclusive-payments-partnership-20230119.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y. & PROVIDENCE, R.I.--( BUSINESS WIRE )--Mastercard and Citizens today announced an expanded partnership, making Mastercard the exclusive payments network across Citizens' credit, debit and commercial portfolios, as well as services provider in the U.S. With shared values and vision, Citizens and Mastercard are united in the goal to provide access, inclusion and innovation to the communities they serve.",
    "url": "https://www.businesswire.com/news/home/20230119005219/en/Mastercard-and-Citizens-Financial-Group-Announce-Exclusive-Payments-Partnership/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-19T09:00:00-05:00",
    "date_et": "2023-01-19"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-19 10:11:11",
    "publisher": "PYMNTS",
    "title": "Citizens and Mastercard Expand Partnership to Develop New Solutions",
    "image": "https://images.financialmodelingprep.com/news/citizens-and-mastercard-expand-partnership-to-develop-new-solutions-20230119.jpg",
    "site": "pymnts.com",
    "text": "Aiming to speed its innovation, Citizens Financial Group has made Mastercard its exclusive payments provider. In a newly expanded partnership, Mastercard has become the bank's exclusive services provider and payment network across Citizen's credit, debit and commercial portfolios, the companies said in a Thursday (Jan. 19) press release.",
    "url": "https://www.pymnts.com/partnerships/2023/citizens-and-mastercard-expand-partnership-to-develop-new-solutions/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-19T10:11:11-05:00",
    "date_et": "2023-01-19"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-20 18:03:04",
    "publisher": "Zacks Investment Research",
    "title": "Is Visa Stock a Buy Going into Earnings?",
    "image": "https://images.financialmodelingprep.com/news/is-visa-stock-a-buy-going-into-earnings-20230120.jpg",
    "site": "zacks.com",
    "text": "Visa is a powerhouse in the payments technology industry, dominating its closest competitor Mastercard MA, with more than 50% greater payments volume",
    "url": "https://www.zacks.com/stock/news/2042194/is-visa-stock-a-buy-going-into-earnings",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-20T18:03:04-05:00",
    "date_et": "2023-01-20"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-22 09:15:00",
    "publisher": "The Motley Fool",
    "title": "3 Top Growth Stocks That Are Screaming Buys Right Now",
    "image": "https://images.financialmodelingprep.com/news/3-top-growth-stocks-that-are-screaming-buys-right-20230122.jpg",
    "site": "fool.com",
    "text": "These stocks have what it takes to continue their track record of steady growth.",
    "url": "https://www.fool.com/investing/2023/01/22/3-top-growth-stocks-that-are-screaming-buys-right/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-22T09:15:00-05:00",
    "date_et": "2023-01-22"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-23 11:17:40",
    "publisher": "Zacks Investment Research",
    "title": "Can Mastercard (MA) Sustain Its Beat Streak in Q4 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/can-mastercard-ma-sustain-its-beat-streak-in-q4-20230123.jpg",
    "site": "zacks.com",
    "text": "Mastercard's (MA) fourth-quarter results are likely to reflect higher worldwide GDV, strong consumer spending and recovering cross-border volumes, partly offset by elevated operating costs.",
    "url": "https://www.zacks.com/stock/news/2042657/can-mastercard-ma-sustain-its-beat-streak-in-q4-earnings",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-23T11:17:40-05:00",
    "date_et": "2023-01-23"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-23 12:14:28",
    "publisher": "PYMNTS",
    "title": "Mastercard Helps Bahrain's EazyPay Expand eCommerce Offering",
    "image": "https://images.financialmodelingprep.com/news/mastercard-helps-bahrains-eazypay-expand-ecommerce-offering-20230123.jpg",
    "site": "pymnts.com",
    "text": "Mastercard is teaming up with Bahrain's EazyPay to enhance its eCommerce offerings. Under the new partnership, EazyPay will be powered by Mastercard Payment Gateway Services (MPGS), the companies announced in a Monday (Jan. 23) news release.",
    "url": "https://www.pymnts.com/news/ecommerce/2023/mastercard-helps-bahrain-eazypay-expand-ecommerce-offering/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-23T12:14:28-05:00",
    "date_et": "2023-01-23"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-24 15:15:47",
    "publisher": "Investopedia",
    "title": "Mastercard Profit and Revenue Growth Could Decelerate",
    "image": "https://images.financialmodelingprep.com/news/mastercard-profit-and-revenue-growth-could-decelerate-20230124.jpg",
    "site": "investopedia.com",
    "text": "Mastercard reports Q4 FY 2022 results before markets open on Jan. 26. Analysts expect profit and revenue to grow at the slowest pace in almost two years amid high inflation and FTC troubles.",
    "url": "https://www.investopedia.com/mastercard-earnings-preview-7098523?title=mastercard-profit-revenue-growth-could-decelerate-to-slowest-rate-in-years",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-24T15:15:47-05:00",
    "date_et": "2023-01-24"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 07:00:00",
    "publisher": "Forbes",
    "title": "Mastercard Stock Likely To Top The Earnings Consensus In Q4",
    "image": "https://images.financialmodelingprep.com/news/mastercard-stock-likely-to-top-the-earnings-consensus-in-20230125.jpg",
    "site": "forbes.com",
    "text": "We expect Mastercard to edge past the consensus estimates of earnings, while revenues will remain in line (just below) with the expectations.",
    "url": "https://www.forbes.com/sites/greatspeculations/2023/01/25/mastercard-stock-likely-to-top-the-earnings-consensus-in-q4/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T07:00:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 07:15:00",
    "publisher": "Seeking Alpha",
    "title": "5 Dividend Stocks To Hedge Against Inflation",
    "image": "https://images.financialmodelingprep.com/news/5-dividend-stocks-to-hedge-against-inflation-20230125.jpg",
    "site": "seekingalpha.com",
    "text": "In December 2022, the inflation rate in the U.S. was at 6.5%. For this reason, as an investor, you may ask how to hedge your investment portfolio against inflation.",
    "url": "https://seekingalpha.com/article/4571995-5-dividend-stocks-to-hedge-against-inflation",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T07:15:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 09:47:11",
    "publisher": "Zacks Investment Research",
    "title": "Is a Surprise Coming for Mastercard (MA) This Earnings Season?",
    "image": "https://images.financialmodelingprep.com/news/is-a-surprise-coming-for-mastercard-ma-this-earnings-20230125.jpg",
    "site": "zacks.com",
    "text": "Mastercard (MA) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season.",
    "url": "https://www.zacks.com/stock/news/2043927/is-a-surprise-coming-for-mastercard-ma-this-earnings-season",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T09:47:11-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 12:50:00",
    "publisher": "Business Wire",
    "title": "Mastercard extiende su acuerdo con la CONMEBOL Libertadores hasta el 2026 y suma a la CONMEBOL Libertadores Femenina a su porfolio de patrocinios en la región",
    "image": "https://images.financialmodelingprep.com/news/mastercard-extiende-su-acuerdo-con-la-conmebol-libertadores-hasta-20230125.jpg",
    "site": "businesswire.com",
    "text": "MIAMI--(BUSINESS WIRE)--Fortaleciendo el compromiso de la marca con el fútbol, sus fanáticos, y con la diversidad y la inclusión, Mastercard anuncia la renovación de su acuerdo de patrocinio con la CONMEBOL por cuatro años más, hasta el 2026. Como parte de sus esfuerzos por mejorar las experiencias dentro del deporte más popular del mundo, el patrocinio incluye la categoría de servicios financieros y servicios de pago de la CONMEBOL Libertadores y, por primera vez, la CONMEBOL Libertadores Femenina, las competencias de clubes más emblemáticas del fútbol en Sudamérica. La CONMEBOL Libertadores es el torneo más prestigioso a nivel clubes de fútbol de Sudamérica. Reúne a los clubes de mejor rendimiento de los diez países más populares de la región en este deporte. Se inicia en enero con la fase clasificatoria y va hasta noviembre, mes en el cual se llevará a cabo la final, con aproximadamente 156 partidos que se transmiten alrededor del mundo. “Para Mastercard, el fútbol es una pasión que no conoce fronteras y que une a las personas más allá de sus diferencias y geografías. El apoyo a la CONMEBOL es coherente con el compromiso de Mastercard de conectar a las personas con sus pasiones, desde el entusiasmo del gol hasta la alegría por la ocasión de un partido”, aseguró Roberto Ramírez Laverde, vicepresidente senior de marketing y comunicación de Mastercard para América Latina y el Caribe. Mastercard, como patrocinador oficial en la categoría de servicios financieros y servicios de pago de la CONMEBOL Libertadores y CONMEBOL Libertadores Femenina, trabajará a lo largo del año con la CONMEBOL para crear campañas y promociones de la mano de sus clientes, además de activaciones especiales y experiencias Priceless para los tarjetahabientes Mastercard y los apasionados del fútbol. “La CONMEBOL valora el respaldo de una compañía global como Mastercard a dos de sus torneos más importantes, la CONMEBOL Libertadores y la CONMEBOL Libertadores Femenina. Esta asociación es fruto de la visión compartida por la CONMEBOL y esta prestigiosa empresa acerca de la importancia de impulsar el fútbol sudamericano y hacer vivir a los fanáticos de todo el mundo una experiencia única”, señaló Alejandro Domínguez, Presidente de la CONMEBOL. Una marca que conecta En línea con sus esfuerzos inclusivos, se hace un reconocimiento expreso al desempeño deportivo de las mujeres futbolistas y un aporte evidente de Mastercard a la igualdad de oportunidades en el deporte. Este nuevo patrocinio de la CONMEBOL Libertadores Femenina se suma al patrocinio de la CONMEBOL Copa América Femenina, donde Brasil se coronó campeón en la edición que recién se llevó a cabo en Colombia en 2022. Fortaleciendo así también el trabajo que viene realizando la CONMEBOL para seguir haciendo crecer al fútbol femenino en todas sus categorías y reforzando su campaña FÚTBOL ES FÚTBOL: no importa quien juegue, todos sentimos la misma pasión. A través de esta sociedad con la CONMEBOL, este patrocinio forma parte del compromiso de Mastercard de apoyar el fútbol en la región y a las mujeres en distintos ámbitos y etapas de su vida, así como la igualdad en del deporte; y refleja su propósito de marca de conectar a las personas con posibilidades que no tienen precio. Para Mastercard, mejorar las condiciones del deporte femenino es una forma más de promover un futuro igualitario, y la igualdad de género es una condición necesaria para la construcción de una sociedad más justa y de una economía más próspera. Porque está demostrado que la participación de las mujeres en todos los ámbitos construye diversidad y eso mejora el rendimiento humano y económico de cualquier grupo social. La CONMEBOL Libertadores Femenina se integra al portafolio de patrocinios de Mastercard con la CONMEBOL en adición de la CONMEBOL Libertadores, CONMEBOL Copa América y CONMEBOL Copa América Femenina. Durante la última década, Mastercard ha desarrollado una de las carteras deportivas femeninas más completas a nivel mundial. Esta inversión incluye asociaciones en tenis, golf, fútbol y rugby, así como el patrocinio de jugadores, equipos y eventos. Acerca de Mastercard (NYSE:MA) Mastercard es una empresa de tecnología en la industria mundial de pagos. Nuestra misión es conectar e impulsar una economía digital inclusiva que beneficie a todos, en todas partes, haciendo que las transacciones sean seguras, sencillas, inteligentes y accesibles. Utilizando datos y redes protegidas, alianzas y pasión, nuestras innovaciones y soluciones ayudan a individuos, instituciones financieras, gobiernos y empresas a alcanzar su mayor potencial. Nuestro coeficiente de decencia o DQ, por sus siglas en inglés, impulsa nuestra cultura y todo lo que hacemos dentro y fuera de nuestra empresa. Con conexiones a lo largo de más de 210 países y territorios, estamos construyendo un mundo sostenible que abre a posibilidades que no tienen precio para todos. www.mastercard.com Acerca de CONMEBOL Fundada en 1916, la Confederación Sudamericana de Fútbol (CONMEBOL) es el órgano rector del fútbol sudamericano y la confederación continental de fútbol más antigua del mundo. La CONMEBOL, formada por diez asociaciones miembros, entre las que se encuentran Argentina, Bolivia, Brasil, Chile, Colombia, Ecuador, Paraguay, Perú, Uruguay y Venezuela, es responsable de la organización y gobernanza de los principales torneos internacionales de fútbol sudamericanos, como la CONMEBOL Copa América, la CONMEBOL Libertadores, la CONMEBOL Sudamericana y la CONMEBOL Recopa, entre otros.",
    "url": "https://www.businesswire.com/news/home/20230125005624/es/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T12:50:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 12:50:00",
    "publisher": "Business Wire",
    "title": "Mastercard renova patrocínio da CONMEBOL Libertadores até 2026 e inclui torneio feminino",
    "image": "https://images.financialmodelingprep.com/news/mastercard-renova-patrocnio-da-conmebol-libertadores-at-2026-e-20230125.jpg",
    "site": "businesswire.com",
    "text": "SÃO PAULO--(BUSINESS WIRE)--Reforçando o compromisso da marca com o futebol, seus fãs e diversidade e inclusão, a Mastercard anuncia a renovação de seu contrato de patrocínio com a CONMEBOL até 2026. Como parte de seus esforços para aprimorar as experiências dentro do esporte mais popular do mundo, o patrocínio engloba as categorias de serviços financeiros e serviços de pagamentos da CONMEBOL Libertadores e, pela primeira vez, também a CONMEBOL Libertadores Feminina – os campeonatos de futebol mais emblemáticos na América do Sul. A CONMEBOL Libertadores é o torneio mais prestigiado da América do Sul e reúne os clubes com melhor desempenho dos dez países da região mais apaixonada pelo futebol. A disputa começa em janeiro com a fase classificatória e vai até novembro, mês em que acontecerá a final, com mais de 150 partidas transmitidas para todo o mundo. “Para a Mastercard, o futebol é uma paixão que não conhece fronteiras e que une as pessoas para além de suas diferenças e geografias. O apoio à CONMEBOL é consistente com o compromisso da Mastercard de conectar as pessoas com suas paixões, desde a emoção do gol até a alegria da ocasião de uma partida”, disse Roberto Ramírez Laverde, Vice-Presidente Sênior de Marketing e Comunicação da Mastercard para a América Latina e o Caribe. A Mastercard, como patrocinadora oficial na categoria de serviços financeiros e serviços de pagamentos da CONMEBOL Libertadores e da CONMEBOL Libertadores Feminina, trabalhará junto à CONMEBOL ao longo do ano para criar campanhas e promoções com seus clientes, além de ativações especiais e experiências Priceless para portadores de cartões Mastercard e fãs de futebol. “A CONMEBOL valoriza o apoio de uma empresa global como a Mastercard para dois de seus torneios mais importantes, a CONMEBOL Libertadores e a CONMEBOL Libertadores Feminina. Esta associação é o resultado da visão que a CONMEBOL tem em comum com essa prestigiada empresa sobre a importância de promover o futebol sul-americano e proporcionar aos torcedores de todo o mundo uma experiência única”, disse Alejandro Domínguez, Presidente da CONMEBOL. Uma marca que conecta Alinhados com seus esforços inclusivos, o desempenho esportivo das jogadoras de futebol feminino e a clara contribuição da Mastercard para a igualdade de oportunidades no esporte já são amplamente reconhecidos. Este novo patrocínio da CONMEBOL Libertadores Feminina se soma ao patrocínio da CONMEBOL Copa América Feminina, na qual o Brasil sagrou-se campeão na edição de 2022, na Colômbia. A parceria também fortalece o trabalho que a CONMEBOL vem realizando para continuar desenvolvendo o futebol feminino em todas as suas categorias e reforça sua campanha FUTEBOL É FUTEBOL: não importa quem joga, todos sentimos a mesma paixão. Já para a Mastercard, esse patrocínio faz parte do compromisso da empresa em apoiar o futebol da região e as mulheres em diferentes áreas e fases de suas vidas, bem como a igualdade no esporte; e reflete o propósito de sua marca de conectar pessoas com possibilidades que não têm preço. Melhorar as condições do esporte feminino é mais uma forma de promover um futuro igualitário, e a equidade de gênero é condição necessária para a construção de uma sociedade mais justa e de uma economia mais próspera – é o que acredita a Mastercard. É fato comprovado que a participação da mulher em todos os âmbitos constrói a diversidade e melhora o desempenho humano e econômico de qualquer grupo social. Na última década, a Mastercard desenvolveu um dos portfólios esportivos femininos mais abrangentes do mundo. Esse investimento inclui parcerias no tênis, golfe, futebol e rugby, bem como patrocínios de jogadoras, times e eventos. A CONMEBOL Libertadores Feminina se soma aos patrocínios da Mastercard com a CONMEBOL, além da CONMEBOL Libertadores, CONMEBOL Copa América e CONMEBOL Copa América Feminina. Sobre a Mastercard A Mastercard é uma empresa global de tecnologia do setor de pagamentos. Nossa missão é conectar e impulsionar uma economia digital inclusiva que beneficie a todos, em todos os lugares, tornando as transações seguras, simples, inteligentes e acessíveis. Usando dados e redes seguras, parcerias e paixão, as nossas inovações e soluções ajudam indivíduos, instituições financeiras, governos e empresas a alcançar seu maior potencial. Nosso quociente de decência, ou DQ, impulsiona a nossa cultura e tudo o que fazemos dentro e fora de nossa empresa. Com conexões em mais de 210 países e territórios, estamos construindo um mundo sustentável que abre possibilidades Priceless para todos. Sobre a CONMEBOL Fundada em 1916, a Confederação Sul-Americana de Futebol (CONMEBOL) é o órgão dirigente do futebol sul-americano e a mais antiga confederação continental de futebol do mundo. A CONMEBOL, formada por dez associações-membro, incluindo Argentina, Bolívia, Brasil, Chile, Colômbia, Equador, Paraguai, Peru, Uruguai e Venezuela, é responsável pela organização e governança dos principais torneios internacionais de futebol da América do Sul, como o CONMEBOL Copa América, CONMEBOL Libertadores, CONMEBOL Sul-Americana e CONMEBOL Recopa, entre outros.",
    "url": "https://www.businesswire.com/news/home/20230125005625/pt/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T12:50:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 12:50:00",
    "publisher": "Business Wire",
    "title": "Mastercard extends its sponsorship agreement for CONMEBOL Libertadores through 2026 and adds CONMEBOL Libertadores Femenina to its regional sponsorship portfolio",
    "image": "https://images.financialmodelingprep.com/news/mastercard-extends-its-sponsorship-agreement-for-conmebol-libertadores-through-2026-20230125.jpg",
    "site": "businesswire.com",
    "text": "MIAMI--(BUSINESS WIRE)--Strengthening the brand’s commitment to football, its fanbase, and diversity and inclusion, Mastercard announces the renewal of its sponsorship agreement with CONMEBOL (Confederación Sudamericana de Fútbol) for four more years, through 2026. As part of its effort to elevate experiences around the world’s most popular sport, the sponsorship includes the financial services and payment services category of CONMEBOL Libertadores, and for the first time CONMEBOL Libertadores Femenina, the most emblematic football club competitions in South America. CONMEBOL Libertadores is the most prestigious football club tournament in South America. It brings together the best performing clubs from the ten most popular countries in the region in this sport. It begins in January with the qualifying phase and runs until November, when the final takes place, with approximately 156 matches that are broadcasted around the world. “For Mastercard, football is a passion that transcends boundaries and unites people around the world beyond differences and geographic borders. Supporting CONMEBOL is consistent with Mastercard's commitment to connect people with their passions, from the excitement of a goal to the sheer joy of a match,” said Roberto Ramírez Laverde, Senior Vice President of Marketing and Communications for Latin America and the Caribbean. Mastercard, as the official sponsor in the financial services and payment services category of CONMEBOL Libertadores and CONMEBOL Libertadores Femenina, will work throughout the year with CONMEBOL to create campaigns and promotions for its customers, as well as special activations and Priceless experiences for Mastercard cardholders and football fans. “CONMEBOL values the support of a global company like Mastercard for two of its most important tournaments, the CONMEBOL Libertadores and the CONMEBOL Libertadores Femenina. This partnership is the result of a shared vision by CONMEBOL and this prestigious company on the importance of supporting South American football and giving fans around the world a unique experience”, said Alejandro Domínguez, President of CONMEBOL. A brand that connects In line with its inclusion efforts, this is an explicit recognition of the sporting performance of female football players and a clear contribution by Mastercard to equal opportunities in sports. This new sponsorship of CONMEBOL Libertadores Femenina is added to the sponsorship of the CONMEBOL Copa América Femenina, where Brazil was crowned champion in the most recent edition held in Colombia in 2022. This also strengthens the work that CONMEBOL has been doing to continue growing women’s football in all its categories and reinforcing its FOOTBALL IS FOOTBALL campaign: no matter who plays, we all feel the same passion. Through this partnership with CONMEBOL, Mastercard reinforces its commitment to support football in the region and women in different areas and stages of their lives, as well as equality in sports; and reflects its brand purpose of connecting people with priceless possibilities. For Mastercard, improving conditions for women's sports is one more way to promote an equal future, and gender equality is a necessary condition for building a better society and a more prosperous economy. Because it is a fact that the participation of women in all areas creates diversity, which improves the human and economic performance of any social group. CONMEBOL Libertadores Femenina is now part of Mastercard's sponsorship portfolio with CONMEBOL, which includes CONMEBOL Libertadores, CONMEBOL Copa América and CONMEBOL Copa América Femenina. Over the past decade, Mastercard has developed one of the most well-rounded women’s sports portfolios globally. This investment includes partnerships across tennis, golf, soccer, and rugby, as well as sponsoring players, teams, and events. About Mastercard (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com About CONMEBOL Founded in 1916, the South American Soccer Confederation (CONMEBOL) is the governing body of South American football and the oldest continental football confederation in the world. CONMEBOL, made up of ten member associations, including Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay and Venezuela, is responsible for the organization and governance of the main international football tournaments in South America, such as the CONMEBOL Copa América, the CONMEBOL Libertadores, the CONMEBOL Sudamericana and the CONMEBOL Recopa, among others.",
    "url": "https://www.businesswire.com/news/home/20230125005623/en/Mastercard-extends-its-sponsorship-agreement-for-CONMEBOL-Libertadores-through-2026-and-adds-CONMEBOL-Libertadores-Femenina-to-its-regional-sponsorship-portfolio",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T12:50:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 12:50:00",
    "publisher": "Business Wire",
    "title": "Mastercard extends its sponsorship agreement for CONMEBOL Libertadores through 2026 and adds CONMEBOL Libertadores Femenina to its regional sponsorship portfolio",
    "image": "https://images.financialmodelingprep.com/news/mastercard-extends-its-sponsorship-agreement-for-conmebol-libertadores-through-20230125.jpg",
    "site": "businesswire.com",
    "text": "MIAMI--( BUSINESS WIRE )--Strengthening the brand's commitment to football, its fanbase, and diversity and inclusion, Mastercard announces the renewal of its sponsorship agreement with CONMEBOL (Confederación Sudamericana de Fútbol) for four more years, through 2026. As part of its effort to elevate experiences around the world's most popular sport, the sponsorship includes the financial services and payment services category of CONMEBOL Libertadores, and for the first time CONMEBOL Libertadores Femenina, the most emblematic football club competitions in South America.",
    "url": "https://www.businesswire.com/news/home/20230125005623/en/Mastercard-extends-its-sponsorship-agreement-for-CONMEBOL-Libertadores-through-2026-and-adds-CONMEBOL-Libertadores-Femenina-to-its-regional-sponsorship-portfolio/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T12:50:00-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 15:46:54",
    "publisher": "PYMNTS",
    "title": "ZoodPay and Mastercard Launch Virtual BNPL Card",
    "image": "https://images.financialmodelingprep.com/news/zoodpay-and-mastercard-launch-virtual-bnpl-card-20230125.jpg",
    "site": "pymnts.com",
    "text": "ZoodPay and Mastercard have teamed up to launch a prepaid virtual installment card. The new card was announced in a joint press release on Monday (Jan. 23), and will allow ZoodPay to scale its offerings and provide BNPL solutions to customers and merchants without being restricted to the ZoodPay network.",
    "url": "https://www.pymnts.com/buy-now-pay-later/2023/zoodpay-and-mastercard-launch-virtual-bnpl-card/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T15:46:54-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 16:30:34",
    "publisher": "InvestorPlace",
    "title": "Thursday Predictions: 3 Hot Stocks for Tomorrow",
    "image": "https://images.financialmodelingprep.com/news/thursday-predictions-3-hot-stocks-for-tomorrow-20230125.png",
    "site": "investorplace.com",
    "text": "What are the hot stocks for tomorrow, Thursday, Jan. 25? You probably already know that the headlines are going to be dominated by earnings.",
    "url": "https://investorplace.com/2023/01/thursday-predictions-3-hot-stocks-for-tomorrow-2/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T16:30:34-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-25 17:20:55",
    "publisher": "Investor's Business Daily",
    "title": "Visa, Mastercard Earnings Face Tough Inflation/Recession Squeeze",
    "image": "https://images.financialmodelingprep.com/news/visa-mastercard-earnings-face-tough-inflationrecession-squeeze-20230125.jpg",
    "site": "investors.com",
    "text": "Mastercard stock edged up ahead of Q4 earnings results due early Thursday while Visa stock traded sideways prior to its fiscal Q1 2023 report after the bell. The post Visa, Mastercard Earnings Face Tough Inflation/Recession Squeeze appeared first on Investor's Business Daily.",
    "url": "https://www.investors.com/news/visa-stock-mastercard-report-earnings/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-25T17:20:55-05:00",
    "date_et": "2023-01-25"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 06:42:00",
    "publisher": "The Motley Fool",
    "title": "Better Buy: Mastercard vs. Visa Stock",
    "image": "https://images.financialmodelingprep.com/news/better-buy-mastercard-vs-visa-stock-20230126.jpg",
    "site": "fool.com",
    "text": "Which payment processing giant should investors put their money behind?",
    "url": "https://www.fool.com/investing/2023/01/26/better-buy-mastercard-vs-visa-stock/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T06:42:00-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 08:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Fourth Quarter and Full Year 2022 Financial Results Available on Company’s Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-fourth-quarter-and-full-year-2022-financial-results-20230126.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its fourth quarter and full year 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 1-888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 1-800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.",
    "url": "https://www.businesswire.com/news/home/20230125005897/en",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T08:00:00-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 08:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Fourth Quarter and Full Year 2022 Financial Results Available on Company’s Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-fourth-quarter-and-full-year-2022-financial-results-available-20230126.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard Incorporated (NYSE: MA) today announced its fourth quarter and full year 2022 financial results through an earnings release available on the company’s Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here. At 9:00 a.m. ET today, the company will host a conference call to discuss these financial results. Conference Call Details: Toll-free dial-in: 1-888-330-2508 Toll dial-in: 1-240-789-2735 Conference ID: 6451878 A replay of the call will be available for 30 days using the following dial-in: Toll-free dial-in: 1-800-770-2030 Toll dial-in: 1-647-362-9199 Conference ID: 6451878 The webcast recording and all related materials can also be accessed at investor.mastercard.com. About Mastercard Incorporated (NYSE: MA), www.mastercard.com Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.",
    "url": "https://www.businesswire.com/news/home/20230125005897/en/Mastercard-Incorporated-Fourth-Quarter-and-Full-Year-2022-Financial-Results-Available-on-Company%E2%80%99s-Website",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T08:00:00-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 08:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard Incorporated Fourth Quarter and Full Year 2022 Financial Results Available on Company's Website",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-fourth-quarter-and-full-year-2022-financial-20230126.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--( BUSINESS WIRE )--Mastercard Incorporated (NYSE: MA) today announced its fourth quarter and full year 2022 financial results through an earnings release available on the company's Investor Relations website at investor.mastercard.com. The earnings release will be furnished with the Securities and Exchange Commission (SEC) on a Form 8-K and available here.",
    "url": "https://www.businesswire.com/news/home/20230125005897/en/Mastercard-Incorporated-Fourth-Quarter-and-Full-Year-2022-Financial-Results-Available-on-Company%E2%80%99s-Website/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T08:00:00-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 08:14:00",
    "publisher": "Market Watch",
    "title": "Mastercard earnings top expectations amid ‘remarkably resilient' spending",
    "image": "https://images.financialmodelingprep.com/news/mastercard-earnings-top-expectations-amid-remarkably-resilient-spending-20230126.jpg",
    "site": "marketwatch.com",
    "text": "Mastercard Inc. kicked off a busy stretch for payments earnings Thursday morning, beating earnings expectations for its latest quarter amid continued strength in consumer spending.",
    "url": "https://www.marketwatch.com/story/mastercard-earnings-top-expectations-amid-remarkably-resilient-spending-11674738868",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T08:14:00-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 12:02:07",
    "publisher": "Zacks Investment Research",
    "title": "Q4 GDP Higher Than Expected",
    "image": "https://images.financialmodelingprep.com/news/q4-gdp-higher-than-expected-20230126.jpg",
    "site": "zacks.com",
    "text": "Q4 GDP Higher Than Expected",
    "url": "https://www.zacks.com/stock/news/2044882/q4-gdp-higher-than-expected",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T12:02:07-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 12:02:11",
    "publisher": "Zacks Investment Research",
    "title": "Q4 GDP +2.8%, Jobless Claims Down to +186K & More",
    "image": "https://images.financialmodelingprep.com/news/q4-gdp-28-jobless-claims-down-to-186k-more-20230126.jpg",
    "site": "zacks.com",
    "text": "Initial Jobless Claims continue to dwindle, even in the face of prominent companies laying off tens of thousands of employees over the past several weeks.",
    "url": "https://www.zacks.com/stock/news/2044878/q4-gdp-2-8-jobless-claims-down-to-186k-more",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T12:02:11-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 12:17:55",
    "publisher": "PYMNTS",
    "title": "Mastercard Spending Lifted by X-Border Travel Rebound but Slowdown Looms",
    "image": "https://images.financialmodelingprep.com/news/mastercard-spending-lifted-by-xborder-travel-rebound-but-slowdown-20230126.jpg",
    "site": "pymnts.com",
    "text": "Slower volume growth is in the cards, but consumers are still spending. Mastercard's latest earnings results show at least some nod to economic uncertainty that lies ahead, but the rise of digital payments, and contactless payments in particular, remains unimpeded.",
    "url": "https://www.pymnts.com/mastercard/2023/mastercard-spending-lifted-cross-border-travel-rebound-slowdown-looms/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T12:17:55-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 13:32:04",
    "publisher": "Seeking Alpha",
    "title": "Mastercard Incorporated (MA) Q4 2022 Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/mastercard-incorporated-ma-q4-2022-earnings-call-transcript-20230126.jpg",
    "site": "seekingalpha.com",
    "text": "Mastercard Incorporated (NYSE:MA ) Q4 2022 Results Conference Call January 26, 2023 9:00 AM ET Company Participants Warren Kneeshaw - Head, IR Michael Miebach - CEO Sachin Mehra - CFO Conference Call Participants Harshita Rawat - Bernstein Darrin Peller - Wolfe Research Lisa Ellis - SVB MoffettNathanson Tien-Tsin Huang - JPMorgan Sanjay Sakhrani - KBW Jason Kupferberg - Bank of America Will Nance - Goldman Sachs David Togut - Evercore ISI Ashwin Shirvaikar - Citi Ken Suchoski - Autonomous Research Dave Koning - Baird Operator Good morning. My name is Audra, and I will be your conference operator today.",
    "url": "https://seekingalpha.com/article/4572706-mastercard-incorporated-ma-q4-2022-earnings-call-transcript",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T13:32:04-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-26 13:33:14",
    "publisher": "Zacks Investment Research",
    "title": "Mastercard's (MA) Q4 Earnings Beat on Resilient Spending",
    "image": "https://images.financialmodelingprep.com/news/mastercards-ma-q4-earnings-beat-on-resilient-spending-20230126.jpg",
    "site": "zacks.com",
    "text": "Mastercard (MA) projects net revenues for 2023 to witness low-teens growth.",
    "url": "https://www.zacks.com/stock/news/2044931/mastercard-s-ma-q4-earnings-beat-on-resilient-spending",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-26T13:33:14-05:00",
    "date_et": "2023-01-26"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-27 07:15:00",
    "publisher": "Seeking Alpha",
    "title": "Mastercard And Visa: One Of These No-Brainer Blue Chips Is A Better Buy",
    "image": "https://images.financialmodelingprep.com/news/mastercard-and-visa-one-of-these-nobrainer-blue-chips-20230127.jpg",
    "site": "seekingalpha.com",
    "text": "Mastercard and Visa are arguably the two best businesses on earth. They're toll-booth operators for the entire global economy. Both are hyper-growth no-brainer blue-chip buys with a decades-long growth runway and insane profitability that keeps getting better over time.",
    "url": "https://seekingalpha.com/article/4572310-mastercard-and-visa-one-of-these-no-brainer-blue-chips-is-a-better-buy",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-27T07:15:00-05:00",
    "date_et": "2023-01-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-27 08:17:13",
    "publisher": "Zacks Investment Research",
    "title": "MasterCard (MA) Reports Q4 Earnings: What Key Metrics Have to Say",
    "image": "https://images.financialmodelingprep.com/news/mastercard-ma-reports-q4-earnings-what-key-metrics-have-20230127.jpg",
    "site": "zacks.com",
    "text": "While the top- and bottom-line numbers for MasterCard (MA) give a sense of how the business performed in the quarter ended December 2022, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.",
    "url": "https://www.zacks.com/stock/news/2045294/mastercard-ma-reports-q4-earnings-what-key-metrics-have-to-say",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-27T08:17:13-05:00",
    "date_et": "2023-01-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-27 09:21:57",
    "publisher": "The Motley Fool",
    "title": "What Mastercard's Earnings Show About the Economy",
    "image": "https://images.financialmodelingprep.com/news/what-mastercards-earnings-show-about-the-economy-20230127.jpg",
    "site": "fool.com",
    "text": "Mastercard sees a far prettier picture of the global economy than most.",
    "url": "https://www.fool.com/investing/2023/01/27/what-mastercards-earnings-show-about-the-economy/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-27T09:21:57-05:00",
    "date_et": "2023-01-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-27 13:54:51",
    "publisher": "CNBC",
    "title": "Here's the real reason why American Express gives out such big rewards",
    "image": "https://images.financialmodelingprep.com/news/heres-the-real-reason-why-american-express-gives-out-20230127.jpg",
    "site": "cnbc.com",
    "text": "Amex targets affluent cardholders through a \"spend-centric\" model that focuses on generating revenue by driving spending on its cards.",
    "url": "https://www.cnbc.com/2023/01/27/heres-the-real-reason-why-american-express-gives-out-such-big-rewards.html",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-27T13:54:51-05:00",
    "date_et": "2023-01-27"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-29 23:34:55",
    "publisher": "Seeking Alpha",
    "title": "Which Is Better - Visa Or Mastercard",
    "image": "https://images.financialmodelingprep.com/news/which-is-better-visa-or-mastercard-20230129.jpg",
    "site": "seekingalpha.com",
    "text": "Visa and Mastercard share a lot of similarities. Several things differentiate Visa and Mastercard, and investors can pick accordingly based on their investment philosophies.",
    "url": "https://seekingalpha.com/article/4573413-visa-mastercard-stock-gain-exposure-fintech-bullish-stance",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-29T23:34:55-05:00",
    "date_et": "2023-01-29"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-30 18:43:39",
    "publisher": "InvestorPlace",
    "title": "How to Play Growing Market Strength",
    "image": "https://images.financialmodelingprep.com/news/how-to-play-growing-market-strength-20230130.jpg",
    "site": "investorplace.com",
    "text": "The S&P is flashing green",
    "url": "https://investorplace.com/2023/01/how-to-play-growing-market-strength/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-30T18:43:39-05:00",
    "date_et": "2023-01-30"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-01-31 12:25:16",
    "publisher": "Forbes",
    "title": "Mastercard Exceeded Earnings Expectations, But Will Consumer Spending Remain Resilient?",
    "image": "https://images.financialmodelingprep.com/news/mastercard-exceeded-earnings-expectations-but-will-consumer-spending-remain-20230131.jpg",
    "site": "forbes.com",
    "text": "Mastercard's executives are excited about 2023, but the company's investors aren't. Here's the view from both sides of the boardroom.",
    "url": "https://www.forbes.com/sites/qai/2023/01/31/mastercard-exceeded-earnings-expectations-but-will-consumer-spending-remain-resilient/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-01-31T12:25:16-05:00",
    "date_et": "2023-01-31"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-01 09:30:00",
    "publisher": "Business Wire",
    "title": "Mastercard Launches She Runs This Program Celebrating Entrepreneurship for Black Women in Business and Hip-Hop During GRAMMY® Week",
    "image": "https://images.financialmodelingprep.com/news/mastercard-launches-she-runs-this-program-celebrating-entrepreneurship-for-black-20230201.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y.--(BUSINESS WIRE)--Today, Mastercard announced it will host She Runs This: Celebrating Entrepreneurship in Business and Hip-Hop, a three-day event in partnership with Femme It Forward, honoring the genre’s 50th anniversary as part of the brand’s programming during GRAMMY® Week. A holistic campaign inclusive of an immersive “Small Business City” in Meta Horizon Worlds, a TikTok challenge, the kickoff of a Fearless Fund grant contest and a national ad campaign will further the brand’s impact on helping Black women entrepreneurs thrive. According to recent Mastercard research, 80% of U.S. women entrepreneurs, solo-preneurs, small business owners and content Creators report having financial challenges*. Recognizing the universal obstacles entrepreneurs face, and the increased challenge of succeeding in the face of racism and bias, Mastercard is honoring Hip-Hop’s 50th Anniversary by helping equip Black women entrepreneurs with the financial tools, resources and education needed to successfully accomplish their dreams. “Like the musical talent who shaped Hip-Hop, Black women small business owners continue to embrace the power of perseverance, going above and beyond to achieve their dreams and empower their communities, despite facing deep-rooted inequalities,” said Rustom Dastoor, EVP of Marketing and Communications, Mastercard North America. “We are proud to support these fearless Black women artists and business owners in their pursuit of redefining what’s possible, and we’re excited to watch them take their stage, follow their passions and thrive.” In celebration of the GRAMMY Awards® and the 50th Anniversary of Hip-Hop, Mastercard is launching a variety of Priceless engagements and shoppable activations to support Black women small business owners (SBOs), empower their communities, and inspire consumers to shop and support their businesses. She Runs This: Celebrating Entrepreneurship in Business and Hip-Hop: Beginning Thursday, February 2 and running through Saturday, February 4, Black women owned small businesses in Los Angeles will host invited guests for dynamic discussions about entrepreneurship for women in business and hip-hop with music icons such as MC Lyte, Lil Kim, Salt-N-Pepa, and Yo-Yo as well as emerging artists such as Jozzy, Baby Tate, and Coi Leray; and a special appearance by Mastercard ambassador Jennifer Hudson. “Small Business City:” Mastercard’s virtual reality experience in Meta Horizon Worlds will spotlight Black women SBOs to inspire and educate a future generation, providing networking opportunities and tools for success. Mastercard Striver and co-creator of Small Business City RhondaX will discuss her thriving career as a creator in the Web3 space on The Jennifer Hudson Show. Mastercard Striver and co-creator of Small Business City RhondaX will discuss her thriving career as a creator in the Web3 space on The Jennifer Hudson Show. TikTok Challenge: A TikTok challenge, kicked off by Jennifer Hudson will invite SBOs to share what makes them a small business superstar with a “drop the mic” moment. SBOs will be able to stitch their responses and pass the mic to the next participant, with Mastercard’s sonic melody as the backing track. Small Business Marketplaces: Mastercard has collaborated with Amazon to promote Black women owned small businesses, setting the stage for the SBOs to share the origin stories of their brands on Amazon Live where they can connect directly with customers via an interactive live chat. Consumers can also discover a reimagined shoppable social experience of products from exclusively Black women-owned small businesses from across the country directly on Pinterest. Fearless Strivers Grant Contest: Mastercard has once again extended its partnership with Fearless Fund, a with the Black women-owned venture capital fund built by women of color for women of color, to provide Black women SBOs across the country with $20,000 grants, digital tools and mentorship to help them build, protect and sustain their business through its third annual Fearless Strivers Grant Contest. This program is just one element of Mastercard’s growing music footprint. In January, in support of helping all creators reach their full potential, Mastercard announced the Mastercard Artist Accelerator Program, a Web3 collective that connects musicians, creators and fans to collaborate like never before. The development program will harness Web3 and blockchain technologies to prepare emerging artists from underrepresented communities with tools, skills and access to forge their own paths in the digital economy. Through mastercard.com/smallbiz visitors can learn about the financial tools, benefits and education that helps small businesses thrive and Start Something Priceless. People can also learn more about Mastercard’s $500 million investment in Black communities to help close the racial wealth and opportunity gap in the US by visiting Solidarity in Action. *According to Mastercard research, “creators” are defined as entrepreneurs, solo-preneurs, small business owners and content Creators with over 2,000 followers on Instagram, TikTok, LinkedIn, or Twitter or 500 followers on YouTube. The custom study was conducted by The Harris Poll in June 2022, fielded among 4,000 respondents in North America. ABOUT MASTERCARD (NYSE: MA) Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. www.mastercard.com ABOUT FEMME IT FORWARD A joint venture with Live Nation Entertainment, Femme It Forward is a female-led music and entertainment company that centers its mission in celebrating, educating, and empowering the industry’s most creative and accomplished female visionaries through multi-format, multi-market consumer experiences. Femme It Forward produces music festivals, concerts, original content, comedy shows, panels, college engagements, philanthropic endeavors, and more. For more information on Femme It Forward, visit FemmeItForward.com. For live updates and to join the conversation, follow #FemmeItForward on Twitter, Instagram and Facebook.",
    "url": "https://www.businesswire.com/news/home/20230201005638/en/Mastercard-Launches-She-Runs-This-Program-Celebrating-Entrepreneurship-for-Black-Women-in-Business-and-Hip-Hop-During-GRAMMY%C2%AE-Week",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-01T09:30:00-05:00",
    "date_et": "2023-02-01"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-01 15:33:54",
    "publisher": "PYMNTS",
    "title": "Mastercard Teams With Ayoconnect to Help Unbanked Indonesians",
    "image": "https://images.financialmodelingprep.com/news/mastercard-teams-with-ayoconnect-to-help-unbanked-indonesians-20230201.jpg",
    "site": "pymnts.com",
    "text": "Mastercard is working with open finance platform Ayoconnect to bolster financial inclusion in Indonesia.",
    "url": "https://www.pymnts.com/financial-inclusion-3/2023/mastercard-teams-with-ayoconnect-to-help-unbanked-indonesians/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-01T15:33:54-05:00",
    "date_et": "2023-02-01"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-01 16:51:51",
    "publisher": "Seeking Alpha",
    "title": "How To Allocate $20,000 Among 10 Dividend Income And Growth Stocks And ETFs",
    "image": "https://images.financialmodelingprep.com/news/how-to-allocate-20000-among-10-dividend-income-and-20230201.jpg",
    "site": "seekingalpha.com",
    "text": "The investment portfolio I have built for you in this article consists of 2 ETFs and 8 companies which I consider to be attractive in terms of risk and reward. I have built this investment portfolio in a way that gives you a Weighted Average Dividend Yield [TTM] of 3.04%.",
    "url": "https://seekingalpha.com/article/4574369-how-to-allocate-20000-among-10-dividend-growth-stocks-and-etfs",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-01T16:51:51-05:00",
    "date_et": "2023-02-01"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-02 11:41:42",
    "publisher": "Seeking Alpha",
    "title": "My Top 15 High-Growth Dividend Stocks For February 2023",
    "image": "https://images.financialmodelingprep.com/news/my-top-15-highgrowth-dividend-stocks-for-february-2023-20230202.jpg",
    "site": "seekingalpha.com",
    "text": "I present my top 15 high-growth dividend stocks to consider during the month of February. The watchlist posted a gain of 9.44% in January and starts the new year on a positive note.",
    "url": "https://seekingalpha.com/article/4574635-my-top-15-high-growth-dividend-stocks-february-2023",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-02T11:41:42-05:00",
    "date_et": "2023-02-02"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-03 06:04:00",
    "publisher": "The Motley Fool",
    "title": "Is This Red-Hot Growth Stock a Buy for Investors?",
    "image": "https://images.financialmodelingprep.com/news/is-this-redhot-growth-stock-a-buy-for-investors-20230203.jpg",
    "site": "fool.com",
    "text": "Alternative payments will only grow in prevalence, and this company should be a huge beneficiary.",
    "url": "https://www.fool.com/investing/2023/02/03/is-this-red-hot-growth-stock-a-buy-for-investors/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-03T06:04:00-05:00",
    "date_et": "2023-02-03"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-03 10:07:00",
    "publisher": "The Motley Fool",
    "title": "If You Want Tons of Passive Income in the Future , Buy These 2 Stocks",
    "image": "https://images.financialmodelingprep.com/news/if-you-want-tons-of-passive-income-in-the-20230203.jpg",
    "site": "fool.com",
    "text": "Good cash flows come to those who pick intelligently and wait.",
    "url": "https://www.fool.com/investing/2023/02/03/if-you-want-passive-income-buy-these-two-stocks/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-03T10:07:00-05:00",
    "date_et": "2023-02-03"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-04 07:29:00",
    "publisher": "The Motley Fool",
    "title": "Have $2,000? 2 Market-Crash-Ready Stocks to Buy",
    "image": "https://images.financialmodelingprep.com/news/have-2000-2-marketcrashready-stocks-to-buy-20230204.jpg",
    "site": "fool.com",
    "text": "These two stocks are blue chips that outperformed in the bear market.",
    "url": "https://www.fool.com/investing/2023/02/04/have-2000-2-market-crash-ready-stocks-to-buy/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-04T07:29:00-05:00",
    "date_et": "2023-02-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-04 09:31:00",
    "publisher": "The Motley Fool",
    "title": "Visa and Mastercard Show Once Again Why Hyperinflation Fears Are Overblown",
    "image": "https://images.financialmodelingprep.com/news/visa-and-mastercard-show-once-again-why-hyperinflation-fears-20230204.jpg",
    "site": "fool.com",
    "text": "Follow the data instead of doomsayers when analyzing the rate of inflation in the United States.",
    "url": "https://www.fool.com/investing/2023/02/04/visa-and-mastercard-show-once-again-why-hyperinfla/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-04T09:31:00-05:00",
    "date_et": "2023-02-04"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-06 07:16:26",
    "publisher": "MarketBeat",
    "title": "What do Mastercard Earnings Indicate About Consumer Spending?",
    "image": "https://images.financialmodelingprep.com/news/what-do-mastercard-earnings-indicate-about-consumer-spending-20230206.jpg",
    "site": "marketbeat.com",
    "text": "Global credit card network provider Mastercard Inc. (NYSE: MA) stock a cup and handle breakout, but the upside may be limited with the news of the White House's proposed Junk Fee Prevention Act. Mastercard is the world's second-largest credit card network, with an estimated 23.7% market share behind Visa Inc. (NYSE: V) at 52.6%.",
    "url": "https://www.marketbeat.com/originals/what-do-mastercard-earnings-indicate-about-consumer-spending/?SNAPI",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-06T07:16:26-05:00",
    "date_et": "2023-02-06"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-07 13:00:00",
    "publisher": "The Motley Fool",
    "title": "2 Unstoppable Stocks to Buy in 2023 and Hold for the Next Decade",
    "image": "https://images.financialmodelingprep.com/news/2-unstoppable-stocks-to-buy-in-2023-and-hold-20230207.jpg",
    "site": "fool.com",
    "text": "Airbnb and Mastercard are cash-rich and profitable businesses making serious headway in a volatile market.",
    "url": "https://www.fool.com/investing/2023/02/07/2-unstoppable-stocks-to-buy-in-2023-and-hold-for-t/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-07T13:00:00-05:00",
    "date_et": "2023-02-07"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-09 04:00:00",
    "publisher": "Business Wire",
    "title": "Mastercard and Xsolla Level up the Gaming Experience",
    "image": "https://images.financialmodelingprep.com/news/mastercard-and-xsolla-level-up-the-gaming-experience-20230209.jpg",
    "site": "businesswire.com",
    "text": "PURCHASE, N.Y. & LOS ANGELES--(BUSINESS WIRE)--Today Mastercard and global video game commerce company Xsolla announced plans to collaborate on frictionless, secure, and rewarding payments for gamers — from enhanced checkout experiences using credit card loyalty points1 to simple in-game currency gifting to improved creator payout processes and more.",
    "url": "https://www.businesswire.com/news/home/20230209005189/en/Mastercard-and-Xsolla-Level-up-the-Gaming-Experience/",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-09T04:00:00-05:00",
    "date_et": "2023-02-09"
  },
  {
    "symbol": "MA",
    "publishedDate": "2023-02-09 09:48:58",
    "publisher": "Seeking Alpha",
    "title": "How To Allocate $5,000 Among 5 Dividend Income And Dividend Growth Stocks And ETFs",
    "image": "https://images.financialmodelingprep.com/news/how-to-allocate-5000-among-5-dividend-income-and-20230209.jpg",
    "site": "seekingalpha.com",
    "text": "In this article, I will show you a portfolio that consists of 5 picks that provide you with Dividend Income and Dividend Growth. When allocating $5,000 between 5 stocks, I would not recommend allocating the amount equally due to the higher risks that such an approach brings.",
    "url": "https://seekingalpha.com/article/4576755-allocate-5000-among-5-dividend-income-dividend-growth-stocks-etfs",
    "ticker": "MA",
    "event_date": "2023-01-26",
    "window_start": "2023-01-12",
    "window_end": "2023-02-09",
    "publishedDateET": "2023-02-09T09:48:58-05:00",
    "date_et": "2023-02-09"
  }
]