{"symbol": "XOM", "publishedDate": "2021-07-23 16:05:32", "publisher": "Zacks Investment Research", "title": "Exxon Mobil (XOM) Earnings Expected to Grow: What to Know Ahead of Next Week's Release", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-earnings-expected-to-grow-what-to-20210723.jpg", "site": "zacks.com", "text": "Exxon (XOM) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.", "url": "https://www.zacks.com/stock/news/1767021/exxon-mobil-xom-earnings-expected-to-grow-what-to-know-ahead-of-next-week-s-release", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-23T16:05:32-04:00", "date_et": "2021-07-23"}
{"symbol": "XOM", "publishedDate": "2021-07-24 06:10:00", "publisher": "The Motley Fool", "title": "Better Dividend Stock: ExxonMobil vs. Clearway Energy", "image": "https://images.financialmodelingprep.com/news/better-dividend-stock-exxonmobil-vs-clearway-energy-20210724.jpg", "site": "fool.com", "text": "The future is renewables, but fossil fuels remain the dominant source of energy. Should dividend investors focus on the future, or the present?", "url": "https://www.fool.com/investing/2021/07/24/better-dividend-stock-exxonmobil-vs-clearway-energ/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-24T06:10:00-04:00", "date_et": "2021-07-24"}
{"symbol": "XOM", "publishedDate": "2021-07-25 07:52:58", "publisher": "Seeking Alpha", "title": "Exxon Mobil: Time For XTO To Shine", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-time-for-xto-to-shine-20210725.jpg", "site": "seekingalpha.com", "text": "That XTO acquisition has more benefits than many realize. The Exxon Mobil activity is a contrarian indicator of the beginning of an industry recovery.", "url": "https://seekingalpha.com/article/4441235-exxon-mobil-time-for-xto-to-shine", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-25T07:52:58-04:00", "date_et": "2021-07-25"}
{"symbol": "XOM", "publishedDate": "2021-07-25 15:00:00", "publisher": "Barron's", "title": "Apple, Tesla, Amazon, Exxon Mobil, Pfizer, and Other Stocks to Watch This Week", "image": "https://images.financialmodelingprep.com/news/apple-tesla-amazon-exxon-mobil-pfizer-and-other-stocks-20210725.jpg", "site": "barrons.com", "text": "Second-quarter earnings season continues with results from Tesla, Apple, Microsoft, Amazon, Alphabet, Facebook, PayPal, Visa, T-Mobile, Pfizer, AMD, Exxon Mobil, and many more.", "url": "https://www.barrons.com/articles/apple-tesla-amazon-exxon-mobil-pfizer-and-other-stocks-for-investors-to-watch-this-week-51627239605", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-25T15:00:00-04:00", "date_et": "2021-07-25"}
{"symbol": "XOM", "publishedDate": "2021-07-26 08:00:00", "publisher": "Business Wire", "title": "ExxonMobil, SABIC Reach Mechanical Completion for Gulf Coast Growth Ventures Derivatives", "image": "https://images.financialmodelingprep.com/news/exxonmobil-sabic-reach-mechanical-completion-for-gulf-coast-growth-20210726.jpg", "site": "businesswire.com", "text": "IRVING, Texas & RIYADH, Saudi Arabia--(BUSINESS WIRE)--ExxonMobil and SABIC announced today that their joint venture, Gulf Coast Growth Ventures located near Corpus Christi, Texas, has reached mechanical completion of a monoethylene glycol unit and two polyethylene units. Project startup is expected to begin ahead of schedule, likely in the fourth quarter of 2021. “Gulf Coast Growth Ventures is a key development of our plan to serve growing demand for our high value performance products,” said Karen McKee, president of ExxonMobil Chemical Company. “This is truly a best-in-class project, as demonstrated in schedule acceleration and cost competitiveness, despite the many challenges related to the COVID-19 pandemic.” “We are very proud to bring GCGV one step closer to operations,” said Abdulrahman Al-Fageeh, SABIC’s executive vice president of petrochemicals. “Not only are we ahead of schedule, but we have executed this project with the highest commitment and emphasis on safety with nearly 18 million safe person-hours worked, all while acting on the promises we made to the community when we started this journey four years ago.” The project created more than 600 permanent jobs with average salaries of $90,000 per year. An additional 6,000 high-paying jobs were created during construction. The venture has generated more than $22 billion in economic output for the state of Texas during construction and is estimated to create $50 billion in economic benefits during the first six years of operation. The project, which includes a 1.8 million metric ton ethane steam cracker, is expected to be delivered under budget and approximately 25 percent less than the average cost of similar projects along the U.S. Gulf Coast. When completed, GCGV will produce 1,100 kilotons of monoethylene glycol and 1,300 kilotons of polyethylene per year. Monoethylene glycol is commonly used in the manufacturing of polyesters and automotive coolants, and as a building block to create various forms of high-performance plastics. Polyethylene is commonly used in protective film, packaging and bottles and containers that prolong the shelf-life of food and medicines, as well as in various automotive parts that improve fuel efficiency and performance, and in medical applications. Gulf Coast Growth Ventures expands the successful international relationship between ExxonMobil and SABIC, who have worked together in petrochemical ventures for more than 35 years. Ownership interests in the Gulf Coast Growth Ventures project is 50 percent ExxonMobil and 50 percent SABIC, with ExxonMobil as site operator. About ExxonMobil ExxonMobil, one of the largest publicly traded international energy companies, uses technology and innovation to help meet the world’s growing energy needs. ExxonMobil holds an industry-leading inventory of resources, is one of the largest refiners and marketers of petroleum products, and its chemical company is one of the largest in the world. To learn more, visit exxonmobil.com and the Energy Factor. Follow us on Twitter and LinkedIn. About SABIC SABIC is a global diversified chemicals company headquartered in Riyadh, Saudi Arabia. SABIC manufactures on a global scale in the Americas, Europe, Middle East and Asia Pacific, making distinctly different kinds of products: chemicals, commodity and high performance plastics, agri-nutrients and metals. SABIC supports customers by identifying and developing opportunities in key end-use applications such as construction, medical devices, packaging, agri-nutrients, electrical and electronics, transportation and clean energy. To learn more, visit www.sabic.com. Cautionary Statement Statements of future events or conditions in this release are forward-looking statements. Actual future results, including project plans, timing, costs, and capacities; actual production; performance relative to competition; demand growth; and business, economic, and employment and community impacts could differ materially due to changes in market conditions affecting the oil, gas and petroleum product industries or long-term oil, gas and petroleum product price levels; political or regulatory developments including changes in environmental regulations or taxes; future technological developments including the development and costs of alternative or competing technologies; actions of competitors; technical or operating factors; the outcome of commercial negotiations; changes in consumer preferences; and other factors cited under the caption “Factors Affecting Future Results” on the Investors page of our website at exxonmobil.com.", "url": "https://www.businesswire.com/news/home/20210726005057/en/ExxonMobil-SABIC-Reach-Mechanical-Completion-for-Gulf-Coast-Growth-Ventures-Derivatives", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-26T08:00:00-04:00", "date_et": "2021-07-26"}
{"symbol": "XOM", "publishedDate": "2021-07-26 08:00:00", "publisher": "Business Wire", "title": "ExxonMobil, SABIC Reach Mechanical Completion for Gulf Coast Growth Ventures Derivatives", "image": "https://images.financialmodelingprep.com/news/exxonmobil-sabic-reach-mechanical-completion-for-gulf-coast-growth-ventures-20210726.jpg", "site": "businesswire.com", "text": "IRVING, Texas & RIYADH, Saudi Arabia--(BUSINESS WIRE)--ExxonMobil, SABIC Reach Mechanical Completion for Gulf Coast Growth Ventures Derivatives", "url": "https://www.businesswire.com/news/home/20210726005057/en/ExxonMobil-SABIC-Reach-Mechanical-Completion-for-Gulf-Coast-Growth-Ventures-Derivatives/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-26T08:00:00-04:00", "date_et": "2021-07-26"}
{"symbol": "XOM", "publishedDate": "2021-07-26 11:00:00", "publisher": "Business Wire", "title": "ExxonMobil to Release Second Quarter 2021 Financial Results", "image": "https://images.financialmodelingprep.com/news/exxonmobil-to-release-second-quarter-2021-financial-results-20210726.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation (NYSE:XOM) will release second quarter 2021 financial results on Friday, July 30, 2021. A press release will be issued via Business Wire and available at 6:30 a.m. CT at www.exxonmobil.com. Darren Woods, chairman and chief executive officer; Jack Williams, senior vice president; and Stephen Littleton, vice president of investor relations and secretary, will review the results during a live, listen-only conference call at 8:30 a.m. CT. The presentation can be accessed via webcast or by calling (888) 596-2592 (United States) or (786) 789-4790 (International). Please reference confirmation code 3168506 to join the call. An archive replay of the call and a copy of the presentation with accompanying supplemental financial data will be available at www.exxonmobil.com/ir.", "url": "https://www.businesswire.com/news/home/20210726005085/en/ExxonMobil-to-Release-Second-Quarter-2021-Financial-Results", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-26T11:00:00-04:00", "date_et": "2021-07-26"}
{"symbol": "XOM", "publishedDate": "2021-07-26 11:00:00", "publisher": "Business Wire", "title": "ExxonMobil to Release Second Quarter 2021 Financial Results", "image": "https://images.financialmodelingprep.com/news/exxonmobil-to-release-second-quarter-2021-financial-results-20210726.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil to Release Second Quarter 2021 Financial Results", "url": "https://www.businesswire.com/news/home/20210726005085/en/ExxonMobil-to-Release-Second-Quarter-2021-Financial-Results/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-26T11:00:00-04:00", "date_et": "2021-07-26"}
{"symbol": "XOM", "publishedDate": "2021-07-27 09:14:15", "publisher": "Zacks Investment Research", "title": "Is a Beat in Store for ExxonMobil (XOM) This Earnings Season?", "image": "https://images.financialmodelingprep.com/news/is-a-beat-in-store-for-exxonmobil-xom-this-20210727.jpg", "site": "zacks.com", "text": "ExxonMobil (XOM) expects higher oil price to boost Q2 earnings.", "url": "https://www.zacks.com/stock/news/1768159/is-a-beat-in-store-for-exxonmobil-xom-this-earnings-season", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-27T09:14:15-04:00", "date_et": "2021-07-27"}
{"symbol": "XOM", "publishedDate": "2021-07-28 06:57:00", "publisher": "Business Wire", "title": "ExxonMobil Announces Oil Discovery at Whiptail, Offshore Guyana", "image": "https://images.financialmodelingprep.com/news/exxonmobil-announces-oil-discovery-at-whiptail-offshore-guyana-20210728.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil Announces Oil Discovery at Whiptail, Offshore Guyana", "url": "https://www.businesswire.com/news/home/20210728005323/en/ExxonMobil-Announces-Oil-Discovery-at-Whiptail-Offshore-Guyana/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T06:57:00-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 06:57:00", "publisher": "Business Wire", "title": "ExxonMobil Announces Oil Discovery at Whiptail, Offshore Guyana", "image": "https://images.financialmodelingprep.com/news/exxonmobil-announces-oil-discovery-at-whiptail-offshore-guyana-20210728.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil today said it made a discovery at Whiptail in the Stabroek Block offshore Guyana. The Whiptail-1 well encountered 246 feet (75 meters) of net pay in high quality oil bearing sandstone reservoirs. Drilling is also ongoing at the Whiptail-2 well, which has encountered 167 feet (51 meters) of net pay in high quality oil bearing sandstone reservoirs. Drilling continues at both wells to test deeper targets, and results will be evaluated for future development. The Whiptail discovery is located approximately 4 miles southeast of the Uaru-1 discovery that was announced in January 2020 and approximately 3 miles west of the Yellowtail field. Whiptail-1 is being drilled in 5,889 feet (1,795 meters) of water by the Stena DrillMAX. Whiptail-2, which is located 3 miles northeast of Whiptail-1, is currently being drilled in 6,217 feet (1,895 meters) of water by the Noble Don Taylor. “This discovery increases our confidence in the resource size and quality in the southeast area of the Stabroek Block and could form the basis for a future development as we continue to evaluate the best sequence of development opportunities within the block,” said Mike Cousins, senior vice president of exploration and new ventures at ExxonMobil. ExxonMobil envisions at least six projects online by 2027 and sees potential for up to 10 projects to develop its current recoverable resource base. The Liza Destiny floating production storage and offloading (FPSO) vessel is currently producing about 120,000 barrels of oil per day. The startup of Liza Phase 2 remains on target for early 2022, and the Liza Unity FPSO expects to sail from Singapore to Guyana in late August 2021. The Unity has a production capacity of approximately 220,000 barrels of oil per day. The hull for the Prosperity FPSO vessel is complete, and topsides construction activities are ongoing in Singapore with a startup target of 2024. The first Payara development well was spudded in June 2021, and the offshore SURF installation will begin in 3Q 2021. Yellowtail has been identified as the fourth development project in the Stabroek Block offshore Guyana with anticipated startup in 2025. Following necessary government approvals and a final investment decision, this project will develop the Yellowtail and Redtail fields, which are located about 19 miles (30 kilometers) southeast of the Liza developments, and potentially adjacent resources. These new projects continue to contribute to the advancement of the Guyanese economy. More than 2,600 Guyanese are now supporting project activities on and offshore, which reflects an increase of more than 20 percent since the end of 2019. ExxonMobil and its key contractors have spent approximately US$388 million with more than 800 local companies since 2015. The Stabroek Block is 6.6 million acres (26,800 square kilometers). ExxonMobil affiliate Esso Exploration and Production Guyana Limited is operator and holds 45 percent interest in the Stabroek Block. Hess Guyana Exploration Ltd. holds 30 percent interest and CNOOC Petroleum Guyana Limited, a wholly-owned subsidiary of CNOOC Limited, holds 25 percent interest. About ExxonMobil ExxonMobil, one of the largest publicly traded international energy companies, uses technology and innovation to help meet the world’s growing energy needs. ExxonMobil holds an industry-leading inventory of resources, is one of the largest refiners and marketers of petroleum products, and its chemical company is one of the largest in the world. To learn more, visit exxonmobil.com and the Energy Factor. Follow us on Twitter and LinkedIn. Cautionary Statement: Statements of future events or conditions in this release are forward-looking statements. Actual future results, including project plans, schedules, capacities, production rates, and resource recoveries could differ materially due to: changes in market conditions affecting the oil and gas industry or long-term oil and gas price levels; political or regulatory developments including obtaining necessary regulatory permits; restrictions in trade, travel or other government responses to current or future outbreaks of COVID-19; reservoir performance; the outcome of future exploration efforts; timely completion of development and construction projects; technical or operating factors; the outcome of commercial negotiations; unexpected technological breakthroughs or challenges; and other factors cited under the caption “Factors Affecting Future Results” on the Investors page of our website at exxonmobil.com and under Item 1A. Risk Factors in our annual report on Form 10-K and quarterly reports on Form 10-Q. References to “recoverable resources,” “oil-equivalent barrels,” and other quantifies of oil and gas include estimated quantities that are not yet classified as proved reserves under SEC definitions but are expected to be ultimately recoverable. The term “project” can refer to a variety of different activities and does not necessarily have the same meaning as in any government payment transparency reports.", "url": "https://www.businesswire.com/news/home/20210728005323/en/ExxonMobil-Announces-Oil-Discovery-at-Whiptail-Offshore-Guyana", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T06:57:00-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 13:24:00", "publisher": "Market Watch", "title": "Outside the Box: Biden should reject the infrastructure plan written by Exxon and invest in saving the climate instead", "image": "https://images.financialmodelingprep.com/news/outside-the-box-biden-should-reject-the-infrastructure-plan-20210728.jpg", "site": "marketwatch.com", "text": "As disaster after disaster unfolds, any plan that doesn't tackle the climate crisis with urgency isn't worth taking seriously.", "url": "https://www.marketwatch.com/story/biden-should-reject-the-infrastructure-plan-written-by-exxon-and-invest-in-saving-the-climate-instead-11627493086", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T13:24:00-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 13:44:55", "publisher": "24/7 Wall Street", "title": "Earnings Previews: Caterpillar, Chevron, Exxon Mobil", "image": "https://images.financialmodelingprep.com/news/earnings-previews-caterpillar-chevron-exxon-mobil-20210728.jpg", "site": "247wallst.com", "text": "Now that three of the five largest U.S. traded companies have reported June-quarter earnings, we are looking forward to the remaining two.", "url": "https://247wallst.com/investing/2021/07/28/earnings-previews-caterpillar-chevron-exxon-mobil/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T13:44:55-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 13:55:45", "publisher": "Seeking Alpha", "title": "Exxon Mobil: A Dividend Star Is Reborn", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-a-dividend-star-is-reborn-20210728.jpg", "site": "seekingalpha.com", "text": "Roughly 11 months ago, Exxon Mobil was exiled from the venerable Dow Jones Industrial Average. The oldest member of the DJIA was replaced by Salesforce.com amidst a broader swapping of index components.", "url": "https://seekingalpha.com/article/4442082-exxon-mobil-a-dividend-star-is-reborn", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T13:55:45-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 18:26:00", "publisher": "Business Wire", "title": "Exxon Mobil Corporation Declares Third Quarter Dividend", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-declares-third-quarter-dividend-20210728.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation Declares Third Quarter Dividend", "url": "https://www.businesswire.com/news/home/20210728006092/en/Exxon-Mobil-Corporation-Declares-Third-Quarter-Dividend/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T18:26:00-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 18:26:00", "publisher": "Business Wire", "title": "Exxon Mobil Corporation Declares Third Quarter Dividend", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-declares-third-quarter-dividend-20210728.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--The Board of Directors of Exxon Mobil Corporation today declared a cash dividend of $0.87 per share on the Common Stock, payable on September 10, 2021 to shareholders of record of Common Stock at the close of business on August 13, 2021. This third quarter dividend is at the same level as the dividend paid in the second quarter of 2021. Through its dividends, the corporation has shared its success with its shareholders for more than 100 years.", "url": "https://www.businesswire.com/news/home/20210728006092/en/Exxon-Mobil-Corporation-Declares-Third-Quarter-Dividend", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T18:26:00-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 19:55:34", "publisher": "Investopedia", "title": "Exxon Mobil (XOM) Option Traders Gassed Up for Positive Earnings", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-option-traders-gassed-up-for-positive-20210728.jpg", "site": "investopedia.com", "text": "Trading volumes and implied volatility indicate that traders have been buying calls and selling puts in preparation of a positive earnings report.", "url": "https://www.investopedia.com/xom-option-traders-gassed-up-for-positive-earnings-5194560", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T19:55:34-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 22:01:05", "publisher": "Zacks Investment Research", "title": "The Tech Sector's Enormous Earnings Power", "image": "https://images.financialmodelingprep.com/news/the-tech-sectors-enormous-earnings-power-20210728.jpg", "site": "zacks.com", "text": "The big 5 Tech companies-Apple, Microsoft, Alphabet, Amazon and Facebook-are combined expected to earn +79.4% more in Q2 on +35.7% higher revenues relative to the same period last year.", "url": "https://www.zacks.com/commentary/1769882/the-tech-sector-s-enormous-earnings-power", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T22:01:05-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-28 22:01:06", "publisher": "Zacks Investment Research", "title": "The Tech Sector's Enormous Earnings Power", "image": "https://images.financialmodelingprep.com/news/the-tech-sectors-enormous-earnings-power-20210728.jpg", "site": "zacks.com", "text": "The big 5 Tech companies-Apple, Microsoft, Alphabet, Amazon and Facebook-are combined expected to earn +79.4% more in Q2 on +35.7% higher revenues relative to the same period last year.", "url": "https://www.zacks.com/commentary/1770070/the-tech-sector-s-enormous-earnings-power", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-28T22:01:06-04:00", "date_et": "2021-07-28"}
{"symbol": "XOM", "publishedDate": "2021-07-29 07:32:00", "publisher": "The Motley Fool", "title": "Are Oil Stocks Undervalued?", "image": "https://images.financialmodelingprep.com/news/are-oil-stocks-undervalued-20210729.jpg", "site": "fool.com", "text": "The energy sector has seen a big rebound as oil prices have recovered. Is there still value to be had here?", "url": "https://www.fool.com/investing/2021/07/29/are-oil-stocks-undervalued/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T07:32:00-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-29 07:55:57", "publisher": "Forbes", "title": "Exxon Mobil Named Top 25 SAFE Dividend Stock Increasing Payments For Decades", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-named-top-25-safe-dividend-stock-increasing-20210729.jpg", "site": "forbes.com", "text": "Exxon Mobil has been named to the Dividend Channel ''S.A.F.E. 25'' list, signifying a stock with above-average ''DividendRank'' statistics including a strong 6.0% yield", "url": "https://www.forbes.com/sites/dividendchannel/2021/07/29/exxon-mobil-named-top-25-safe-dividend-stock-increasing-payments-for-decades/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T07:55:57-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-29 09:00:00", "publisher": "Seeking Alpha", "title": "Dividend Harvesting: Week 21 Update, 50 Weeks Of Dividends, $2,100 Invested, $140.55 In Annual Dividends", "image": "https://images.financialmodelingprep.com/news/dividend-harvesting-week-21-update-50-weeks-of-dividends-20210729.jpg", "site": "seekingalpha.com", "text": "Dividend Harvesting: Week 21 Update, 50 Weeks Of Dividends, $2,100 Invested, $140.55 In Annual Dividends", "url": "https://seekingalpha.com/article/4442044-dividend-harvesting-week-21-update", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T09:00:00-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-29 09:40:33", "publisher": "Investopedia", "title": "ExxonMobil Earnings: What to Look For", "image": "https://images.financialmodelingprep.com/news/exxonmobil-earnings-what-to-look-for-20210729.jpg", "site": "investopedia.com", "text": "ExxonMobil (XOM) reports Q2 earnings before market open on July 30. Can the company's profits and revenue continue to rebound amid higher oil prices?", "url": "https://www.investopedia.com/exxonmobil-xom-q2-fy2021-earnings-report-preview-5194623", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T09:40:33-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-29 09:53:51", "publisher": "Zacks Investment Research", "title": "Will Upstream Business Aid ExxonMobil's (XOM) Q2 Earnings?", "image": "https://images.financialmodelingprep.com/news/will-upstream-business-aid-exxonmobils-xom-q2-earnings-20210729.jpg", "site": "zacks.com", "text": "Since ExxonMobil (XOM) has significant exposure to upstream business, the considerable improvement in oil price is likely to have aided the company's Q2 earnings.", "url": "https://www.zacks.com/stock/news/1770388/will-upstream-business-aid-exxonmobil-s-xom-q2-earnings", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T09:53:51-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-29 10:30:00", "publisher": "Forbes", "title": "Is Exxon Mobil Stock A Good Pick Ahead Of Earnings?", "image": "https://images.financialmodelingprep.com/news/is-exxon-mobil-stock-a-good-pick-ahead-of-20210729.jpg", "site": "forbes.com", "text": "Despite an uncertain demand-supply environment, the company's second quarter results are likely to benefit from high benchmark prices, assisting deleveraging plans.", "url": "https://www.forbes.com/sites/greatspeculations/2021/07/29/is-exxon-mobil-stock-a-good-pick-ahead-of-earnings/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-29T10:30:00-04:00", "date_et": "2021-07-29"}
{"symbol": "XOM", "publishedDate": "2021-07-30 07:30:00", "publisher": "Business Wire", "title": "ExxonMobil Earns $4.7 Billion in Second Quarter 2021", "image": "https://images.financialmodelingprep.com/news/exxonmobil-earns-47-billion-in-second-quarter-2021-20210730.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--ExxonMobil Earns $4.7 Billion in Second Quarter 2021", "url": "https://www.businesswire.com/news/home/20210730005149/en/ExxonMobil-Earns-4.7-Billion-in-Second-Quarter-2021/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T07:30:00-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 07:30:00", "publisher": "Business Wire", "title": "ExxonMobil Earns $4.7 Billion in Second Quarter 2021", "image": "https://images.financialmodelingprep.com/news/exxonmobil-earns-47-billion-in-second-quarter-2021-20210730.jpg", "site": "businesswire.com", "text": "IRVING, Texas--(BUSINESS WIRE)--Exxon Mobil Corporation (NYSE:XOM): First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Results Summary (Dollars in millions, except per share data) Earnings/(Loss) (U.S. GAAP) 4,690 (1,080) 2,730 7,420 (1,690) Earnings/(Loss) Per Common Share Assuming Dilution 1.10 (0.26) 0.64 1.74 (0.40) Identified Items Per Common Share Assuming Dilution — 0.44 (0.01) (0.01) (0.23) Earnings/(Loss) Excluding Identified Items Per Common Share Assuming Dilution 1.10 (0.70) 0.65 1.75 (0.17) Capital and Exploration Expenditures 3,803 5,327 3,133 6,936 12,470 Exxon Mobil Corporation (NYSE:XOM) today announced estimated second-quarter 2021 earnings of $4.7 billion, or $1.10 per share assuming dilution, compared with a loss of $1.1 billion in the second quarter of 2020. Second-quarter capital and exploration expenditures were $3.8 billion, bringing the first half of 2021 to $6.9 billion, which is consistent with planned lower activity in the first half of the year. The company anticipates higher second-half planned spending on key projects, including Guyana, Brazil, Permian and in Chemical, with full-year spending towards the lower end of the guidance range of $16 billion to $19 billion. Oil-equivalent production in the second quarter was 3.6 million barrels per day, down 2% from the second quarter of 2020, driven by increased maintenance activity. Excluding entitlement effects, divestments, and government mandates, oil-equivalent production increased 3%, including growth in the Permian and Guyana. “Positive momentum continued during the second quarter across all of our businesses as the global economic recovery increased demand for our products,” said Darren Woods, chairman and chief executive officer. “We’re realizing significant benefits from an improved cost structure, solid operating performance and low-cost-of-supply investments that, together, are generating attractive returns and strong cash flow to fund our capital program, pay the dividend and reduce debt. This was particularly true for our Chemical business that delivered their best quarter in company history. In our efforts to support society's energy transition goals, our Low Carbon Solutions business made progress in identifying new opportunities and in establishing new partnerships in carbon capture and storage, hydrogen and low-emission fuels.” Second-Quarter Business Highlights Upstream Average realizations for crude oil increased 13% from the first quarter. Natural gas realizations increased 1% from the prior quarter. Liquid volumes decreased 3% from the first quarter, driven by increased planned maintenance activity. Natural gas volumes decreased 10%, driven by lower seasonal demand. During the quarter, production volumes in the Permian averaged 400,000 oil-equivalent barrels per day, an increase of 34% from the second quarter of 2020. The focus remains on continuing to grow positive free cash flow by lowering overall development costs and increasing recovery through efficiency gains and technology applications. Downstream Industry fuels margins improved from the first quarter, but remain on the low end of the historical range, due to ongoing impacts from market oversupply. Lubricants delivered strong performance, underpinned by lower operating expenses and improved margins. Overall refining throughput was up 3% from the first quarter, when a winter storm in Texas disrupted operations. The company continued to manage refinery operations in line with fuel demand and integrated chemical manufacturing needs. Chemical Strong base operations supported best-ever quarterly earnings of $2.3 billion, reflecting reliable operations, higher margins and continued cost discipline. Industry margins improved in the quarter on higher product prices, reflecting continued strong demand and regional supply constraints. North America's regional ethane feed advantage grew. Strengthening the Portfolio ExxonMobil signed an agreement with Celanese for the sale of its global Santoprene™ chemical business for $1.15 billion, subject to working capital and other adjustments. The sale advances strategic business objectives and includes two manufacturing sites in the United States and United Kingdom. The transaction is expected to close in the fourth quarter of 2021, subject to standard conditions precedent including regulatory approvals. ExxonMobil continued to progress its major deepwater developments in Guyana, including the announcement of new discoveries at Uaru-2, Longtail-3, and Whiptail, which increase confidence in the quality and size of the resource and supports the potential for 7 to 10 floating production, storage and offloading (FPSO) facilities in the Stabroek block. Exploration, appraisal, and development drilling continues, with a total of six drillships now operating offshore Guyana. The company's high-return developments remain on schedule, with Liza Phase 2 on target for 2022 startup, Payara on schedule for 2024 startup and Yellowtail targeted for 2025 startup. The company continues to make progress on previously announced terminal conversions in Slagen, Norway and Altona, Australia, ensuring ongoing, reliable supply of fuels to these markets through the company's advantaged logistics. The Slagen refinery was safely shutdown in May, while Altona is scheduled to cease refining operations in August. The grass roots chemical plant project, located near Corpus Christi, Texas, recently reached mechanical completion of a monoethylene glycol unit and two polyethylene units. The project, which will produce chemicals used in medical, automotive and packaging products, is expected to start up in the fourth quarter of 2021, ahead of schedule and under budget. Capital Allocation and Structural Cost Improvement ExxonMobil’s 2021 capital program is expected to be at the lower end of the previously communicated range of $16 billion to $19 billion. Capital expenditures totaled approximately $7 billion through the first half of the year. The company’s capital allocation priorities continue to be investing in advantaged projects, strengthening the balance sheet and paying a reliable dividend. In addition to reducing structural costs by $3 billion in 2020, the company has captured over $1 billion in further structural savings in the first half of 2021. The company remains on pace to achieve through 2023 total structural cost reductions of $6 billion relative to 2019. Efforts to identify further structural savings resulting from the reorganizations completed in 2019 continue. Reducing Emissions and Advancing Low Carbon Solutions In July, the company signed memorandums of understanding to participate in a major carbon capture and storage (CCS) project in Scotland and to explore the development of CO2 infrastructure in France. The Acorn CCS project in Scotland plans to capture and store approximately 5 million to 6 million metric tons of CO2 per year by 2030. The collaboration in the Normandy region of France seeks to develop CCS technology with the objective of reducing CO2 emissions by up to 3 million metric tons per year by 2030. During the quarter, ExxonMobil expanded its previous agreement with Global Clean Energy to purchase up to 5 million barrels of renewable diesel with commercial production expected to begin in 2022. The agreement is part of the company’s efforts to advance multiple options to produce low-emission biofuels, including new projects, facility upgrades, and purchase agreements. The company expects to produce more than 40,000 barrels per day of biofuels by 2025. Results and Volume Summary Millions of Dollars 2Q 2Q (unless noted) 2021 2020 Change Comments Upstream U.S. 663 (1,197) +1,860 Higher prices and volumes, reduced expenses Non-U.S. 2,522 (454) +2,976 Higher prices, increased volumes, and favorable one-time tax items, partly offset by higher planned maintenance; prior quarter favorable identified items (-168, inventory valuation) Total 3,185 (1,651) +4,836 Prices +4,570, volumes +290, expenses +90, planned maintenance -300, identified items -210, other +400 Production (koebd) 3,582 3,638 -56 Liquids -106 kbd: higher demand, including the absence of economic curtailments, and project growth, more than offset by lower entitlements, decline, higher planned maintenance, and divestments Gas +304 mcfd: higher demand, including the absence of economic curtailments, partly offset by higher planned maintenance and divestments Downstream U.S. (149) (101) -48 Higher margins driven by stronger industry refining conditions, improved demand, and lower non-maintenance expenses, more than offset by higher planned maintenance activity and absence of prior quarter favorable identified items (-404, inventory valuation) Non-U.S. (78) 1,077 -1,155 Higher demand and improved margins reflecting stronger industry refining conditions, more than offset by higher planned maintenance activity and unfavorable foreign exchange; prior quarter favorable identified items (-1,190, inventory valuation) Total (227) 976 -1,203 Margins +430, demand +270, identified items -1,590, planned maintenance -390, other +70 Petroleum Product Sales (kbd) 5,041 4,437 +604 Chemical U.S. 1,282 171 +1,111 Higher margins and stronger demand Non-U.S. 1,038 296 +742 Higher margins, stronger demand, favorable foreign exchange, and reduced expenses, partly offset by planned maintenance; prior quarter favorable identified item (-144, inventory valuation) Total 2,320 467 +1,853 Margins +1,680, demand +250, expenses +100, planned maintenance -160, identified items -120, other +100 Prime Product Sales (kt) 6,513 5,945 +568 Corporate and financing (588) (872) +284 Lower financing costs and net favorable tax impacts Results and Volume Summary Millions of Dollars 2Q 1Q (unless noted) 2021 2021 Change Comments Upstream U.S. 663 363 +300 Higher liquids prices, higher liquids volumes, and favorable one-time items Non-U.S. 2,522 2,191 +331 Higher liquids prices, higher liquids volumes, and favorable one-time items, partly offset by higher planned maintenance and seasonally lower gas volumes Total 3,185 2,554 +631 Prices +680, planned maintenance -360, other +310 Production (koebd) 3,582 3,787 -205 Liquids -58 kbd: lower entitlements and higher planned maintenance, partly offset by improved reliability and winter storm recovery Gas -879 mcfd: lower seasonal demand, lower entitlements, and higher planned maintenance, partly offset by winter storm recovery Downstream U.S. (149) (113) -36 Winter storm recovery and improved demand, more than offset by higher planned maintenance activity Non-U.S. (78) (277) +199 Higher margins driven by more favorable industry refining conditions and improved demand, partly offset by higher planned maintenance activity Total (227) (390) +163 Margins +190, demand +70, planned maintenance -220, other +120 Petroleum Product Sales (kbd) 5,041 4,881 +160 Chemical U.S. 1,282 715 +567 Stronger margins Non-U.S. 1,038 700 +338 Stronger margins, partly offset by planned maintenance Total 2,320 1,415 +905 Margins +1,080, planned maintenance -180 Prime Product Sales (kt) 6,513 6,446 +67 Corporate and financing (588) (849) +261 Lower retirement-related expenses and lower financing costs Results and Volume Summary Millions of Dollars YTD YTD (unless noted) 2021 2020 Change Comments Upstream U.S. 1,026 (1,901) +2,927 Higher prices and reduced expenses; prior year unfavorable identified items (+315, impairment) Non-U.S. 4,713 786 +3,927 Higher prices and favorable one-time tax items, partly offset by higher planned maintenance and unfavorable foreign exchange Total 5,739 (1,115) +6,854 Prices +6,130, expenses +480, identified items +410, planned maintenance -330, other +170 Production (koebd) 3,684 3,842 -158 Liquids -164 kbd: higher demand including the absence of economic curtailments, and project growth, more than offset by lower entitlements, increased government mandates, decline and higher planned maintenance Gas +38 mcfd: higher demand, including the absence of economic curtailments, partly offset by higher planned maintenance, Groningen production limit, and divestments Downstream U.S. (262) (202) -60 Lower margins on weaker industry refining conditions, and increased planned maintenance activity, partly offset by reduced expenses and improved demand Non-U.S. (355) 567 -922 Lower margins on weaker realized fuels margins, net unfavorable one-time items including terminal conversion costs, increased planned maintenance activity, and unfavorable foreign exchange impacts, partly offset by reduced expenses and improved demand; prior year unfavorable identified items (+341, mainly impairments) Total (617) 365 -982 Margins -1,340, demand +260, planned maintenance -350, expenses +490, identified items +350, other -390 Petroleum Product Sales (kbd) 4,961 4,862 +99 Chemical U.S. 1,997 459 +1,538 Higher margins, improved demand, and lower expenses; prior year unfavorable identified items (+119, mainly impairments) Non-U.S. 1,738 152 +1,586 Higher margins and demand, lower expenses, and favorable foreign exchange, partly offset by planned maintenance Total 3,735 611 +3,124 Margins +2,300, demand +290, expenses +250, planned maintenance -80, identified items +210, other +150 Prime Product Sales (kt) 12,959 12,182 +777 Corporate and financing (1,437) (1,551) +114 Lower financing costs and net favorable tax impacts, partly offset by higher retirement-related expenses Cash Flow from Operations and Asset Sales excluding Working Capital Millions of Dollars 2Q 2021 Comments Net income (loss) including noncontrolling interests 4,781 Including $91 million noncontrolling interests Depreciation 4,952 Changes in operational working capital (380) Other 297 Cash Flow from Operating 9,650 Activities (U.S. GAAP) Asset sales 250 Cash Flow from Operations 9,900 and Asset Sales Changes in operational working capital 380 Cash Flow from Operations 10,280 and Asset Sales excluding Working Capital Millions of Dollars YTD 2021 Comments Net income (loss) including noncontrolling interests 7,577 Including $157 million noncontrolling interests Depreciation 9,956 Changes in operational working capital 1,573 Higher net payables due to market conditions Other (192) Cash Flow from Operating 18,914 Activities (U.S. GAAP) Asset sales 557 Cash Flow from Operations 19,471 and Asset Sales Changes in operational working capital (1,573) Cash Flow from Operations 17,898 and Asset Sales excluding Working Capital ExxonMobil will discuss financial and operating results and other matters during a webcast at 8:30 a.m. Central Time on July 30, 2021. To listen to the event or access an archived replay, please visit www.exxonmobil.com. Cautionary Statement Outlooks, projections, goals, targets, descriptions of strategic plans and objectives, and other statements of future events or conditions in this release are forward-looking statements. Actual future results, including financial and operating performance; total capital expenditures and mix; cost reductions, including the ability to meet or exceed announced cash cost and expense reduction objectives; plans to reduce future emissions intensity and the expected resulting absolute emission reductions; CO2 volumes captured and stored; biofuel production; cash flow, dividends and shareholder returns; business and project plans, timing, costs, capacities, and returns; and resource recoveries and production rates could differ materially due to a number of factors. These include global or regional changes in the supply and demand for oil, natural gas, petrochemicals, and feedstocks and other market conditions that impact prices and differentials for our products; actions of competitors and commercial counterparties; the ability to access short- and long-term debt markets on a timely and affordable basis; the ultimate impacts of COVID-19, including the extent and nature of further outbreaks and the effects of government responses on people and economies; reservoir performance; the outcome of exploration projects; timely completion of development and other construction projects; changes in law, taxes, or regulation including environmental regulations, trade sanctions, and timely granting of governmental permits; government policies and support and market demand for low carbon technologies like carbon capture; war, and other political or security disturbances; opportunities for potential investments or divestments and satisfaction of applicable conditions to closing, including regulatory approvals; the capture of efficiencies within and between business lines and the ability to maintain near-term cost reductions as ongoing efficiencies while maintaining future competitive positioning; unforeseen technical or operating difficulties and unplanned maintenance; the development and competitiveness of alternative energy and emission reduction technologies; the results of research programs and the ability to bring new technologies to commercial scale on a cost-competitive basis; and other factors discussed under Item 1A. Risk Factors of ExxonMobil’s 2020 Form 10-K. Frequently Used Terms and Non-GAAP Measures This press release includes cash flow from operations and asset sales. Because of the regular nature of our asset management and divestment program, we believe it is useful for investors to consider proceeds associated with the sales of subsidiaries, property, plant and equipment, and sales and returns of investments together with cash provided by operating activities when evaluating cash available for investment in the business and financing activities. A reconciliation to net cash provided by operating activities for 2021 periods is shown on page 7 and for 2021 and 2020 periods in Attachment V. This press release also includes cash flow from operations and asset sales excluding working capital. We believe it is useful for investors to consider these numbers in comparing the underlying performance of our business across periods when there are significant period-to-period differences in the amount of changes in working capital. A reconciliation to net cash provided by operating activities for 2021 periods is shown on page 7 and for 2021 and 2020 periods in Attachment V. This press release also includes earnings/(loss) excluding identified items, which are earnings/(loss) excluding individually significant non-operational events with an absolute corporate total earnings impact of at least $250 million in a given quarter. The earnings/(loss) impact of an identified item for an individual segment may be less than $250 million when the item impacts several periods or several segments. We believe it is useful for investors to consider these figures in comparing the underlying performance of our business across periods when one, or both, periods include identified items. A reconciliation to earnings is shown for 2021 and 2020 periods in Attachments II-a and II-b. Corresponding per share amounts are shown on page 1 and in Attachment II-a, including a reconciliation to earnings/(loss) per common share – assuming dilution (U.S. GAAP). This press release also includes total taxes including sales-based taxes. This is a broader indicator of the total tax burden on the corporation’s products and earnings, including certain sales and value-added taxes imposed on and concurrent with revenue-producing transactions with customers and collected on behalf of governmental authorities (“sales-based taxes”). It combines “Income taxes” and “Total other taxes and duties” with sales-based taxes, which are reported net in the income statement. We believe it is useful for the corporation and its investors to understand the total tax burden imposed on the corporation’s products and earnings. A reconciliation to total taxes is shown as part of the Estimated Key Financial and Operating Data in Attachment I. References to the resource base and other quantities of oil, natural gas or condensate may include estimated amounts that are not yet classified as “proved reserves” under SEC definitions, but which are expected to be ultimately recoverable. The term “project” as used in this release can refer to a variety of different activities and does not necessarily have the same meaning as in any government payment transparency reports. Further information on ExxonMobil’s frequently used financial and operating measures and other terms including \"Cash operating expenses\", “Cash flow from operations and asset sales”, and “Total taxes including sales-based taxes” is contained under the heading “Frequently Used Terms” available through the “Investors” section of our website at www.exxonmobil.com. Reference to Earnings References to corporate earnings mean net income attributable to ExxonMobil (U.S. GAAP) from the consolidated income statement. Unless otherwise indicated, references to earnings, Upstream, Downstream, Chemical and Corporate and financing segment earnings, and earnings per share are ExxonMobil’s share after excluding amounts attributable to noncontrolling interests. Exxon Mobil Corporation has numerous affiliates, many with names that include ExxonMobil, Exxon, Mobil, Esso, and XTO. For convenience and simplicity, those terms and terms such as corporation, company, our, we, and its are sometimes used as abbreviated references to specific affiliates or affiliate groups. Similarly, ExxonMobil has business relationships with thousands of customers, suppliers, governments, and others. For convenience and simplicity, words such as venture, joint venture, partnership, co-venturer, and partner are used to indicate business and other relationships involving common activities and interests, and those words may not indicate precise legal relationships. Estimated Key Financial and Operating Data Attachment I Exxon Mobil Corporation Second Quarter 2021 (millions of dollars, unless noted) First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Earnings (Loss) / Earnings (Loss) Per Share Total revenues and other income 67,742 32,605 59,147 126,889 88,763 Total costs and other deductions 61,435 34,245 55,555 116,990 90,661 Income (loss) before income taxes 6,307 (1,640) 3,592 9,899 (1,898) Income taxes 1,526 (471) 796 2,322 41 Net income (loss) including noncontrolling interests 4,781 (1,169) 2,796 7,577 (1,939) Net income (loss) attributable to noncontrolling interests 91 (89) 66 157 (249) Net income (loss) attributable to ExxonMobil (U.S. GAAP) 4,690 (1,080) 2,730 7,420 (1,690) Earnings (loss) per common share (dollars) 1.10 (0.26) 0.64 1.74 (0.40) Earnings (loss) per common share - assuming dilution (dollars) 1.10 (0.26) 0.64 1.74 (0.40) Exploration expenses, including dry holes 176 214 164 340 502 Other Financial Data Dividends on common stock Total 3,721 3,715 3,720 7,441 7,434 Per common share (dollars) 0.87 0.87 0.87 1.74 1.74 Millions of common shares outstanding At period end 4,234 4,228 Average - assuming dilution 4,276 4,271 4,272 4,274 4,270 ExxonMobil share of equity at period end 158,571 180,183 ExxonMobil share of capital employed at period end 221,275 251,998 Income taxes 1,526 (471) 796 2,322 41 Total other taxes and duties 8,441 5,683 7,283 15,724 13,180 Total taxes 9,967 5,212 8,079 18,046 13,221 Sales-based taxes 5,448 3,129 4,662 10,110 7,614 Total taxes including sales-based taxes 15,415 8,341 12,741 28,156 20,835 ExxonMobil share of income taxes of equity companies 525 (18) 600 1,125 442 Attachment II-a Exxon Mobil Corporation Second Quarter 2021 First $ Millions Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Earnings/(Loss) (U.S. GAAP) 4,690 (1,080) 2,730 7,420 (1,690) Identified Items Included in Earnings/(Loss) Noncash inventory valuation - lower of cost or market — 1,922 — — (174) Impairments — — — — (787) Other items (severance - global workforce review) (12) — (31) (43) — Corporate total (12) 1,922 (31) (43) (961) Earnings/(Loss) Excluding Identified Items 4,702 (3,002) 2,761 7,463 (729) $ Per Common Share1 Earnings/(Loss) Per Common Share Assuming Dilution (U.S. GAAP) 1.10 (0.26) 0.64 1.74 (0.40) Identified Items Included in Earnings/(Loss) Per Common Share Assuming Dilution Noncash inventory valuation - lower of cost or market — 0.44 — — (0.05) Impairments — — — — (0.18) Other items (severance - global workforce review) — — (0.01) (0.01) — Corporate total — 0.44 (0.01) (0.01) (0.23) Earnings/(Loss) Excluding Identified Items Per Common Share Assuming Dilution 1.10 (0.70) 0.65 1.75 (0.17) 1 Computed using the average number of shares outstanding during each period. Attachment II-b Exxon Mobil Corporation Second Quarter 2021 (millions of dollars) First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Earnings/(Loss) (U.S. GAAP) Upstream United States 663 (1,197) 363 1,026 (1,901) Non-U.S. 2,522 (454) 2,191 4,713 786 Downstream United States (149) (101) (113) (262) (202) Non-U.S. (78) 1,077 (277) (355) 567 Chemical United States 1,282 171 715 1,997 459 Non-U.S. 1,038 296 700 1,738 152 Corporate and financing (588) (872) (849) (1,437) (1,551) Net income (loss) attributable to ExxonMobil 4,690 (1,080) 2,730 7,420 (1,690) Identified Items Included in Earnings/(Loss) U.S. Upstream Impairments — — — — (315) Other Items (Inventory valuation) — 45 — — — Non-U.S. Upstream Impairments — — — — (41) Other Items (Inventory valuation) — 168 — — (50) U.S. Downstream Impairments — — — — (4) Other Items (Inventory valuation) — 404 — — (3) Non-U.S. Downstream Impairments — — — — (335) Other Items (Inventory valuation) — 1,190 — — (6) U.S. Chemical Impairments — — — — (90) Other Items (Inventory valuation) — (29) — — (29) Non-U.S. Chemical Impairments — — — — (2) Other Items (Inventory valuation) — 144 — — (86) Corporate and financing Severance - global workforce review (12) — (31) (43) — Corporate total (12) 1,922 (31) (43) (961) Earnings/(Loss) Excluding Identified Items Upstream United States 663 (1,242) 363 1,026 (1,586) Non-U.S. 2,522 (622) 2,191 4,713 877 Downstream United States (149) (505) (113) (262) (195) Non-U.S. (78) (113) (277) (355) 908 Chemical United States 1,282 200 715 1,997 578 Non-U.S. 1,038 152 700 1,738 240 Corporate and financing (576) (872) (818) (1,394) (1,551) Corporate total 4,702 (3,002) 2,761 7,463 (729) Attachment III Exxon Mobil Corporation Second Quarter 2021 First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Net production of crude oil, natural gas liquids, bitumen and synthetic oil, thousand barrels per day (kbd) United States 687 628 665 676 664 Canada / Other Americas 529 483 575 552 520 Europe 16 31 35 25 31 Africa 254 333 253 254 346 Asia 669 783 691 680 789 Australia / Oceania 45 48 39 42 43 Worldwide 2,200 2,306 2,258 2,229 2,393 Natural gas production available for sale, million cubic feet per day (mcfd) United States 2,804 2,642 2,767 2,786 2,733 Canada / Other Americas 189 269 216 203 293 Europe 654 619 1,403 1,026 956 Africa 46 4 24 35 6 Asia 3,433 3,218 3,599 3,515 3,464 Australia / Oceania 1,168 1,238 1,164 1,166 1,241 Worldwide 8,294 7,990 9,173 8,731 8,693 Oil-equivalent production (koebd)1 3,582 3,638 3,787 3,684 3,842 1 Natural gas is converted to an oil-equivalent basis at six million cubic feet per one thousand barrels. Attachment IV Exxon Mobil Corporation Second Quarter 2021 First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Refinery throughput (kbd) United States 1,532 1,440 1,532 1,532 1,499 Canada 332 278 364 348 330 Europe 1,223 1,085 1,153 1,188 1,190 Asia Pacific 607 568 545 576 603 Other 164 145 157 161 166 Worldwide 3,858 3,516 3,751 3,805 3,788 Petroleum product sales (kbd) United States 2,218 1,959 2,077 2,148 2,095 Canada 421 353 409 415 405 Europe 1,297 1,130 1,272 1,285 1,266 Asia Pacific 655 640 665 660 674 Other 450 355 458 453 422 Worldwide 5,041 4,437 4,881 4,961 4,862 Gasolines, naphthas 2,117 1,736 1,996 2,057 1,929 Heating oils, kerosene, diesel 1,704 1,649 1,692 1,698 1,758 Aviation fuels 201 147 183 192 265 Heavy fuels 275 262 257 266 259 Specialty products 744 643 753 748 651 Worldwide 5,041 4,437 4,881 4,961 4,862 Chemical prime product sales, thousand metric tons (kt) United States 2,491 1,985 2,190 4,681 4,180 Non-U.S. 4,022 3,960 4,256 8,278 8,002 Worldwide 6,513 5,945 6,446 12,959 12,182 Attachment V Exxon Mobil Corporation Second Quarter 2021 (millions of dollars) First Second Quarter Quarter First Half 2021 2020 2021 2021 2020 Capital and Exploration Expenditures Upstream United States 925 1,637 810 1,735 4,435 Non-U.S. 1,892 1,940 1,547 3,439 4,268 Total 2,817 3,577 2,357 5,174 8,703 Downstream United States 193 719 271 464 1,466 Non-U.S. 262 334 199 461 821 Total 455 1,053 470 925 2,287 Chemical United States 313 563 208 521 1,160 Non-U.S. 217 132 98 315 317 Total 530 695 306 836 1,477 Other 1 2 — 1 3 Worldwide 3,803 5,327 3,133 6,936 12,470 Cash Flow from Operations and Asset Sales excluding Working Capital Net cash provided by operating activities (U.S. GAAP) 9,650 — 9,264 18,914 6,274 Proceeds associated with asset sales 250 43 307 557 129 Cash flow from operations and asset sales 9,900 43 9,571 19,471 6,403 Changes in operational working capital 380 1,460 (1,953) (1,573) 2,402 Cash flow from operations and asset sales 10,280 1,503 7,618 17,898 8,805 excluding working capital Attachment VI Exxon Mobil Corporation Earnings/(Loss) $ Millions $ Per Common Share1 2017 First Quarter 4,010 0.95 Second Quarter 3,350 0.78 Third Quarter 3,970 0.93 Fourth Quarter 8,380 1.97 Year 19,710 4.63 2018 First Quarter 4,650 1.09 Second Quarter 3,950 0.92 Third Quarter 6,240 1.46 Fourth Quarter 6,000 1.41 Year 20,840 4.88 2019 First Quarter 2,350 0.55 Second Quarter 3,130 0.73 Third Quarter 3,170 0.75 Fourth Quarter 5,690 1.33 Year 14,340 3.36 2020 First Quarter (610) (0.14) Second Quarter (1,080) (0.26) Third Quarter (680) (0.15) Fourth Quarter (20,070) (4.70) Year (22,440) (5.25) 2021 First Quarter 2,730 0.64 Second Quarter 4,690 1.10 1 Computed using the average number of shares outstanding during each period.", "url": "https://www.businesswire.com/news/home/20210730005149/en/ExxonMobil-Earns-4.7-Billion-in-Second-Quarter-2021", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T07:30:00-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 07:37:00", "publisher": "Reuters", "title": "Exxon posts highest profit in more than a year", "image": "https://images.financialmodelingprep.com/news/exxon-posts-highest-profit-in-more-than-a-year-20210730.jpg", "site": "reuters.com", "text": "(Reuters) -Exxon Mobil on Friday posted its first quarterly results following a contested board fight over its direction, registering its biggest profit in more than a year on rebounding demand for oil, gas and chemicals.", "url": "https://www.reuters.com/article/us-exxon-mobil-results/exxon-posts-highest-profit-in-more-than-a-year-idUSKBN2F01LC", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T07:37:00-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 07:46:33", "publisher": "Market Watch", "title": "Exxon Mobil stock gains after profit beat expectations, revenue more than doubled", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-stock-gains-after-profit-beat-expectations-revenue-more-20210730.jpg", "site": "marketwatch.com", "text": "Shares of Exxon Mobil Corp. tacked on 0.9% in premarket trading Friday, after the oil giant swung to the highest second-quarter profit since the end of 2019 as revenue more than doubled to well above forecasts. Net income came to $4.69 billion, or $1.10 a share, after a loss of $1.08 billion, or 26 cents a share, in the year ago period.", "url": "https://www.marketwatch.com/story/exxon-mobil-stock-gains-after-profit-beat-expectations-revenue-more-than-doubled-2021-07-30", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T07:46:33-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 07:51:08", "publisher": "Benzinga", "title": "Exxon Mobil: Q2 Earnings Insights", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-q2-earnings-insights-20210730.jpg", "site": "benzinga.com", "text": "Shares of Exxon Mobil (NYSE:XOM) moved higher by 0.8% in pre-market trading after the company reported Q2 results. Quarterly Results Earnings per share increased 257.14% year over year to $1.10, which beat the estimate of $0.97.", "url": "https://www.benzinga.com/news/earnings/21/07/22245288/exxon-mobil-q2-earnings-insights", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T07:51:08-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 09:05:45", "publisher": "Investopedia", "title": "ExxonMobil Q2 2021 Earnings Report Recap", "image": "https://images.financialmodelingprep.com/news/exxonmobil-q2-2021-earnings-report-recap-20210730.jpg", "site": "investopedia.com", "text": "ExxonMobil's (XOM) Q2 earnings and revenue exceeded analysts' expectations. The company's upstream segment net income also beat estimates.", "url": "https://www.investopedia.com/exxonmobil-q2-fy2021-earnings-report-recap-5194813", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T09:05:45-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 09:54:14", "publisher": "Zacks Investment Research", "title": "Exxon Mobil (XOM) Surpasses Q2 Earnings and Revenue Estimates", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-surpasses-q2-earnings-and-revenue-estimates-20210730.jpg", "site": "zacks.com", "text": "Exxon (XOM) delivered earnings and revenue surprises of 7.84% and 6.29%, respectively, for the quarter ended June 2021. Do the numbers hold clues to what lies ahead for the stock?", "url": "https://www.zacks.com/stock/news/1771496/exxon-mobil-xom-surpasses-q2-earnings-and-revenue-estimates", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T09:54:14-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 12:10:24", "publisher": "Zacks Investment Research", "title": "Core PCE Inflation Less Than Expectation in June", "image": "https://images.financialmodelingprep.com/news/core-pce-inflation-less-than-expectation-in-june-20210730.jpg", "site": "zacks.com", "text": "Core PCE Inflation Less Than Expectation in June.", "url": "https://www.zacks.com/stock/news/1771701/core-pce-inflation-less-than-expectation-in-june", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T12:10:24-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 12:10:32", "publisher": "Zacks Investment Research", "title": "Inflation Pressures Remain, But Letting Up a Tad", "image": "https://images.financialmodelingprep.com/news/inflation-pressures-remain-but-letting-up-a-tad-20210730.jpg", "site": "zacks.com", "text": "We continue to see pricing pressure present, but perhaps letting up a bit from recent levels.", "url": "https://www.zacks.com/stock/news/1771673/inflation-pressures-remain-but-letting-up-a-tad", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T12:10:32-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 12:44:00", "publisher": "Market Watch", "title": "Exxon's, Chevron's chemicals businesses are Q2 highlight", "image": "https://images.financialmodelingprep.com/news/exxons-chevrons-chemicals-businesses-are-q2-highlight-20210730.jpg", "site": "marketwatch.com", "text": "Exxon Mobil Corp. and Chevron Corp. relied on the strength of their chemicals businesses to turn out higher profit and sales than Wall Street expected.", "url": "https://www.marketwatch.com/story/exxons-chevrons-chemicals-businesses-are-q2-highlight-11627663448", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T12:44:00-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 13:41:15", "publisher": "Zacks Investment Research", "title": "ExxonMobil (XOM) Q2 Earnings Beat on Huge Demand Recovery", "image": "https://images.financialmodelingprep.com/news/exxonmobil-xom-q2-earnings-beat-on-huge-demand-recovery-20210730.jpg", "site": "zacks.com", "text": "ExxonMobil's (XOM) total debt amounts to $60.6 billion at the June quarter-end, sequentially down from $63.3 billion.", "url": "https://www.zacks.com/stock/news/1771842/exxonmobil-xom-q2-earnings-beat-on-huge-demand-recovery", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T13:41:15-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-30 15:46:07", "publisher": "Seeking Alpha", "title": "Exxon Mobil Corporation (XOM) CEO Darren Woods on Q2 2021 Results - Earnings Call Transcript", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-xom-ceo-darren-woods-on-q2-20210730.jpg", "site": "seekingalpha.com", "text": "Exxon Mobil Corporation (XOM) CEO Darren Woods on Q2 2021 Results - Earnings Call Transcript", "url": "https://seekingalpha.com/article/4443318-exxon-mobil-corporation-xom-ceo-darren-woods-on-q2-2021-results-earnings-call-transcript", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-30T15:46:07-04:00", "date_et": "2021-07-30"}
{"symbol": "XOM", "publishedDate": "2021-07-31 08:16:00", "publisher": "The Motley Fool", "title": "Is Now the Time to Buy Oil Stocks?", "image": "https://images.financialmodelingprep.com/news/is-now-the-time-to-buy-oil-stocks-20210731.jpg", "site": "fool.com", "text": "The global energy landscape is changing. What does that mean for investors looking to buy oil stocks?", "url": "https://www.fool.com/investing/2021/07/31/is-now-the-time-to-buy-oil-stocks/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-31T08:16:00-04:00", "date_et": "2021-07-31"}
{"symbol": "XOM", "publishedDate": "2021-07-31 09:05:00", "publisher": "Seeking Alpha", "title": "Upcoming Ex-Dividend Dates: August 3-16, 2021", "image": "https://images.financialmodelingprep.com/news/upcoming-exdividend-dates-august-316-2021-20210731.jpg", "site": "seekingalpha.com", "text": "We provide a summary of upcoming ex-dividend dates in a quick reference table. The table includes relevant data and key statistics as well as the next payout and pay date.", "url": "https://seekingalpha.com/article/4443463-upcoming-ex-dividend-dates-august-3-16-2021", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-07-31T09:05:00-04:00", "date_et": "2021-07-31"}
{"symbol": "XOM", "publishedDate": "2021-08-02 07:33:00", "publisher": "The Motley Fool", "title": "Why Oil and Gas Stocks Are Crushing the Market in 2021", "image": "https://images.financialmodelingprep.com/news/why-oil-and-gas-stocks-are-crushing-the-market-20210802.jpg", "site": "fool.com", "text": "Energy stocks are leading the market, but will that last?", "url": "https://www.fool.com/investing/2021/08/02/why-oil-and-gas-stocks-are-crushing-the/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-02T07:33:00-04:00", "date_et": "2021-08-02"}
{"symbol": "XOM", "publishedDate": "2021-08-02 07:39:09", "publisher": "24/7 Wall Street", "title": "Why Big Oil With Big Dividends Is the Best Energy Trade Now", "image": "https://images.financialmodelingprep.com/news/why-big-oil-with-big-dividends-is-the-best-20210802.jpg", "site": "247wallst.com", "text": "Despite OPEC agreeing to lift oil production, West Texas Intermediate crude continues to trade above $70 a barrel, closing Friday at $73.95, and has averaged $60 a barrel this year.", "url": "https://247wallst.com/energy-business/2021/08/02/why-big-oil-with-big-dividends-is-the-best-energy-trade-now/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-02T07:39:09-04:00", "date_et": "2021-08-02"}
{"symbol": "XOM", "publishedDate": "2021-08-02 14:29:50", "publisher": "Benzinga", "title": "Exxon, Chevron Report Q2 Earnings: BofA's Takeaways", "image": "https://images.financialmodelingprep.com/news/exxon-chevron-report-q2-earnings-bofas-takeaways-20210802.jpg", "site": "benzinga.com", "text": "Chevron Corp. (NYSE:CVX) and ExxonMobil Corp. (NYSE:XOM) reported second-quarter earnings Friday. Here's what Bank of America analysts took away from the oil companies' earnings.", "url": "https://www.benzinga.com/analyst-ratings/analyst-color/21/08/22279808/exxon-chevron-report-q2-earnings-bofas-takeaways", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-02T14:29:50-04:00", "date_et": "2021-08-02"}
{"symbol": "XOM", "publishedDate": "2021-08-02 14:48:06", "publisher": "InvestorPlace", "title": "Exxon Is Playing Things Smart and Looks Worth $77 — Or More", "image": "https://images.financialmodelingprep.com/news/exxon-is-playing-things-smart-and-looks-worth-77-20210802.jpg", "site": "investorplace.com", "text": "Exxon does the right thing with its money, but shareholders want more. XOM stock is worth more based on its average historical yield and P/E.", "url": "https://investorplace.com/2021/08/xom-stock-is-worth-77-43-35-percent-more-using-its-historical-yield-and-pe/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-02T14:48:06-04:00", "date_et": "2021-08-02"}
{"symbol": "XOM", "publishedDate": "2021-08-02 15:36:33", "publisher": "Seeking Alpha", "title": "Exxon Mobil: Growth Is Back And Cash Flow Is Cheap", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-growth-is-back-and-cash-flow-is-20210802.jpg", "site": "seekingalpha.com", "text": "Exxon Mobil's recovery is real.", "url": "https://seekingalpha.com/article/4444106-exxon-mobil-growth-is-back", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-02T15:36:33-04:00", "date_et": "2021-08-02"}
{"symbol": "XOM", "publishedDate": "2021-08-03 09:01:33", "publisher": "Forbes", "title": "Q2 Earnings: Exxon, Shell And BP Are Still Oil Companies", "image": "https://images.financialmodelingprep.com/news/q2-earnings-exxon-shell-and-bp-are-still-oil-20210803.jpg", "site": "forbes.com", "text": "Big Oil companies and others are under tremendous pressure to not just talk about getting to net zero by 2050 or 2040 or whatever distant year they pick, but to make significant investments and take concrete steps along the road to getting there.", "url": "https://www.forbes.com/sites/davidblackmon/2021/08/03/q2-earnings-exxon-shell-and-bp-are-still-oil-companies/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-03T09:01:33-04:00", "date_et": "2021-08-03"}
{"symbol": "XOM", "publishedDate": "2021-08-03 09:23:10", "publisher": "Seeking Alpha", "title": "Exxon Punished After Impressive Earnings", "image": "https://images.financialmodelingprep.com/news/exxon-punished-after-impressive-earnings-20210803.jpg", "site": "seekingalpha.com", "text": "Exxon's second-quarter earnings results help confirm that the previous quarter's extension into profitability was not simply a one-time event. However, share prices were met with strong selling pressure following the earnings event risk and we think the market might be creating a new buying opportunity following these declines.", "url": "https://seekingalpha.com/article/4444264-exxon-punished-after-impressive-earnings", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-03T09:23:10-04:00", "date_et": "2021-08-03"}
{"symbol": "XOM", "publishedDate": "2021-08-03 12:36:24", "publisher": "24/7 Wall Street", "title": "Tuesday Afternoon Analyst Upgrades and Downgrades: Exxon Mobil, First Solar, Tesla and More", "image": "https://images.financialmodelingprep.com/news/tuesday-afternoon-analyst-upgrades-and-downgrades-exxon-mobil-first-20210803.jpg", "site": "247wallst.com", "text": "With the trading day more than halfway over, the broad markets were pushing higher yet again.", "url": "https://247wallst.com/investing/2021/08/03/tuesday-afternoon-analyst-upgrades-and-downgrades-exxon-mobil-first-solar-tesla-and-more/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-03T12:36:24-04:00", "date_et": "2021-08-03"}
{"symbol": "XOM", "publishedDate": "2021-08-04 10:17:07", "publisher": "Seeking Alpha", "title": "The 102 Most Reliable Dividends On Earth For August", "image": "https://images.financialmodelingprep.com/news/the-102-most-reliable-dividends-on-earth-for-august-20210804.jpg", "site": "seekingalpha.com", "text": "Kiplinger \"insights for investors\" online first offered a list of 91 \"Top Dividend Stocks From Around The World\" 7/13/20. Two recent Kiplinger articles provided 102 Top Dividend Stocks on Earth list 7/1/21. 39 European “Dividend Aristocrats” showed 10 years of stable or increasing dividends; 65 S&P 500 Aristocrats showed 25 years of increases for U.S. companies.", "url": "https://seekingalpha.com/article/4444783-the-102-most-reliable-dividends-on-earth-for-august", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-04T10:17:07-04:00", "date_et": "2021-08-04"}
{"symbol": "XOM", "publishedDate": "2021-08-05 10:09:00", "publisher": "Proactive Investors", "title": "Exxon mulls plans for ‘net zero by 2050' - reports", "image": "https://images.financialmodelingprep.com/news/exxon-mulls-plans-for-net-zero-by-2050-reports-20210805.jpg", "site": "proactiveinvestors.co.uk", "text": "Exxon Mobil Corporation may reportedly pledge to cut its net carbon emissions to zero by 2050. It follows similar moves by fellow multinational majors Royal Dutch Shell Plc and BP Plc which earlier this year laid out their own (net) carbon reduction targets.", "url": "https://www.proactiveinvestors.co.uk//companies/news/956980/exxon-mulls-plans-for-net-zero-by-2050---reports-956980.html?SNAPI", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-05T10:09:00-04:00", "date_et": "2021-08-05"}
{"symbol": "XOM", "publishedDate": "2021-08-05 10:29:44", "publisher": "Seeking Alpha", "title": "Exxon Mobil: Whether The Stock Can Bounce Back", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-whether-the-stock-can-bounce-back-20210805.jpg", "site": "seekingalpha.com", "text": "At current Brent prices, Exxon Mobil has more than enough money to raise the dividend and to fund its capital expenditures. With its excess cash generation, Exxon Mobil has cut its total debt by over $7 billion year to date.", "url": "https://seekingalpha.com/article/4445347-exxon-mobil-whether-the-stock-can-bounce-back", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-05T10:29:44-04:00", "date_et": "2021-08-05"}
{"symbol": "XOM", "publishedDate": "2021-08-05 13:19:13", "publisher": "Seeking Alpha", "title": "Exxon Mobil Corporation: Oil Price Neutral Valuation And Hedging Strategy", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-corporation-oil-price-neutral-valuation-and-hedging-strategy-20210805.jpg", "site": "seekingalpha.com", "text": "Commodity prices and commodity company stocks can sometimes move divergently due to concerns about corporate. However, the significant impact of commodity prices on a company's value cannot be overemphasized.", "url": "https://seekingalpha.com/article/4445437-exxon-mobil-valuation-and-hedging-strategy", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-05T13:19:13-04:00", "date_et": "2021-08-05"}
{"symbol": "XOM", "publishedDate": "2021-08-05 15:59:02", "publisher": "Zacks Investment Research", "title": "Most Interesting New ETFs of 2021", "image": "https://images.financialmodelingprep.com/news/most-interesting-new-etfs-of-2021-20210805.jpg", "site": "zacks.com", "text": "We highlight four interesting ETFs that launched recently", "url": "https://www.zacks.com/stock/news/1775464/most-interesting-new-etfs-of-2021", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-05T15:59:02-04:00", "date_et": "2021-08-05"}
{"symbol": "XOM", "publishedDate": "2021-08-06 10:28:11", "publisher": "Forbes", "title": "Would A $100 Per Ton Carbon Tax Get ExxonMobil To Right Its Errant Ways?", "image": "https://images.financialmodelingprep.com/news/would-a-100-per-ton-carbon-tax-get-exxonmobil-20210806.jpg", "site": "forbes.com", "text": "What does the ESG movement and regulators want from oil and gas companies? Will a carbon tax render these firms bankrupt or will they simply pass these on to consumers?", "url": "https://www.forbes.com/sites/shivaramrajgopal/2021/08/06/would-a-100-per-ton-carbon-tax-get-exxonmobil-to-right-its-errant-ways/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-06T10:28:11-04:00", "date_et": "2021-08-06"}
{"symbol": "XOM", "publishedDate": "2021-08-06 14:34:00", "publisher": "Reuters", "title": "Exxon suspended from climate advocacy group it helped form", "image": "https://images.financialmodelingprep.com/news/exxon-suspended-from-climate-advocacy-group-it-helped-form-20210806.jpg", "site": "reuters.com", "text": "Exxon Mobil Corp was suspended from advocacy group Climate Leadership Council (CLC) that looks to make policies to address climate change, the CLC said on Friday.", "url": "https://www.reuters.com/business/exxon-suspended-climate-advocacy-group-it-helped-form-2021-08-06/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-06T14:34:00-04:00", "date_et": "2021-08-06"}
{"symbol": "XOM", "publishedDate": "2021-08-06 17:14:36", "publisher": "ETF Trends", "title": "Exxon Is Eying a ‘Net Zero' Carbon Goal", "image": "https://images.financialmodelingprep.com/news/exxon-is-eying-a-net-zero-carbon-goal-20210806.jpg", "site": "etftrends.com", "text": "Does Exxon see the writing on the wall? Exxon Mobil Corp could be working to cut its net carbon emissions to zero by 2050.", "url": "https://www.etftrends.com/esg-channel/exxon-is-eying-a-net-zero-carbon-goal/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-06T17:14:36-04:00", "date_et": "2021-08-06"}
{"symbol": "XOM", "publishedDate": "2021-08-07 08:49:43", "publisher": "Forbes", "title": "America's Cancel Culture Comes For ExxonMobil", "image": "https://images.financialmodelingprep.com/news/americas-cancel-culture-comes-for-exxonmobil-20210807.jpg", "site": "forbes.com", "text": "Friday saw an unfortunate energy-related story.", "url": "https://www.forbes.com/sites/davidblackmon/2021/08/07/americas-cancel-culture-comes-for-exxonmobil/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-07T08:49:43-04:00", "date_et": "2021-08-07"}
{"symbol": "XOM", "publishedDate": "2021-08-07 09:30:00", "publisher": "The Motley Fool", "title": "3 Risky Dividend Stocks I Feel Safe Owning", "image": "https://images.financialmodelingprep.com/news/3-risky-dividend-stocks-i-feel-safe-owning-20210807.jpg", "site": "fool.com", "text": "Looking for dividends? These three stocks are still undervalued.", "url": "https://www.fool.com/investing/2021/08/07/3-risky-dividend-stocks-i-feel-safe-owning/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-07T09:30:00-04:00", "date_et": "2021-08-07"}
{"symbol": "XOM", "publishedDate": "2021-08-08 07:24:11", "publisher": "24/7 Wall Street", "title": "5 Top Stocks Analysts Want You To Buy Now", "image": "https://images.financialmodelingprep.com/news/5-top-stocks-analysts-want-you-to-buy-now-20210808.jpg", "site": "247wallst.com", "text": "24/7 Wall St. reviews dozens of analyst research reports each day of the week with a goal of finding new ideas for investors and traders alike.", "url": "https://247wallst.com/investing/2021/08/08/5-top-stocks-analysts-want-you-to-buy-now/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-08T07:24:11-04:00", "date_et": "2021-08-08"}
{"symbol": "XOM", "publishedDate": "2021-08-08 08:24:49", "publisher": "Seeking Alpha", "title": "3 Strong Buys For A Rich Retirement, Up To 9% Yield", "image": "https://images.financialmodelingprep.com/news/3-strong-buys-for-a-rich-retirement-up-to-20210808.jpg", "site": "seekingalpha.com", "text": "There are always bargains to be had in bull and bear markets alike. In this article, I highlight 3 compelling buys with high dividends that are well covered.", "url": "https://seekingalpha.com/article/4446760-3-strong-buys-rich-retirement-dividend-yield", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-08T08:24:49-04:00", "date_et": "2021-08-08"}
{"symbol": "XOM", "publishedDate": "2021-08-09 09:15:00", "publisher": "Seeking Alpha", "title": "Upcoming Ex-Dividend Dates: July 6-July 19, 2021", "image": "https://images.financialmodelingprep.com/news/upcoming-exdividend-dates-july-6july-19-2021-20210809.jpg", "site": "seekingalpha.com", "text": "We provide a summary of upcoming ex-dividend dates in a quick reference table. The table includes relevant data and key statistics as well as the next payout and pay date.", "url": "https://seekingalpha.com/article/4447074-upcoming-ex-dividend-dates-july-6-july-19-2021", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-09T09:15:00-04:00", "date_et": "2021-08-09"}
{"symbol": "XOM", "publishedDate": "2021-08-09 19:40:31", "publisher": "Investopedia", "title": "Exxon Mobil (XOM) Option Traders Bearish After Earnings", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-xom-option-traders-bearish-after-earnings-20210809.jpg", "site": "investopedia.com", "text": "The price action has not been able to break resistance and has remained in the middle of the volatility range.", "url": "https://www.investopedia.com/exxon-mobil-xom-option-traders-bearish-after-earnings-5196394", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-09T19:40:31-04:00", "date_et": "2021-08-09"}
{"symbol": "XOM", "publishedDate": "2021-08-10 06:00:56", "publisher": "InvestorPlace", "title": "ExxonMobil Is a Buy After This Nonsensical Earnings Sell-Off", "image": "https://images.financialmodelingprep.com/news/exxonmobil-is-a-buy-after-this-nonsensical-earnings-selloff-20210810.jpg", "site": "investorplace.com", "text": "ExxonMobil's Q2 earnings report hit almost all the right notes. Don't fret the lack of a buyback for XOM stock, as the company pays down debt first.", "url": "https://investorplace.com/2021/08/xom-stock-is-a-buy-after-nonsensical-earnings-sell-off/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-10T06:00:56-04:00", "date_et": "2021-08-10"}
{"symbol": "XOM", "publishedDate": "2021-08-10 11:13:42", "publisher": "InvestorPlace", "title": "7 Best Dividend Stocks for a Big, Fat Monthly Income Check", "image": "https://images.financialmodelingprep.com/news/7-best-dividend-stocks-for-a-big-fat-monthly-20210810.jpg", "site": "investorplace.com", "text": "These dividend stocks have well-covered payouts and the potential for growth for years to come, exposing investors to diversified holdings. The post 7 Best Dividend Stocks for a Big, Fat Monthly Income Check appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/08/7-best-dividend-stocks-for-a-big-fat-monthly-income-check/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-10T11:13:42-04:00", "date_et": "2021-08-10"}
{"symbol": "XOM", "publishedDate": "2021-08-10 13:41:00", "publisher": "Reuters", "title": "Exclusive: Exxon launches U.S. shale gas sale to kick-start stalled divestitures", "image": "https://images.financialmodelingprep.com/news/exclusive-exxon-launches-us-shale-gas-sale-to-kickstart-20210810.jpg", "site": "reuters.com", "text": "Exxon Mobil Corp has begun marketing U.S. shale gas properties as it ramps up a long-stalled program that aims to raise billions of dollars to shed unwanted assets and reduce debt taken on last year.", "url": "https://www.reuters.com/article/us-exxon-mobil-m-a-shale-exclusive/exclusive-exxon-launches-u-s-shale-gas-sale-to-kick-start-stalled-divestitures-idUSKBN2FB1R5", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-10T13:41:00-04:00", "date_et": "2021-08-10"}
{"symbol": "XOM", "publishedDate": "2021-08-10 17:01:50", "publisher": "InvestorPlace", "title": "7 Best Retirement Stocks to Buy to Build Long-Term Wealth", "image": "https://images.financialmodelingprep.com/news/7-best-retirement-stocks-to-buy-to-build-longterm-20210810.jpg", "site": "investorplace.com", "text": "In a constantly changing world, your search for retirement stocks should focus on sectors that will be relevant for decades to come. The post 7 Best Retirement Stocks to Buy to Build Long-Term Wealth appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/08/7-best-retirement-stocks-to-buy-build-long-term-wealth/", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-10T17:01:50-04:00", "date_et": "2021-08-10"}
{"symbol": "XOM", "publishedDate": "2021-08-10 19:01:00", "publisher": "Seeking Alpha", "title": "Dividend Stock Purchase: Lanny's July 2021 Summary", "image": "https://images.financialmodelingprep.com/news/dividend-stock-purchase-lannys-july-2021-summary-20210810.jpg", "site": "seekingalpha.com", "text": "Dividend Stock Purchase: Lanny's July 2021 Summary", "url": "https://seekingalpha.com/article/4447937-dividend-stock-purchase-lannys-july-2021-summary", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-10T19:01:00-04:00", "date_et": "2021-08-10"}
{"symbol": "XOM", "publishedDate": "2021-08-11 11:02:03", "publisher": "Seeking Alpha", "title": "Forget ARKK: Ranking 100 Big-Dividend Growth Stocks", "image": "https://images.financialmodelingprep.com/news/forget-arkk-ranking-100-bigdividend-growth-stocks-20210811.jpg", "site": "seekingalpha.com", "text": "Forget ARKK: Ranking 100 Big-Dividend Growth Stocks", "url": "https://seekingalpha.com/article/4448143-ranking-100-big-dividend-growth-stocks", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-11T11:02:03-04:00", "date_et": "2021-08-11"}
{"symbol": "XOM", "publishedDate": "2021-08-11 23:24:07", "publisher": "Seeking Alpha", "title": "Exxon Mobil: Despite Woke Mob, 6% Yield Tempting", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-despite-woke-mob-6-yield-tempting-20210811.jpg", "site": "seekingalpha.com", "text": "Exxon Mobil: Despite Woke Mob, 6% Yield Tempting", "url": "https://seekingalpha.com/article/4448411-exxon-mobil-q2-2021-earnings-despite-woke-mob-6-percent-yield-tempting", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-11T23:24:07-04:00", "date_et": "2021-08-11"}
{"symbol": "XOM", "publishedDate": "2021-08-12 01:12:00", "publisher": "Reuters", "title": "Exclusive-Exxon, Chevron look to make renewable fuels without costly refinery upgrades -sources", "image": "https://images.financialmodelingprep.com/news/exclusiveexxon-chevron-look-to-make-renewable-fuels-without-costly-20210812.jpg", "site": "reuters.com", "text": "U.S. oil major Exxon Mobil Corp, along with Chevron Corp, is seeking to bulk up in the burgeoning renewable fuels space by finding ways to make such products at existing facilities, sources familiar with the efforts said.", "url": "https://www.reuters.com/article/us-global-oil-majors-renewables-exclusiv/exclusive-exxon-chevron-look-to-make-renewable-fuels-without-costly-refinery-upgrades-sources-idUSKBN2FD0C1", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-12T01:12:00-04:00", "date_et": "2021-08-12"}
{"symbol": "XOM", "publishedDate": "2021-08-12 10:06:37", "publisher": "Zacks Investment Research", "title": "Here's What the EIA's Latest Crude Inventory Report Revealed", "image": "https://images.financialmodelingprep.com/news/heres-what-the-eias-latest-crude-inventory-report-revealed-20210812.jpg", "site": "zacks.com", "text": "Oil prices remain broadly supported by the improving fundamentals, which helped the likes of ExxonMobil (XOM), Chevron (CVX) Royal Dutch Shell (RDS.A) and BP plc (BP) come up with better-than-expected bottom-line performances in Q2.", "url": "https://www.zacks.com/stock/news/1780850/here-s-what-the-eia-s-latest-crude-inventory-report-revealed", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-12T10:06:37-04:00", "date_et": "2021-08-12"}
{"symbol": "XOM", "publishedDate": "2021-08-13 04:05:56", "publisher": "Seeking Alpha", "title": "Exxon Mobil: How Hydrogen Could Power The Stock Higher", "image": "https://images.financialmodelingprep.com/news/exxon-mobil-how-hydrogen-could-power-the-stock-higher-20210813.jpg", "site": "seekingalpha.com", "text": "Exxon Mobil: How Hydrogen Could Power The Stock Higher", "url": "https://seekingalpha.com/article/4449045-exxon-mobil-how-hydrogen-could-power-the-stock-higher", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-13T04:05:56-04:00", "date_et": "2021-08-13"}
{"symbol": "XOM", "publishedDate": "2021-08-13 09:49:18", "publisher": "Seeking Alpha", "title": "Inflation Rising: Buy These 3 Dividend Stocks", "image": "https://images.financialmodelingprep.com/news/inflation-rising-buy-these-3-dividend-stocks-20210813.jpg", "site": "seekingalpha.com", "text": "Inflation Rising: Buy These 3 Dividend Stocks", "url": "https://seekingalpha.com/article/4449120-inflation-rising-buy-these-3-dividend-stocks", "ticker": "XOM", "event_date": "2021-07-30", "window_start": "2021-07-23", "window_end": "2021-08-13", "publishedDateET": "2021-08-13T09:49:18-04:00", "date_et": "2021-08-13"}
