{"symbol": "JPM", "publishedDate": "2021-02-16 08:20:17", "publisher": "Zacks Investment Research", "title": "Stress Test Scenarios for '21 Revealed: Will Big Banks Pass?", "image": "https://images.financialmodelingprep.com/news/stress-test-scenarios-for-21-revealed-will-big-banks-20210216.jpg", "site": "zacks.com", "text": "Results from the Fed's annual stress tests help determine capital requirements and capital distribution plans for banks like Capital One (COF), Wells Fargo (WFC), JPMorgan (JPM), Citi (C), Morgan Stanley (MS), BofA (BAC) & U.S. Bancorp (USB).", "url": "https://www.zacks.com/stock/news/1263694/stress-test-scenarios-for-21-revealed-will-big-banks-pass", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-16T08:20:17-05:00", "date_et": "2021-02-16"}
{"symbol": "JPM", "publishedDate": "2021-02-16 11:03:00", "publisher": "Business Wire", "title": "JPMorgan Chase Issues $1 Billion Inaugural Social Bonds", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-issues-1-billion-inaugural-social-bonds-20210216.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (“JPMorgan Chase” or the “Firm”) has completed the Firm's inaugural social bond issuance of $1 billion aggregate principal amount of Fixed-to-Floating Rate Notes due 2025 (CUSIP: 46647PBY1) (the “Notes”). Under the Firm's Sustainable Bond Framework (the “Framework”), the Firm may allocate an amount equal to the net proceeds of this issuance to activities that promote economic development by financing small businesses in low- and mo", "url": "https://www.businesswire.com/news/home/20210216005907/en/JPMorgan-Chase-Issues-1-Billion-Inaugural-Social-Bonds/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-16T11:03:00-05:00", "date_et": "2021-02-16"}
{"symbol": "JPM", "publishedDate": "2021-02-16 11:03:00", "publisher": "Business Wire", "title": "JPMorgan Chase Issues $1 Billion Inaugural Social Bonds", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-issues-1-billion-inaugural-social-bonds-20210216.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (“JPMorgan Chase” or the “Firm”) has completed the Firm’s inaugural social bond issuance of $1 billion aggregate principal amount of Fixed-to-Floating Rate Notes due 2025 (CUSIP: 46647PBY1) (the “Notes”). Under the Firm’s Sustainable Bond Framework (the “Framework”), the Firm may allocate an amount equal to the net proceeds of this issuance to activities that promote economic development by financing small businesses in low- and moderate-income (“LMI”) geographies, affordable housing and projects that promote access to education and health care in LMI geographies. The Firm expects the proceeds of this social bond issuance to be allocated to fund affordable housing projects. Building on the Firm’s engagement with diverse suppliers, the co-managers for the bond offering consisted solely of Minority and Women-Owned Business Enterprise and Service-Disabled Veteran-Owned Business firms. JPMorgan Chase’s inaugural social bond issuance builds on the Firm’s inaugural green bond issuance and will support its longstanding commitment to affordable housing. For example, as part of the Firm’s $30 billion commitment to help advance racial equity and support an inclusive economic recovery through business and philanthropic capital, JPMorgan Chase will help promote and expand affordable housing in underserved communities. “JPMorgan Chase is committed to using innovative financing strategies to support a sustainable and inclusive recovery,” said Marisa Buchanan, Head of Sustainability at JPMorgan Chase. “With a focus on boosting affordable housing, our inaugural social bond issuance builds on our leadership in the sustainable bond market and our strategy to use our business expertise to create opportunity for underserved communities.” Sustainable Bond Framework JPMorgan Chase’s inaugural social bond issuance is part of its firmwide sustainability strategy and was issued in accordance with the JPMorgan Chase & Co. Sustainable Bond Framework. The Framework includes more details on JPMorgan Chase’s sustainable bond issuance strategy and eligible project categories. It is available at www.jpmorganchase.com under Who We Are, Governance, Environment, Social and Governance (ESG) Information. History in the Sustainable Bond Market and Sustainable Development JPMorgan Chase’s social bond issuance builds on the Firm’s experience and leadership in the sustainable bond market, including its inaugural green bond issuance in 2020. Marilyn Ceci, Managing Director and Global Head of ESG Debt Capital Markets, currently serves on the Executive Committee that oversees the Green Bond Principles, Social Bond Principles and Sustainability Bond Guidelines. In 2020, the Firm’s broker-dealer subsidiaries underwrote $23.7 billion in green, social, and sustainability bonds. JPMorgan Chase is committed to creating a more sustainable future for its employees and the customers and communities that it serves. In 2020, the Firm expanded its sustainability efforts by announcing its goal to facilitate $200 billion in financing in 2020 for transactions that support climate action and advance the United Nations Sustainable Development Goals. Additionally, in October 2020, the Firm committed to adopting a financing commitment aligned with the goals of the Paris Agreement. JPMorgan Chase has also supported market-based policy solutions to address carbon emissions, both through the Climate Leadership Council and the Firm’s membership in Business Roundtable. More information on how JPMorgan Chase is advancing sustainable solutions is available in the Firm’s 2019 ESG Report and on its sustainability webpage. This press release does not constitute an offer to sell or the solicitation of an offer to buy the Notes or any other securities, nor shall there be any sale of the Notes in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. About JPMorgan Chase & Co. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of consumers in the United States and many of the world’s most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.", "url": "https://www.businesswire.com/news/home/20210216005907/en/JPMorgan-Chase-Issues-1-Billion-Inaugural-Social-Bonds", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-16T11:03:00-05:00", "date_et": "2021-02-16"}
{"symbol": "JPM", "publishedDate": "2021-02-16 18:23:17", "publisher": "GuruFocus", "title": "Warren Buffett's Berkshire Reveals 4th-Quarter Trades", "image": "https://images.financialmodelingprep.com/news/warren-buffetts-berkshire-reveals-4thquarter-trades-20210216.jpg", "site": "gurufocus.com", "text": "Warren Buffett (Trades, Portfolio)'s Berkshire Hathaway Inc. (NYSE:BRK.A)(NYSE:BRK.B) disclosed on Tuesday its fourth-quarter 2020 portfolio, revealing new holdings in Verizon Inc. (NYSE:VZ), Chevron Corp. (NYSE:CVX) and The E.W. Scripps Co. (NYSE:EW).", "url": "https://www.gurufocus.com/news/1360895/warren-buffetts-berkshire-reveals-4thquarter-trades", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-16T18:23:17-05:00", "date_et": "2021-02-16"}
{"symbol": "JPM", "publishedDate": "2021-02-17 01:52:38", "publisher": "CNN", "title": "Warren Buffett sells JPMorgan Chase stock and buys Verizon", "image": "https://images.financialmodelingprep.com/news/warren-buffett-sells-jpmorgan-chase-stock-and-buys-verizon-20210217.jpg", "site": "cnn.com", "text": "It appears that Warren Buffett is souring on the financial sector's prospects, and that the Oracle of Omaha also has a newfound interest in Big Oil, as well as telecom and media.", "url": "https://www.cnn.com/2021/02/16/investing/berkshire-hathaway-warren-buffett-stocks/index.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T01:52:38-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 07:58:31", "publisher": "24/7 Wall Street", "title": "Why the Best GDP Growth in 40 Years Could Drive These 5 Stocks Much Higher", "image": "https://images.financialmodelingprep.com/news/why-the-best-gdp-growth-in-40-years-could-20210217.jpg", "site": "247wallst.com", "text": "Though it may be a somewhat temporary phenomenon, one of Wall Street's top chief economists, Aneta Markowska of Jefferies, sees the potential for the United States economy to experience the best growth in 40 years.", "url": "https://247wallst.com/investing/2021/02/17/why-the-best-gdp-growth-in-40-years-could-drive-these-5-stocks-much-higher/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T07:58:31-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 09:00:00", "publisher": "Business Wire", "title": "Akoya adds JPMorgan Chase to its Data Access Network", "image": "https://images.financialmodelingprep.com/news/akoya-adds-jpmorgan-chase-to-its-data-access-network-20210217.jpg", "site": "businesswire.com", "text": "BOSTON--(BUSINESS WIRE)--Akoya LLC announced today that JPMorgan Chase has joined the Akoya Data Access Network. Fintechs, data aggregators and other data recipients can now request application programming interface (API)-based access to Chase customer data through Akoya. The bank’s commitment to make secure data sharing available through the Akoya Data Access Network significantly increases the scale of the network, which enables one-to-many API connections between data providers, such as financial institutions, and data recipients. The Akoya Data Access Network is available to the entire U.S. financial services industry. \"Our interoperable network, aligned with the Financial Data Exchange API standard, gives data providers and recipients of all sizes access to an efficient, effective option for secure data aggregation without the need to negotiate, build and maintain multiple connections between the parties,\" said Stuart Rubinstein, CEO of Akoya. “It also eliminates the need for consumers to share their bank’s login credentials, typically usernames and passwords, in order to provide access to their financial data.” Chase will begin providing data through the network later this year, as customers permission apps and services to access their Chase accounts through Akoya. Chase also will continue to provide direct API connections for third parties that have signed data-access agreements. “Akoya provides another option for third parties to safely connect to Chase,” said Paul LaRusso, managing director of digital platforms at JPMorgan Chase. “Most importantly, our 55 million digitally active customers will have full control and visibility into the data they choose to share with apps and companies.” Chase customers can use the “Linked apps and websites” dashboard on the bank’s website and mobile app to see which accounts they’ve given apps or companies permission to access as well as what information from those accounts such as balances or transactions. Customers can revoke access whenever they want, and Chase shares only the customer data that the app or company needs. The financial industry has been moving toward APIs over the last few years for security reasons. APIs can improve data access reliability and reduce cybersecurity, privacy, and financial risks compared to credential-based financial data aggregation – a data-sharing method that requires consumers to provide their login credentials to third parties to use various fintech apps and services. Akoya was developed by Fidelity Investments to eliminate the risks associated with credential-based data aggregation, commonly known as “screen scraping.” A year ago, The Clearing House recognized the value Akoya brought to the entire financial services industry and their customers, and so 11 of its member banks, including JPMorgan Chase, invested in the now independent company alongside Fidelity. “This brings us closer to a future where customers know with certainty what information they’re sharing and with whom,” said LaRusso. About Akoya Akoya serves as a financial data access network connecting financial institutions and data recipients. The company's platform enables consumer-permissioned data access based on standardized APIs and eliminates the need for consumers to share account user ids and passwords. With streamlined integration and reduced maintenance, Akoya has created a safer and more efficient data access ecosystem. Learn more at akoya.com. About Chase Chase is the U.S. consumer and commercial banking business of JPMorgan Chase & Co. (NYSE: JPM), a leading global financial services firm with assets of $3.4 trillion and operations worldwide. Chase serves more than 60 million American households with a broad range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. Customers can choose how and where they want to bank: More than 4,700 branches in 38 states and the District of Columbia, 16,000 ATMs, mobile, online and by phone. For more information, go to chase.com.", "url": "https://www.businesswire.com/news/home/20210217005249/en/Akoya-adds-JPMorgan-Chase-to-its-Data-Access-Network", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T09:00:00-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 10:05:41", "publisher": "Investopedia", "title": "JPMorgan (JPM) Breaks Out to All-Time High", "image": "https://images.financialmodelingprep.com/news/jpmorgan-jpm-breaks-out-to-alltime-high-20210217.jpg", "site": "investopedia.com", "text": "JPMorgan (JPM) stock rallied to a new high on Tuesday, fueled by growing financial tailwinds.", "url": "https://www.investopedia.com/jpmorgan-jpm-breaks-out-to-all-time-high-5112900", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T10:05:41-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 14:10:43", "publisher": "Investopedia", "title": "Financial Sector Appears Poised to Move Higher", "image": "https://images.financialmodelingprep.com/news/financial-sector-appears-poised-to-move-higher-20210217.jpg", "site": "investopedia.com", "text": "Price action on the charts suggests that the financial sector could be one to watch over the weeks and months ahead.", "url": "https://www.investopedia.com/financial-sector-appears-poised-to-move-higher-5112988", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T14:10:43-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 14:56:35", "publisher": "InvestorPlace", "title": "7 Blue-Chip Stocks That Aren't a Gamble", "image": "https://images.financialmodelingprep.com/news/7-bluechip-stocks-that-arent-a-gamble-20210217.jpg", "site": "investorplace.com", "text": "If you are getting concerned about the speculative nature of the markets, it might be time to take a good look at blue-chip stocks. The post 7 Blue-Chip Stocks That Aren't a Gamble appeared first on InvestorPlace.", "url": "https://investorplace.com/2021/02/7-blue-chip-stocks-that-arent-a-gamble/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T14:56:35-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 16:01:00", "publisher": "Business Wire", "title": "JPMorgan Chase & Co. Declares Quarterly Coupon on Alerian MLP Index ETN", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-co-declares-quarterly-coupon-on-alerian-mlp-20210217.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JPMorgan Chase & Co. announced today the quarterly coupon amount for the Alerian MLP Index ETN (NYSE Arca: AMJ). The table below summarizes the coupon amount for the Alerian MLP Index ETN (the “Notes”). NYSE Arca Ticker Registered Issue Name Declaration Date Ex-Date Record Date Payment Date Coupon Amount1 per Note Current Yield2 AMJ Alerian MLP Index ETN February 17, 2021 February 26, 2021 March 1, 2021 March 9, 2021 $0.3102 7.8% The Notes are subject to a maximum issuance limitation of 129,000,000 Notes, which may cause the Notes to trade at a premium relative to the indicative note value. Investors that pay a premium for the Notes could incur significant losses if that investor sells its notes at a time when some or all of the premium is no longer present. 1) As defined in the Market-Making Supplement, dated April 8, 2020 for the Notes. You may access this market making supplement as follows: https://www.sec.gov/Archives/edgar/data/19617/000095010320007243/dp125818_424b2-aemsupp.htm 2) “Current Yield” equals the current Coupon Amount annualized and divided by the closing price of the Notes on February 16, 2021 and rounded to one decimal place for ease of analysis. The Current Yield is not indicative of future coupon payments, if any, on the Notes. The Notes are senior, unsecured obligations of JPMorgan Chase & Co. About JPMorgan Chase & Co. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com. Investment suitability must be determined individually for each investor, and the Notes may not be suitable for all investors. This information is not intended to provide and should not be relied upon as providing accounting, legal, regulatory or tax advice. Investors should consult with their own advisors as to these matters. JPMorgan Chase & Co. has filed a registration statement (including a prospectus) with the Securities and Exchange Commission, or SEC, for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement and the other documents relating to this offering that JPMorgan Chase & Co. has filed with the SEC for more complete information about JPMorgan Chase & Co. and this offering. You may get these documents without cost by visiting EDGAR on the SEC website at www.sec.gov. Alternatively, JPMorganChase & Co., any agent or any dealer participating in this offering will arrange to send you the prospectus, the prospectus supplement, the product supplement and the pricing supplement if you so request by calling toll-free 800-576-3529.", "url": "https://www.businesswire.com/news/home/20210217005802/en/JPMorgan-Chase-Co.-Declares-Quarterly-Coupon-on-Alerian-MLP-Index-ETN", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T16:01:00-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-17 18:58:33", "publisher": "Zacks Investment Research", "title": "JPMorgan Chase & Co. (JPM) Gains As Market Dips: What You Should Know", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-co-jpm-gains-as-market-dips-what-20210217.jpg", "site": "zacks.com", "text": "In the latest trading session, JPMorgan Chase & Co. (JPM) closed at $145.10, marking a +0.31% move from the previous day.", "url": "https://www.zacks.com/stock/news/1264921/jpmorgan-chase-co-jpm-gains-as-market-dips-what-you-should-know", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-17T18:58:33-05:00", "date_et": "2021-02-17"}
{"symbol": "JPM", "publishedDate": "2021-02-20 15:49:16", "publisher": "Seeking Alpha", "title": "Week 8 MDA Breakout Stocks - February 2021: Short-Term Picks To Give You An Edge", "image": "https://images.financialmodelingprep.com/news/week-8-mda-breakout-stocks-february-2021-shortterm-picks-20210220.jpg", "site": "seekingalpha.com", "text": "Week 8 MDA Breakout Stocks - February 2021: Short-Term Picks To Give You An Edge", "url": "https://seekingalpha.com/article/4407695-week-8-mda-breakout-stocks-february-2021-short-term-picks-to-give-you-edge", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-20T15:49:16-05:00", "date_et": "2021-02-20"}
{"symbol": "JPM", "publishedDate": "2021-02-21 22:04:34", "publisher": "Seeking Alpha", "title": "CSQ: Distribution Boost Brings This Fund's Yield To 7.22%", "image": "https://images.financialmodelingprep.com/news/csq-distribution-boost-brings-this-funds-yield-to-722-20210221.jpg", "site": "seekingalpha.com", "text": "CSQ: Distribution Boost Brings This Fund's Yield To 7.22%", "url": "https://seekingalpha.com/article/4407814-csq-distribution-boost-brings-this-funds-yield-to-7-percent", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-21T22:04:34-05:00", "date_et": "2021-02-21"}
{"symbol": "JPM", "publishedDate": "2021-02-22 08:03:16", "publisher": "CNBC", "title": "JPMorgan invests in private-stock trading venue with Palantir link amid demand for pre-IPO shares", "image": "https://images.financialmodelingprep.com/news/jpmorgan-invests-in-privatestock-trading-venue-with-palantir-link-20210222.jpg", "site": "cnbc.com", "text": "The move is the first investment JPMorgan has made to help the bank access data and prices in the burgeoning market for private securities.", "url": "https://www.cnbc.com/2021/02/22/jpmorgan-invests-in-private-stock-trading-venue-with-palantir-link-amid-demand-for-pre-ipo-shares.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-22T08:03:16-05:00", "date_et": "2021-02-22"}
{"symbol": "JPM", "publishedDate": "2021-02-22 08:33:00", "publisher": "Business Wire", "title": "J.P. Morgan Makes Strategic Investment in Zanbato", "image": "https://images.financialmodelingprep.com/news/jp-morgan-makes-strategic-investment-in-zanbato-20210222.jpg", "site": "businesswire.com", "text": "MOUNTAIN VIEW, Calif.--(BUSINESS WIRE)--J.P. Morgan becomes first strategic bank investor in Zanbato, further aligning Zanbato's private share trading platform, ZX, with its members.", "url": "https://www.businesswire.com/news/home/20210222005272/en/J.P.-Morgan-Makes-Strategic-Investment-in-Zanbato/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-22T08:33:00-05:00", "date_et": "2021-02-22"}
{"symbol": "JPM", "publishedDate": "2021-02-22 09:49:19", "publisher": "Seeking Alpha", "title": "Wells Fargo: The Big Plan", "image": "https://images.financialmodelingprep.com/news/wells-fargo-the-big-plan-20210222.jpg", "site": "seekingalpha.com", "text": "Wells Fargo: The Big Plan", "url": "https://seekingalpha.com/article/4407874-wells-fargo-wfc-headed-higher-with-a-clear-path-to-5-dollar-plus-eps", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-22T09:49:19-05:00", "date_et": "2021-02-22"}
{"symbol": "JPM", "publishedDate": "2021-02-23 05:01:03", "publisher": "InvestorPlace", "title": "Bitcoin Replaces Gold as the Global Index of Fear and Greed", "image": "https://images.financialmodelingprep.com/news/bitcoin-replaces-gold-as-the-global-index-of-fear-20210223.jpg", "site": "investorplace.com", "text": "Bitcoin has become a global index of greed and fear. It's also the tip of the wedge to eliminate settlement costs through a Chinese digital yuan.", "url": "https://investorplace.com/2021/02/bitcoin-replaces-gold-as-the-global-index-of-fear-and-greed/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T05:01:03-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 07:05:47", "publisher": "InvestorPlace", "title": "4 Undervalued Stocks to Add to Your Large-Cap Portfolio", "image": "https://images.financialmodelingprep.com/news/4-undervalued-stocks-to-add-to-your-largecap-portfolio-20210223.jpg", "site": "investorplace.com", "text": "Undervalued stocks that have strong fundamentals and pay healthy dividends. Low beta stocks as market valuations look stretched.", "url": "https://investorplace.com/2021/02/4-undervalued-stocks-large-cap/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T07:05:47-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 08:00:24", "publisher": "Fox Business", "title": "JPMorgan Chase taps $30B to advance racial equity", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-taps-30b-to-advance-racial-equity-20210223.jpg", "site": "foxbusiness.com", "text": "JPMorgan Chase has announced a series of new initiatives Tuesday to support Minority Depository Institutions (MDIs) and diverse-led Community Development Financial Institutions (CDFIs) as part of a $30 billion commitment to advancing racial equity over the next five years, especially for Black and Latinx Communities.", "url": "https://www.foxbusiness.com/markets/jpmorgan-chase-unveils-new-initiatives-as-part-of-30b-commitment-to-advance-racial-equity", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T08:00:24-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 09:19:19", "publisher": "CNN", "title": "JPMorgan and Google launch program to help minority-owned banks", "image": "https://images.financialmodelingprep.com/news/jpmorgan-and-google-launch-program-to-help-minorityowned-banks-20210223.jpg", "site": "cnn.com", "text": "JPMorgan Chase and Google launched a program Tuesday to help banks owned and led by people of color increase their lending capabilities.", "url": "https://www.cnn.com/2021/02/23/investing/jpmorgan-google-empowering-change-minority-banks/index.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T09:19:19-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 13:30:00", "publisher": "PRNewsWire", "title": "Carver Bancorp Inc. Receives Investment from JPMorgan Chase To Support Economic Empowerment in Communities of Color", "image": "https://images.financialmodelingprep.com/news/carver-bancorp-inc-receives-investment-from-jpmorgan-chase-to-20210223.jpg", "site": "prnewswire.com", "text": "NEW YORK, Feb. 23, 2021 /PRNewswire/ -- Carver Bancorp, Inc. (the \"Company\") (Nasdaq: CARV), the holding company for Carver Federal Savings Bank (\"Carver\"), a certified Minority Depository Institution (\"MDI\"), announced today that JPMorgan Chase (NYSE: JPM) has made a long-term equity...", "url": "https://www.prnewswire.com/news-releases/carver-bancorp-inc-receives-investment-from-jpmorgan-chase-to-support-economic-empowerment-in-communities-of-color-301233823.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T13:30:00-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 16:45:00", "publisher": "Business Wire", "title": "JPMorgan Chase Files Form 10-K for the Fiscal Year Ended December 31, 2020", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-files-form-10k-for-the-fiscal-year-20210223.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (“JPMorgan Chase” or the “Firm”) has filed its Annual Report on Form 10-K for the fiscal year ended December 31, 2020 with the SEC. The report is available on the SEC's website at https://www.sec.gov and will be available on the Firm's Investor Relations website at https://www.jpmorganchase.com/ir under SEC Filings & Other Disclosures. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.", "url": "https://www.businesswire.com/news/home/20210223006145/en/JPMorgan-Chase-Files-Form-10-K-for-the-Fiscal-Year-Ended-December-31-2020", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T16:45:00-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 16:45:00", "publisher": "Business Wire", "title": "JPMorgan Chase Files Form 10-K for the Fiscal Year Ended December 31, 2020", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-files-form-10k-for-the-fiscal-year-ended-20210223.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (“JPMorgan Chase” or the “Firm”) has filed its Annual Report on Form 10-K for the fiscal year ended December 31, 2020 with the SEC. The report is available on the SEC's website at https://www.sec.gov and will be available on the Firm's Investor Relations website at https://www.jpmorganchase.com/ir under SEC Filings & Other Disclosures. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets", "url": "https://www.businesswire.com/news/home/20210223006145/en/JPMorgan-Chase-Files-Form-10-K-for-the-Fiscal-Year-Ended-December-31-2020/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T16:45:00-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-23 18:55:56", "publisher": "Zacks Investment Research", "title": "JPMorgan Chase & Co. (JPM) Outpaces Stock Market Gains: What You Should Know", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-co-jpm-outpaces-stock-market-gains-what-20210223.jpg", "site": "zacks.com", "text": "JPMorgan Chase & Co. (JPM) closed the most recent trading day at $150.61, moving +0.8% from the previous trading session.", "url": "https://www.zacks.com/stock/news/1268377/jpmorgan-chase-co-jpm-outpaces-stock-market-gains-what-you-should-know", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-23T18:55:56-05:00", "date_et": "2021-02-23"}
{"symbol": "JPM", "publishedDate": "2021-02-25 02:00:00", "publisher": "Business Wire", "title": "JPMorgan Chase and the Sutton Trust Launch £4.8 Million Bursary Fund for University Students", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-and-the-sutton-trust-launch-48-million-bursary-20210225.jpg", "site": "businesswire.com", "text": "LONDON--(BUSINESS WIRE)--JPMorgan Chase and the Sutton Trust today announced the launch of a nearly £4.8 million endowment fund to improve the access to employability opportunities for underserved, low-income and BME (Black and Minority Ethnic) university students in the UK, starting with 350 students in the next ten years. This new commitment will provide students with bursaries to help them access critical enrichment opportunities and improve their employability. The bursaries will help finan", "url": "https://www.businesswire.com/news/home/20210224006122/en/JPMorgan-Chase-and-the-Sutton-Trust-Launch-%C2%A34.8-Million-Bursary-Fund-for-University-Students/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T02:00:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 02:00:00", "publisher": "Business Wire", "title": "JPMorgan Chase and the Sutton Trust Launch £4.8 Million Bursary Fund for University Students", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-and-the-sutton-trust-launch-48-million-20210225.jpg", "site": "businesswire.com", "text": "LONDON--(BUSINESS WIRE)--JPMorgan Chase and the Sutton Trust today announced the launch of a nearly £4.8 million endowment fund to improve the access to employability opportunities for underserved, low-income and BME (Black and Minority Ethnic) university students in the UK, starting with 350 students in the next ten years. This new commitment will provide students with bursaries to help them access critical enrichment opportunities and improve their employability. The bursaries will help finance opportunities like internships, study abroad programmes, volunteering experiences, additional courses or training, and essential living costs – including accommodation, subsistence and study materials. To help boost social mobility for underserved students, the Sutton Trust will build a pipeline of diverse talent for in-demand jobs leading to well-paying career pathways. Around 60% of the bursaries will be targeted at Black and Minority Ethnic students, to reflect the additional barriers that these students face. The Sutton Trust published today new research, which found that the number of students not taking part in work experience or studying abroad was up by more than half, from 23% pre-pandemic to 37%. In addition, almost two-thirds (64%) of students from working-class backgrounds said they were living at home this term, and have been consequently locked out of a full university experience and all the enrichment and growth opportunities it presents. The new £4.8 million bursary fund aims to help mitigate the gap in employability outcomes, between students who have access to activities, experiences and courses and those who do not. The gap has been highlighted and exacerbated by the disproportionate impact of COVID-19 on the employability of university students from socio-economically disadvantaged backgrounds - including Sutton Trust alumni currently in university – by helping them access bursaries of up to £5,000. The application process for the bursaries will start this summer and cover students’ participation in a wide range of activities and events beyond their core academic course. Bursaries will be offered in every academic year. The endowment - which was funded by the firm’s Investment Banking and Asset Management divisions - leverages JPMorgan Chase’s expertise and reach to help boost the social mobility of underserved university students. It will be run by the Sutton Trust and managed at no cost by J.P. Morgan Private Bank, with the goal of creating a lasting endowment of at least 20 years. As part of its commitment to creating an inclusive economy, JPMorgan Chase is also announcing today a £30,000 commitment to Amos Bursary to help boost the employability of students of African-Caribbean heritage through bursaries to fund enrichment activities. Viswas Raghavan, CEO of J.P. Morgan in EMEA, said: “The COVID-19 pandemic has further exacerbated historic inequities and structural barriers to opportunity for young people from low income backgrounds – especially Black and other ethnic minority groups. Good jobs are key to social mobility and improving the employability of disadvantaged students is an important first step towards a promising, sustainable and well paid career.” Sir Peter Lampl, founder and chairman of the Sutton Trust and chairman of the Education Endowment Foundation, said: “I’m delighted that through our new partnership with JPMorgan Chase we will be able to offer support to hundreds of Sutton Trust alumni in the decade to come. This will enable them to take part in truly life-changing experiences which will build important skills such as communication, resilience, confidence, motivation and leadership; skills which previous Sutton Trust research has shown are highly valued by employers.” The Sutton Trust is a 25-year-old UK charity supporting 6,000+ young, lower-income people from their early years to entry into the workplace. JPMorgan Chase’s Commitment to Racial Equity This new effort follows a $30 billion commitment by JPMorgan Chase to advance racial equity through its expertise in business, policy and philanthropy. The commitment will focus on promoting and expanding affordable housing and homeownership, growing Black and ethnic-minority owned small businesses, improving financial health and access to banking, and building a more diverse and inclusive workplace. In the U.K., the firm has a history of investing in career readiness for the next generation of leaders – including supporting Black and other ethnic minority students and leaders - through efforts like Advancing Black Pathways, New Skills at Work programmes, front office investment banking apprenticeships for school leavers and a £2 million philanthropic investment to support minority-led nonprofit organisations in London. About JPMorgan Chase JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world’s most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com. About the Sutton Trust The Sutton Trust was founded by Sir Peter Lampl in 1997 to improve social mobility in Britain. The Trust has influenced government policy on more than 30 occasions; its programmes have to date given 50,000 young people the opportunity to change their lives; and it has published over 200 pieces of agenda-setting research.", "url": "https://www.businesswire.com/news/home/20210224006122/en/JPMorgan-Chase-and-the-Sutton-Trust-Launch-%C2%A34.8-Million-Bursary-Fund-for-University-Students", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T02:00:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 07:00:00", "publisher": "Business Wire", "title": "Launch of New Chase Lounge at the Russell Center Will Help Fuel Path to Success for Black Business Owners and Entrepreneurs in Atlanta", "image": "https://images.financialmodelingprep.com/news/launch-of-new-chase-lounge-at-the-russell-center-will-20210225.jpg", "site": "businesswire.com", "text": "ATLANTA--(BUSINESS WIRE)--Chase and the Russell Innovation Center for Entrepreneurs (RICE), the largest nonprofit center for Black entrepreneurs and small business owners in the nation, today announced the debut of the Chase Lounge at the Russell Center. Located in the heart of Atlanta at 504 Fair St. SW, the Chase Lounge at RICE will foster a high-energy, inclusive community with lab-to-market resources for emerging and progressing business owners that will drive real diversity, inspiration and collaboration among Atlanta’s thought leaders. The Chase Lounge further enhances the innovative, multi-use space RICE provides entrepreneurs and small business owners to gather, learn and advance their financial futures. “Entrepreneurship is the lifeblood of our economy and the most common path to fulfilling the American Dream,” said Mark Adams, Georgia and North Florida Market Director for Chase. “We’re committed to ensuring that more Black entrepreneurs and people of color have access to the resources they need to pursue this dream. Being embedded at RICE – inspired by the legacy of Herman J. Russell – will facilitate authentic, trust building interactions with local entrepreneurs on the path to fulfilling their dreams.” Chase is among several corporate, foundation and individual partners, including the Ressler Gertz Family Foundation and the Atlanta Hawks, supporting RICE’s commitment to deliver a majority self-sustaining facility with world-class programming that provides a comprehensive space for all aspects of small business enablement. Readily available access to financial consulting and small business education is a core part of building a small business and creating the path to success. The Russell Center recently changed its name to RICE to put more focus on the reason it was built: to serve as Atlanta’s home for Black entrepreneurs. In addition to the name change, RICE’s brand identity refresh encompasses all design assets, including a new website, which will launch soon. “We want to support and prepare the people and businesses in Atlanta for a brighter future that drives generational economic growth,” said Dominique Wilkins, Vice President of Basketball and Special Advisor to the CEO of the Atlanta Hawks. “The Hawks Foundation is proud to join the Russell Center and Chase in this effort to bring more resources to entrepreneurs in Greater Atlanta.” To help strengthen the firm’s connection in Atlanta, Chase has added a community manager to the Chase Lounge, who will be responsible for one-on-one engagement and consultation with customers and will also lead the development of programming for entrepreneurs, individuals and students. One such program that’s already in place are monthly Chase Business Banking “Resource Roundtables,” where bankers will host community events to discuss best practices for how to successfully operate a business, while sharing insights about new products, resources and services for entrepreneurs. “We are proud to partner with JPMorgan Chase in our shared commitment to pursue pathways that expand the possibilities for Black entrepreneurs in Atlanta and across our nation, especially at this critical time amid a global pandemic that has disproportionately impacted Black- and Brown-owned businesses,” said Jay Bailey, CEO and president of RICE. “Access to financial education and advice is a crucial foundational element of business success. We’re excited to debut the Chase Lounge as one of the first elements of our recently remodeled, dynamic space because it will help our business owners monetize their assets and advance in their journey of building generational wealth.” Atlanta Minority Small Business Grants and Investments JPMorgan Chase also announced an additional $392,000 in grants to three small business-focused non-profits in Atlanta: Morehouse College Entrepreneurship Center, Access to Capital for Entrepreneurs and Atlanta Wealth Building Initiative. In total, since 2017, Chase has invested $1.9 million in Atlanta small business-focused endeavors. Chase’s partnership with the Russell Center goes beyond dollars by giving small business owners the resources they need – like financial consulting and small business education – to begin, grow and succeed. Advancing Black Pathways The Chase Lounge stems from the firm’s Advancing Black Pathways strategy, which seeks to strengthen the economic foundation of the Black community through targeted investments in three key areas: Financial health & wealth creation Education, and Careers & entrepreneurship. “Being embedded in the Russell Center will allow us to connect directly with entrepreneurs and small business owners and make a difference in the Atlanta community,” said Byna Elliott, head of Advancing Black Pathways at JPMorgan Chase. “We expect to use the center as our home base for Corporate Responsibility initiatives in the community, but also to build and deepen relationships with consumer, business and commercial banking customers and prospects.” To learn more about the Chase Lounge at the RICE or to take part in the virtual launch event on February 25 at 2 pm, visit www.jpmorganchase.com/rice. About JPMorgan Chase & Co. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world’s most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com. About Russell Innovation Center for Entrepreneurs RICE The Russell Innovation Center for Entrepreneurs (RICE) is Atlanta’s home for Black entrepreneurs. RICE’s goal is to be an economic mobility engine for the community: driving entrepreneurs and small business owners to innovate, grow, create jobs and build wealth. RICE was inspired by the legacy of Herman J. Russell, who overcame racism, poverty and a debilitating speech impediment to become one of the most successful Black entrepreneurs and civic leaders in Atlanta. The only initiative of its kind in the nation, RICE will be part business generator, innovation lab and museum. RICE houses over 50,000 sq. ft. of affordable co-working, convening, meeting and innovation space in a LEED Silver Certified building, brought to life by a robust offering of educational, networking, mentoring and capital resources. RICE invests in Black entrepreneurs, strengthens businesses and creates community. For more information about the Center, visit www.rcie.org.", "url": "https://www.businesswire.com/news/home/20210225005197/en/Launch-of-New-Chase-Lounge-at-the-Russell-Center-Will-Help-Fuel-Path-to-Success-for-Black-Business-Owners-and-Entrepreneurs-in-Atlanta", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T07:00:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 07:00:00", "publisher": "Business Wire", "title": "Launch of New Chase Lounge at the Russell Center Will Help Fuel Path to Success for Black Business Owners and Entrepreneurs in Atlanta", "image": "https://images.financialmodelingprep.com/news/launch-of-new-chase-lounge-at-the-russell-center-20210225.jpg", "site": "businesswire.com", "text": "ATLANTA--(BUSINESS WIRE)--Chase and the Russell Innovation Center for Entrepreneurs (RICE), the largest nonprofit center for Black entrepreneurs and small business owners in the nation, today announced the debut of the Chase Lounge at the Russell Center. Located in the heart of Atlanta at 504 Fair St. SW, the Chase Lounge at RICE will foster a high-energy, inclusive community with lab-to-market resources for emerging and progressing business owners that will drive real diversity, inspiration an", "url": "https://www.businesswire.com/news/home/20210225005197/en/Launch-of-New-Chase-Lounge-at-the-Russell-Center-Will-Help-Fuel-Path-to-Success-for-Black-Business-Owners-and-Entrepreneurs-in-Atlanta/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T07:00:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 07:55:46", "publisher": "24/7 Wall Street", "title": "Big Banks Love Rising Interest Rates: 4 Dividend Stocks to Buy Now", "image": "https://images.financialmodelingprep.com/news/big-banks-love-rising-interest-rates-4-dividend-stocks-20210225.jpg", "site": "247wallst.com", "text": "Some stock market participants are on pins and needles as interest rates have edged higher.", "url": "https://247wallst.com/banking-finance/2021/02/25/big-banks-love-rising-interest-rates-4-dividend-stocks-to-buy-now/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T07:55:46-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 07:56:00", "publisher": "Business Wire", "title": "JPMorgan Chase Commits $350 Million to Grow Black, Latinx and Women-owned Small Businesses", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-commits-350-million-to-grow-black-latinx-and-20210225.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--Today, JPMorgan Chase announced a new $350 million, five-year global commitment to grow Black, Latinx, women-owned and other underserved small businesses, help address the racial wealth divide and create a more inclusive recovery from the COVID-19 pandemic. The pandemic has exacerbated historic challenges for Black, Latinx, women and other underserved small businesses to access necessary capital to sustain and grow. According to the JPMorgan Chase Institute, Black, La", "url": "https://www.businesswire.com/news/home/20210225005233/en/JPMorgan-Chase-Commits-350-Million-to-Grow-Black-Latinx-and-Women-owned-Small-Businesses/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T07:56:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 07:56:00", "publisher": "Business Wire", "title": "JPMorgan Chase Commits $350 Million to Grow Black, Latinx and Women-owned Small Businesses", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-commits-350-million-to-grow-black-latinx-20210225.jpg", "site": "businesswire.com", "text": "NEW YORK--(BUSINESS WIRE)--Today, JPMorgan Chase announced a new $350 million, five-year global commitment to grow Black, Latinx, women-owned and other underserved small businesses, help address the racial wealth divide and create a more inclusive recovery from the COVID-19 pandemic. The pandemic has exacerbated historic challenges for Black, Latinx, women and other underserved small businesses to access necessary capital to sustain and grow. According to the JPMorgan Chase Institute, Black, Latinx and women-owned small businesses are underrepresented among firms with substantial external financing, limiting opportunities to scale their business. Further, financial challenges faced by Black and Latinx small businesses are more substantial relative to white-owned businesses, meaning they are especially vulnerable in today’s environment. This new commitment, which combines low-cost loans, equity investments and philanthropy, will help reduce barriers to capital for underserved small businesses to support their immediate needs and long-term growth. More than 40% of the commitment will be low-cost loans and equity investments, removing a critical barrier for Black, Latinx, women and other underserved entrepreneurs. The investment is part of JPMorgan Chase’s $30 billion commitment to provide economic opportunity to underserved communities, especially the Black and Latinx communities, by harnessing its business, policy, data and philanthropic expertise. “Black, Latinx and women entrepreneurs face historic challenges to accessing the capital and other resources needed to keep their doors open during the pandemic and ultimately have the opportunity to grow long-term,” said Jamie Dimon, Chairman and CEO, JPMorgan Chase & Co. “Now more than ever, business has a responsibility to help solve societal problems. We’re pulling together our business resources, philanthropy and policy expertise to address the racial wealth gap, give underserved small businesses the support they need to grow, and build a more inclusive economy.” JPMorgan Chase’s new five-year, $350 million global commitment will help reduce barriers to capital access and grow thousands of additional underserved businesses by: Low-Cost Loans and Equity Investments: Providing low-cost, long-term capital and technical expertise to more underserved entrepreneurs in the U.S., including expanding the Entrepreneurs of Color Fund to new U.S. cities; making direct equity investments in early-stage businesses to help companies like Bitwise Industries, the firm’s initial direct equity investment, drive economic opportunity, including in Black and Latinx communities. Policy Solutions: Releasing new data-driven policy solutions through the JPMorgan Chase PolicyCenter to improve Small Business Administration (SBA) programs, including the Community Advantage, government procurement and Small Business Investment Company (SBIC) programs, to better meet the needs of minority- and women-owned small businesses. Philanthropy: Making philanthropic investments to build the capacity of diverse-led nonprofits across the globe to more effectively support entrepreneurs, and support the signature Ascend Program, currently active in 13 cities, to provide underserved entrepreneurs with business education, consulting services and partnerships with anchor institutions. Together, these initiatives will help improve access to capital for Black, Latinx, women and other underserved entrepreneurs and address the racial wealth divide. JPMorgan Chase first launched its Small Business Forward initiative in 2015. Over the last five years, the firm has provided more than $200 million in philanthropy, including $20 million in COVID-19 relief, to support underserved small businesses in cities around the world. These funds provided access to capital and technical support to more than 1 million diverse small businesses, which have raised nearly $10 billion in capital and increased revenue by an average of 22%. Expanding the Entrepreneurs of Color Fund In collaboration with Local Initiatives Support Corporation (LISC) and a network of CDFIs, JPMorgan Chase is investing $42.5 million in low-cost loans and philanthropy to expand the Entrepreneurs of Color Fund, which currently operates in five U.S. cities. This commitment will scale the Entrepreneurs of Color Fund program to reach new U.S. cities in 2021 with the goal to create a nationwide program providing low-cost loans and technical assistance to minority-owned small businesses through CDFI partners over time. The program aims to assist over 3,000 small businesses by attracting capital from additional investors and applying lessons learned investments in other cities. “Even in strong economic times, minority-owned businesses are more likely to struggle to access appropriate financing than their white counterparts,” said Steve Hall, Senior Director of Small Business Lending, Local Initiatives Support Corporation (LISC). “That not only affects owners and their families; it means the communities where they operate have more limited access to goods, services, jobs and economic growth. JPMorgan Chase is helping bridge that gap, while also helping these entrepreneurs prepare to successfully emerge from the losses of the pandemic.” Since its inception in Detroit in 2015, the Entrepreneurs of Color Fund has provided over 1,200 loans and deployed more than $32 million in capital to Black, Latinx and other underserved entrepreneurs, including Jimmie Williams from Chicago, who received a small business loan to scale his landscaping company. The program has grown to include a network of 12 CDFIs in five metro areas including Detroit, the Bay Area, South Bronx, Chicago and the Greater Washington DC area. The Entrepreneurs of Color Fund is an example of cities as laboratories of innovation, where one pilot program, tested in a handful of cities over time, can be scaled to support small businesses in communities across the country. Advancing Data-Driven Policy Solutions to Reform Federal Programs The JPMorgan Chase PolicyCenter released new data-driven policy recommendations to address immediate and long-term needs of underserved small businesses, particularly minority and women-owned small businesses. Among its recommendations, the firm is advocating for: Increasing resources for the Small Business Administration (SBA) Microloan program, which provides loans of up to $50,000 to help small businesses start up and grow to scale, to reach more underserved entrepreneurs representing the smallest businesses; Making permanent the SBA Community Advantage program, a pilot program to meet the credit needs of underserved markets that is set to expire in 2022; Increasing the Department of Treasury’s CDFI Fund to $1 billion with a set-aside for Black-led CDFIs in order to boost economic revitalization in underserved communities; Improving government procurement programs and policies to provide greater opportunity for underserved small business owners to secure government contracts; Creating a stable source of federal funding for state and local governments to provide local small businesses with relief loans and grants. The firm will put its weight behind advancing these policy reforms, informed in part by the JPMorgan Chase Institute’s distinctive research, to support the long-term survival of underserved small businesses. JPMorgan Chase’s $30 Billion Commitment to Advance Racial Equity In October 2020, JPMorgan Chase announced a $30 billion commitment over five years to provide economic opportunity to underserved communities, especially the Black and Latinx communities, and drive an inclusive economic recovery. The firm is continuing to put this commitment into practice and help address the racial wealth divide by combining our business, policy, data and philanthropic expertise. The firm’s recent efforts include: Providing $40 million in direct equity investments and commitments to Black-led minority depository institutions (MDIs) and diverse-led CDFIs; Creating an Empower share class to help bridge the gap between institutional clients and MDIs and CDFIs by providing them with the ability to distribute our money market funds to drive new, recurring revenue streams; Investing up to $200 million in Ariel Alternatives and Project Black, which aims to close the racial wealth gap by investing in middle market businesses that are minority owned or will become minority owned; Advancing data-driven policy solutions to provide immediate economic relief and drive an inclusive recovery for those struggling the most. About JPMorgan Chase & Co. JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $3.4 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.", "url": "https://www.businesswire.com/news/home/20210225005233/en/JPMorgan-Chase-Commits-350-Million-to-Grow-Black-Latinx-and-Women-owned-Small-Businesses", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T07:56:00-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 09:08:58", "publisher": "Zacks Investment Research", "title": "FDIC-Insured Banks' Q4 Earnings Up, NIM Shrinks on Low Rates", "image": "https://images.financialmodelingprep.com/news/fdicinsured-banks-q4-earnings-up-nim-shrinks-on-low-20210225.jpg", "site": "zacks.com", "text": "Lower provisions & rise in fee income aid FDIC-insured banks' Q4 earnings. Driven by these factors, big banks like JPMorgan (JPM), BofA (BAC), Citi (C), Wells Fargo (WFC) & Truist Financial (TFC) have seen growth in financials.", "url": "https://www.zacks.com/stock/news/1269302/fdic-insured-banks-q4-earnings-up-nim-shrinks-on-low-rates", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T09:08:58-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-25 12:09:16", "publisher": "Zacks Investment Research", "title": "JPMorgan (JPM) to Shift Mexico Wealth Clients to Banco Bilbao", "image": "https://images.financialmodelingprep.com/news/jpmorgan-jpm-to-shift-mexico-wealth-clients-to-banco-20210225.jpg", "site": "zacks.com", "text": "JPMorgan (JPM) plans to shut its private banking business in Mexico. Thus, it is referring its Mexico wealth management clients to Banco Bilbao's Mexico unit.", "url": "https://www.zacks.com/stock/news/1269633/jpmorgan-jpm-to-shift-mexico-wealth-clients-to-banco-bilbao", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-25T12:09:16-05:00", "date_et": "2021-02-25"}
{"symbol": "JPM", "publishedDate": "2021-02-26 09:30:00", "publisher": "PRNewsWire", "title": "J.P. Morgan Asset Management Launches Two Hedged Equity Funds: JHQDX and JHQTX", "image": "https://images.financialmodelingprep.com/news/jp-morgan-asset-management-launches-two-hedged-equity-funds-20210226.jpg", "site": "prnewswire.com", "text": "NEW YORK, Feb. 26, 2021 /PRNewswire/ -- J.P. Morgan Asset Management today announced the launch of two Hedged Equity funds: JPMorgan Hedged Equity 2 (I-Shares: JHQDX) and JPMorgan Hedged Equity 3 (I-Shares: JHQTX) (collectively, the \"funds\"). Employing the scale and expertise of J.P....", "url": "https://www.prnewswire.com/news-releases/jp-morgan-asset-management-launches-two-hedged-equity-funds-jhqdx-and-jhqtx-301236432.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-26T09:30:00-05:00", "date_et": "2021-02-26"}
{"symbol": "JPM", "publishedDate": "2021-02-26 12:53:35", "publisher": "Zacks Investment Research", "title": "Citi, JPMorgan Expect Trading Revenues to Disappoint in Q1", "image": "https://images.financialmodelingprep.com/news/citi-jpmorgan-expect-trading-revenues-to-disappoint-in-q1-20210226.jpg", "site": "zacks.com", "text": "CFOs of Citi (C) and JPMorgan (JPM) expect the performance of trading revenues to be weaker than that reported in the year-ago quarter due to lower volatility.", "url": "https://www.zacks.com/stock/news/1270351/citi-jpmorgan-expect-trading-revenues-to-disappoint-in-q1", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-26T12:53:35-05:00", "date_et": "2021-02-26"}
{"symbol": "JPM", "publishedDate": "2021-02-27 17:55:38", "publisher": "Investopedia", "title": "Ex-JPM Blockchain Lead Announces New Venture", "image": "https://images.financialmodelingprep.com/news/exjpm-blockchain-lead-announces-new-venture-20210227.jpg", "site": "investopedia.com", "text": "The former head of JPMorgan's blockchain initiatives launched Clovyr, a decentralized app store.", "url": "https://www.investopedia.com/news/exjpm-blockchain-lead-announces-new-venture/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-27T17:55:38-05:00", "date_et": "2021-02-27"}
{"symbol": "JPM", "publishedDate": "2021-02-28 07:03:00", "publisher": "The Motley Fool", "title": "5 Low-Cost Vanguard Funds for Dividend Income", "image": "https://images.financialmodelingprep.com/news/5-lowcost-vanguard-funds-for-dividend-income-20210228.jpg", "site": "fool.com", "text": "Diversification and dividends can be yours with these five cost-efficient funds.", "url": "https://www.fool.com/investing/2021/02/28/5-low-cost-vanguard-funds-for-dividend-income/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-28T07:03:00-05:00", "date_et": "2021-02-28"}
{"symbol": "JPM", "publishedDate": "2021-02-28 07:20:10", "publisher": "Seeking Alpha", "title": "Week 9 MDA Breakout Stocks - March 2021: Short-Term Picks To Give You An Edge", "image": "https://images.financialmodelingprep.com/news/week-9-mda-breakout-stocks-march-2021-shortterm-picks-20210228.jpg", "site": "seekingalpha.com", "text": "Week 9 MDA Breakout Stocks - March 2021: Short-Term Picks To Give You An Edge", "url": "https://seekingalpha.com/article/4410083-week-9-mda-breakout-stocks-march-2021-short-term-picks-to-give-you-edge", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-02-28T07:20:10-05:00", "date_et": "2021-02-28"}
{"symbol": "JPM", "publishedDate": "2021-03-01 10:24:29", "publisher": "Seeking Alpha", "title": "Will Jane Fraser Fix Citigroup's Problems?", "image": "https://images.financialmodelingprep.com/news/will-jane-fraser-fix-citigroups-problems-20210301.jpg", "site": "seekingalpha.com", "text": "Will Jane Fraser Fix Citigroup's Problems?", "url": "https://seekingalpha.com/article/4410276-will-jane-fraser-fix-citigroups-problems", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-01T10:24:29-05:00", "date_et": "2021-03-01"}
{"symbol": "JPM", "publishedDate": "2021-03-02 09:30:00", "publisher": "PRNewsWire", "title": "J.P. Morgan Asset Management Launches Short Duration Core Plus ETF: JSCP", "image": "https://images.financialmodelingprep.com/news/jp-morgan-asset-management-launches-short-duration-core-plus-20210302.jpg", "site": "prnewswire.com", "text": "NEW YORK, March 2, 2021 /PRNewswire/ -- J.P. Morgan Asset Management today announced the launch of JPMorgan Short Duration Core Plus ETF (JSCP), an actively managed fixed-income ETF designed to deliver total return, consistent with the preservation of capital, by investing in investment...", "url": "https://www.prnewswire.com/news-releases/jp-morgan-asset-management-launches-short-duration-core-plus-etf-jscp-301238603.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-02T09:30:00-05:00", "date_et": "2021-03-02"}
{"symbol": "JPM", "publishedDate": "2021-03-02 15:49:33", "publisher": "Seeking Alpha", "title": "Librarian Capital's Monthly Top Buys And Price Moves - February 2021", "image": "https://images.financialmodelingprep.com/news/librarian-capitals-monthly-top-buys-and-price-moves-february-20210302.jpg", "site": "seekingalpha.com", "text": "The top 10 stocks in our coverage by forecasted annualized return remain unchanged from last month, with 4 of them being Tobacco stocks.", "url": "https://seekingalpha.com/article/4410822-librarian-capitals-monthly-top-buys-and-price-moves-february-2021", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-02T15:49:33-05:00", "date_et": "2021-03-02"}
{"symbol": "JPM", "publishedDate": "2021-03-02 18:55:14", "publisher": "Zacks Investment Research", "title": "JPMorgan Chase & Co. (JPM) Stock Moves -0.33%: What You Should Know", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-co-jpm-stock-moves-033-what-you-20210302.jpg", "site": "zacks.com", "text": "In the latest trading session, JPMorgan Chase & Co. (JPM) closed at $150.01, marking a -0.33% move from the previous day.", "url": "https://www.zacks.com/stock/news/1272192/jpmorgan-chase-co-jpm-stock-moves-033-what-you-should-know", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-02T18:55:14-05:00", "date_et": "2021-03-02"}
{"symbol": "JPM", "publishedDate": "2021-03-03 10:00:00", "publisher": "PRNewsWire", "title": "J.P. Morgan Asset Management Releases 2021 Guide to Alternatives", "image": "https://images.financialmodelingprep.com/news/jp-morgan-asset-management-releases-2021-guide-to-alternatives-20210303.jpg", "site": "prnewswire.com", "text": "NEW YORK, March 3, 2021 /PRNewswire/ -- J.P. Morgan Asset Management today announced the launch of the 2021 Guide to Alternatives, providing an objective analysis of the key themes impacting alternative investments. In its third year, the quarterly Guide provides an objective analysis of...", "url": "https://www.prnewswire.com/news-releases/jp-morgan-asset-management-releases-2021-guide-to-alternatives-301239600.html", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-03T10:00:00-05:00", "date_et": "2021-03-03"}
{"symbol": "JPM", "publishedDate": "2021-03-04 09:13:02", "publisher": "Seeking Alpha", "title": "JPMorgan: Strong Diversification And Excellence Across Segments", "image": "https://images.financialmodelingprep.com/news/jpmorgan-strong-diversification-and-excellence-across-segments-20210304.jpg", "site": "seekingalpha.com", "text": "JPMorgan has grown remarkably under CEO Jamie Dimon's leadership which has catapulted the bank to be one of the largest in the world. The bank is highly diversified with four major operating segments across consumer, commercial, investment banking and wealth management.", "url": "https://seekingalpha.com/article/4411324-jp-morgan-strong-diversification-and-excellence", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-04T09:13:02-05:00", "date_et": "2021-03-04"}
{"symbol": "JPM", "publishedDate": "2021-03-04 14:20:45", "publisher": "InvestorPlace", "title": "Big Banks Are Moving Toward Embracing Bitcoin", "image": "https://images.financialmodelingprep.com/news/big-banks-are-moving-toward-embracing-bitcoin-20210304.jpg", "site": "investorplace.com", "text": "Bitcoin white papers show that banks are leaning towards accepting its use. Bitcoin is gaining acceptance among banks and major corporations as a store of value.", "url": "https://investorplace.com/2021/03/bitcoin-is-gaining-acceptance-on-wall-street-as-a-store-of-value/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-04T14:20:45-05:00", "date_et": "2021-03-04"}
{"symbol": "JPM", "publishedDate": "2021-03-04 15:11:02", "publisher": "Zacks Investment Research", "title": "Why Warren Buffett Can't Quit the Old Economy", "image": "https://images.financialmodelingprep.com/news/why-warren-buffett-cant-quit-the-old-economy-20210304.jpg", "site": "zacks.com", "text": "With technology stocks soaring, Berkshire Hathaway went all in on oil and telecom.", "url": "https://www.zacks.com/stock/news/1273637/why-warren-buffett-cant-quit-the-old-economy", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-04T15:11:02-05:00", "date_et": "2021-03-04"}
{"symbol": "JPM", "publishedDate": "2021-03-06 07:30:00", "publisher": "The Motley Fool", "title": "6 Ways JPMorgan Chase Can Continue to Grow Its Business", "image": "https://images.financialmodelingprep.com/news/6-ways-jpmorgan-chase-can-continue-to-grow-its-20210306.jpg", "site": "fool.com", "text": "While JPMorgan Chase is already the largest bank in the U.S., there is lots of room for new opportunities both geographically and within business lines.", "url": "https://www.fool.com/investing/2021/03/06/6-ways-jpmorgan-chase-can-continue-to-grow-its-bus/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-06T07:30:00-05:00", "date_et": "2021-03-06"}
{"symbol": "JPM", "publishedDate": "2021-03-06 13:22:45", "publisher": "Seeking Alpha", "title": "Week 10 MDA Breakout Stocks - March 2021: Short-Term Picks To Give You An Edge", "image": "https://images.financialmodelingprep.com/news/week-10-mda-breakout-stocks-march-2021-shortterm-picks-20210306.jpg", "site": "seekingalpha.com", "text": "Two new breakout stocks for Week 10 of 2021 with better than 10% short-term upside potential. This past week both LMAT +12.5% and YI +12.2% gained more than 10% while the average return to the close for all four tech/healthcare selections was a loss of -22.9%.", "url": "https://seekingalpha.com/article/4411979-week-10-mda-breakout-stocks-march-2021-short-term-picks-to-give-you-edge", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-06T13:22:45-05:00", "date_et": "2021-03-06"}
{"symbol": "JPM", "publishedDate": "2021-03-07 12:10:49", "publisher": "Seeking Alpha", "title": "Wells Fargo: Not Good Enough", "image": "https://images.financialmodelingprep.com/news/wells-fargo-not-good-enough-20210307.jpg", "site": "seekingalpha.com", "text": "Wells Fargo: Not Good Enough", "url": "https://seekingalpha.com/article/4412062-wells-fargo-not-good-enough", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-07T12:10:49-05:00", "date_et": "2021-03-07"}
{"symbol": "JPM", "publishedDate": "2021-03-08 10:23:43", "publisher": "ETF Trends", "title": "Big Banks Are Back: ‘KBWB' and the Banking Sector Rally", "image": "https://images.financialmodelingprep.com/news/big-banks-are-back-kbwb-and-the-banking-sector-20210308.jpg", "site": "etftrends.com", "text": "It feels like rising Treasury yields are taking a bite out of plenty of sectors. Bank stock ETFs aren't one of them, indicating investors may want to consider exchange traded funds like the Invesco KBW Bank ETF (NASDAQ: KBWB).", "url": "https://www.etftrends.com/etf-education-channel/banks-back-kbwb-banking-sector-rally/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-08T10:23:43-05:00", "date_et": "2021-03-08"}
{"symbol": "JPM", "publishedDate": "2021-03-08 14:53:44", "publisher": "InvestorPlace", "title": "7 DeFi Stocks and Investments to Watch for the Blockchain Revolution", "image": "https://images.financialmodelingprep.com/news/7-defi-stocks-and-investments-to-watch-for-the-20210308.jpg", "site": "investorplace.com", "text": "The DeFi revolution is underway. Here's a look at seven different markers that crypto traders should keep their eyes on.", "url": "https://investorplace.com/2021/03/7-defi-stocks-and-investments-to-watch-for-the-blockchain-revolution/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-08T14:53:44-05:00", "date_et": "2021-03-08"}
{"symbol": "JPM", "publishedDate": "2021-03-08 17:35:27", "publisher": "Benzinga", "title": "JPMorgan Adds 56 Blockchain-Related Jobs With Renewed Focus On JPM Coin", "image": "https://images.financialmodelingprep.com/news/jpmorgan-adds-56-blockchainrelated-jobs-with-renewed-focus-on-20210308.jpg", "site": "benzinga.com", "text": "What Happened: Wall Street giant JPMorgan Chase & Co. (NYSE:JPM) has amped up its recruitment for blockchain-related jobs amidst the ongoing crypto boom. According to the company's website, JPMorgan has 56 open blockchain-related positions – a number that exceeds most firms in the space.", "url": "https://www.benzinga.com/markets/cryptocurrency/21/03/20067251/jpmorgan-adds-56-blockchain-related-jobs-with-renewed-focus-on-jpm-coin", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-08T17:35:27-05:00", "date_et": "2021-03-08"}
{"symbol": "JPM", "publishedDate": "2021-03-08 18:27:09", "publisher": "Zacks Investment Research", "title": "JPMorgan Chase & Co. (JPM) Gains As Market Dips: What You Should Know", "image": "https://images.financialmodelingprep.com/news/jpmorgan-chase-co-jpm-gains-as-market-dips-what-20210308.jpg", "site": "zacks.com", "text": "JPMorgan Chase & Co. (JPM) closed the most recent trading day at $152.91, moving +1.33% from the previous trading session.", "url": "https://www.zacks.com/stock/news/1275563/jpmorgan-chase-co-jpm-gains-as-market-dips-what-you-should-know", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-08T18:27:09-05:00", "date_et": "2021-03-08"}
{"symbol": "JPM", "publishedDate": "2021-03-09 15:09:11", "publisher": "InvestorPlace", "title": "3 Financial Stocks Benefiting From Higher Rates", "image": "https://images.financialmodelingprep.com/news/3-financial-stocks-benefiting-from-higher-rates-20210309.jpg", "site": "investorplace.com", "text": "An end to the low-rate environment should be a boost for these three big banks. So, here's what you need to know about these financial stocks.", "url": "https://investorplace.com/2021/03/3-financial-stocks-benefiting-from-higher-rates/", "ticker": "JPM", "event_date": "2021-02-23", "window_start": "2021-02-16", "window_end": "2021-03-09", "publishedDateET": "2021-03-09T15:09:11-05:00", "date_et": "2021-03-09"}
