{"symbol": "META", "publishedDate": "2025-07-30 03:06:00", "publisher": "The Motley Fool", "title": "The Most Anticipated Stock Split of 2025 May Be Announced Later Today", "image": "https://images.financialmodelingprep.com/news/the-most-anticipated-stock-split-of-2025-may-be-20250730.jpg", "site": "fool.com", "text": "For much of the past three years, artificial intelligence (AI) has been the hottest thing since sliced bread on Wall Street. But it's not the only trend investors have gravitated to.", "url": "https://www.fool.com/investing/2025/07/30/most-anticipated-stock-split-of-2025-announced/", "publishedDateET": "2025-07-29T23:06:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-30 02:26:53", "publisher": "Reuters", "title": "Meta faces Italian probe over AI tool on WhatsApp", "image": "https://images.financialmodelingprep.com/news/meta-faces-italian-probe-over-ai-tool-on-whatsapp-20250730.jpg", "site": "reuters.com", "text": "Italy's antitrust authority said on Wednesday it had opened a probe into Meta for allegedly abusing its dominant position when installing its AI tool on Whatsapp messaging app.", "url": "https://www.reuters.com/business/meta-faces-italian-probe-over-ai-tool-whatsapp-2025-07-30/", "publishedDateET": "2025-07-29T22:26:53-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 20:00:00", "publisher": "The Motley Fool", "title": "After a 700% Rally Over the Last 3 Years, This Magnificent Artificial Intelligence (AI) Stock Looks Poised For Even More Monster Gains", "image": "https://images.financialmodelingprep.com/news/after-a-700-rally-over-the-last-3-years-20250729.jpg", "site": "fool.com", "text": "Three years ago, shares of Meta Platforms (META -2.29%) hit a low around $89 as the company's ambitious plans to conquer the metaverse appeared to be rooted more in fantasy than reality. To add some perspective, Meta stock had not traded anywhere near those levels for almost a decade.", "url": "https://www.fool.com/investing/2025/07/29/after-a-700-rally-over-the-last-3-years-this-magni/", "publishedDateET": "2025-07-29T16:00:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 19:46:05", "publisher": "Zacks Investment Research", "title": "Earnings Outlook Steadily Improves: Mag 7 Earnings Loom", "image": "https://images.financialmodelingprep.com/news/earnings-outlook-steadily-improves-mag-7-earnings-loom-20250729.jpg", "site": "zacks.com", "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>", "url": "https://www.zacks.com/commentary/2635774/earnings-outlook-steadily-improves-mag-7-earnings-loom?cid=CS-STOCKNEWSAPI-FT-earnings_trends-2635774", "publishedDateET": "2025-07-29T15:46:05-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 19:41:06", "publisher": "Zacks Investment Research", "title": "Earnings Outlook Steadily Improves: Mag 7 Earnings Loom", "image": "https://images.financialmodelingprep.com/news/earnings-outlook-steadily-improves-mag-7-earnings-loom-20250729.jpg", "site": "zacks.com", "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>", "url": "https://www.zacks.com/commentary/2635801/earnings-outlook-steadily-improves-mag-7-earnings-loom?cid=CS-STOCKNEWSAPI-FT-earnings_outlook-2635801", "publishedDateET": "2025-07-29T15:41:06-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 16:53:00", "publisher": "The Motley Fool", "title": "4 Artificial Intelligence Stocks (That Aren't Nvidia) You Can Buy and Hold for the Next Decade", "image": "https://images.financialmodelingprep.com/news/4-artificial-intelligence-stocks-that-arent-nvidia-you-can-20250729.jpg", "site": "fool.com", "text": "While Nvidia is undoubtedly the dominant player in artificial intelligence (AI) and a smart investment, let's consider a few other companies that stand to gain enormously from the advent of AI. While these companies occupy different places in the AI ecosystem, they are all incredible businesses that are investments that will pay off over the long term.", "url": "https://www.fool.com/investing/2025/07/29/4-artificial-intelligence-stocks-that-arent-nvidia/", "publishedDateET": "2025-07-29T12:53:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 15:35:09", "publisher": "Benzinga", "title": "Meta Q2 Preview: 11 Straight Revenue Beats On Line With Stock Near All-Time Highs", "image": "https://images.financialmodelingprep.com/news/meta-q2-preview-11-straight-revenue-beats-on-line-20250729.jpg", "site": "benzinga.com", "text": "Meta Platforms META is one of the top-performing Magnificent 7 stocks in 2025 and could highlight its AI investments when the company reports second-quarter financial results after market close Wednesday.", "url": "https://www.benzinga.com/trading-ideas/previews/25/07/46703548/meta-q2-preview-11-straight-revenue-beats-on-line-with-stock-near-all-time-highs", "publishedDateET": "2025-07-29T11:35:09-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 11:39:24", "publisher": "247 Wallst", "title": "Nasdaq Composite Live: Market Gains Momentum on US-EU Trade Deal", "image": "https://images.financialmodelingprep.com/news/nasdaq-composite-live-market-gains-momentum-on-useu-trade-deal-20250729.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Has Ended Shares of AMD are Exploding Higher 10:21 am Ahead of earnings, AMD is rocketing higher thanks to reports of a price increase for its Instinct MI350 AI chips. Reports claim AMD will raise the price of these GPUs to $25,000 per unit, according to TipRanks.com. Nasdaq Heading to Higher Highs 9:54 am The Nasdaq is up about 70 points at the open, last trading at 21,177.76. Adding to the upside, AMZN is up about $1.43 a share ahead of earnings. NVDA is gaining momentum, up about $1.45. AMD is also up big, gaining about $7.20, last trading at $173.63. Stock futures are mixed, but the Nasdaq is expected to open higher. Fueling upside, President Trump announced that the U.S. reached an agreement with the European Union to lower tariffs to 15%. Magnificent 7 stocks, including Meta Platforms, Microsoft, Amazon, and Apple, are all set to post earnings this week. Investors will be listening for comments on strengthening artificial intelligence spending to gauge the justifiability of tech stock valuations. Helping, “While expectations were low coming into this season, results so far show corporate America is faring better than expected. Of the more than 30% of the S&amp;P 500 done reporting, more than 82% beat Wall Street’s forecasts,” added CNBC. Later this week, the Federal Reserve will hold its two-day meeting. The central bank is widely expected to leave interest rates as is. However, investors will be looking for an indication of a potential rate cut by September. Defense Stocks are Rallying on the US-EU Trade Deal Defense stocks are also gaining momentum after the US-EU trade deal. As part of that deal, President Trump said the EU would be “purchasing hundreds of billions of dollars’ worth of military equipment,” as quoted by CNBC. In addition, as announced shortly after the agreement, Europe will also purchase about $750 billion worth of energy. &#8220;They are going to agree to invest into the United States $600 billion more than they&#8217;re investing already. So, they&#8217;re investing a large amount of money,” added President Trump, as quoted by The Mirror. Analysts Just Reiterated an Overweight Rating on Amazon Morgan Stanley just reiterated its overweight rating on Amazon.com, noting that it’s a beneficiary of the Big Beautiful bill passed by Congress. The firm believes AMZN could capture at least $15 billion a year in tax benefits. Wells Fargo just initiated an overweight rating on Take Two Interactive (TTWO), noting that it’s bullish on the 2026 release of its latest Grand Theft Auto game. The firm anticipates that GTA 6 will sell 50 million units in fiscal year 2027. Bank of America analysts just reiterated a buy rating on Apple ahead of its earnings this week. Deutsche Bank also reiterated a buy rating on Tesla, noting that “patience” is needed with Tesla’s robotaxi, but it’s sticking with the stock. And analysts at Stifel just reiterated a buy rating on Microsoft, and raised its price target on the tech giant to $550 from $500 ahead of earnings. Analysts at Evercore ISI downgraded Cisco mainly on valuation concerns to an in-line rating. “We are downgrading Cisco to In Line as the stock is within 6% of our price target of $72. The stock has performed well recently with a +46% move over the last twelve months vs. +17% for the S&amp;P,” as quoted by CNBC. The post Nasdaq Composite Live: Market Gains Momentum on US-EU Trade Deal appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/28/nasdaq-composite-live-market-gains-momentum-on-us-eu-trade-deal/", "publishedDateET": "2025-07-29T07:39:24-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 11:39:24", "publisher": "247 Wallst", "title": "Nasdaq Composite Live: Index to Hit New Highs Today", "image": "https://images.financialmodelingprep.com/news/nasdaq-composite-live-index-to-hit-new-highs-today-20250729.jpg", "site": "https://247wallst.com", "text": "Live Updates Live Coverage Updates appear automatically as they are published. Markets Will Continue to Rally Until Nvidia Earnings 9:39 am The Nasdaq just opened 106 points higher at 21,285.34. From here, depending on the strength of Magnificent 7 stock earnings, trade deals, and the Federal Reserve, we could see the index closer to 22,000 later this week. Helping, JPMorgan says the market will continue to run until Nvidia reports earnings in late August. “We continue to find evidence for our bullish hypothesis: (i) resilient macro data; (ii) positive earnings growth; (iii) thawing trade war rhetoric,” JPMorgan said, as quoted by CNBC. “This week we are focused on [July nonfarm payrolls] and MegaCap Tech earnings.” We’re also waiting on earnings from Meta, Microsoft, Amazon, and Apple this week. Nasdaq could easily see higher highs 9:13 am With excitement over a trade deal with the US-EU, and hopefully with China, the Nasdaq could see higher highs. Helping, we&#8217;ll soon see major earnings from some of the top Magnificent 7 stocks, and hopeful hints of a potential interest rate cut by September&#8217;s Fed meeting. Stay tuned for more. Nasdaq futures are up about 108 points to 23,599 at the moment. If it can open at that level, that’ll put the tech-heavy index at new all-time highs. According to CNBC, “The moves come after the broad market index and the Nasdaq hit new all-time and closing highs during Monday’s trading session, just barely seeing gains. It was the 15th record close for the broad market index in 2025.” Fueling momentum, tech giants like Advanced Micro Devices (AMD) soared by about $7.19 a share yesterday. Shares are up another $2.80 in premarket trading today. Helping, analysts at Bank of America just raised their price target on AMD to $200. The stock is also rising on news of a price increase for its Instinct MI350 chips. In addition, there’s been excitement over the recent US-EU trade deal. Now, markets are waiting to see if a deal can be made with China. That&#8217;s ahead of President Trump’s August 1 deadline. Plus, all eyes will be on the Federal Reserve, which is expected to leave interest rates as is. However, they’ll be listening to hints about a potential rate cut by September’s meeting. Friday will also be an important day, with the release of non-farm payroll numbers. Goldman Sachs Reiterated a Buy Rating on Microsoft Goldman Sachs says it’s bullish on Microsoft heading into earnings. “Microsoft is well-positioned to capitalize on this shift with a more capital-efficient and higher-margin recurring revenue model, just as it did during the on-prem to cloud transition,” as noted by CNBC. Analysts at Oppenheimer just reiterated a Perform rating on Apple ahead of earnings, noting, “We take a neutral view into AAPL’s F3Q25 earnings. We expect investors to focus on the revenue outlook for F4Q25 after normalizing the potential FX tailwind, Services revenue growth, and the sales trend in Greater China.” Citi analysts reiterated a buy rating on Coinbase, with a price target of $505 from $270. The firm noted the company has seen several catalysts recently. That includes the GENIUS Act, the House passage of the CLARITY Act, and its addition to the S&amp;P 500 index. Bank of America also reiterated a buy rating on Roblox, with a price target of $133. The firm sees an “extended runway for mid-20% growth as users worldwide adopt Roblox’s Metaverse, in a virtuous cycle that will draw developers, brands, and merchants to the platform,” as also quoted by CNBC. The post Nasdaq Composite Live: Index to Hit New Highs Today appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/29/nasdaq-composite-live-index-to-hit-new-highs-today/", "publishedDateET": "2025-07-29T07:39:24-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 11:39:24", "publisher": "247 Wallst", "title": "Trump’s Big, Beautiful Bill Hands AI Stocks Like NVIDIA & Meta Platforms a Powerful Catalyst", "image": "https://images.financialmodelingprep.com/news/trumps-big-beautiful-bill-hands-ai-stocks-like-nvidia-20250729.jpg", "site": "https://247wallst.com", "text": "Key Points Tax Code Changes: The Big Beautiful Bill allows companies to expense R&amp;D costs within the year instead of over five years, providing significant tax advantages for tech firms. Domestic Manufacturing Incentives: The bill extends domestic credits for building fabrication facilities in the U.S., encouraging companies like Taiwan Semiconductor and NVIDIA to invest in local supply chains. Investment Opportunities: Companies specializing in high-tech build-outs and reshoring U.S. manufacturing are seeing substantial stock price increases, indicating a dynamic investment landscape in the tech sector. If you’re looking for stock ideas, check out stocks like Emcor that could benefit. Get More AI Stock Ideas Now: Nvidia made early investors rich, but there is a new class of ‘Next Nvidia Stocks’ that could be even better. Click here to learn more. In a recent episode of the AI Investor Podcast (embedded above), host Austin Smith and technology analyst Eric Bleeker discussed the implications of the Big Beautiful Bill on the tech industry, particularly regarding artificial intelligence and domestic manufacturing. The conversation highlighted a significant change in the tax code that allows companies to fully expense their research and development costs within a single year, rather than amortizing them over five years. This shift is expected to provide a substantial financial boost to major tech companies, potentially influencing their hiring and investment strategies. Bleeker elaborated on how this new tax structure could serve as a powerful incentive for companies to relocate their operations back to the United States. He pointed to the aggressive expansion plans of Taiwan Semiconductor (NYSE: TSM) in Arizona and NVIDIA&#8216;s (Nasdaq: NVDA) strategic moves to enhance its supercomputer supply chain domestically. In addition, companies like Meta Platforms (Nasdaq: META) that are hiring aggressively for AI research are now incentivized to move that research back to the United States, as they can use research amortization to significantly reduce their tax bill. The discussion also touched on investment opportunities in companies that are poised to benefit from these changes, with some stocks already experiencing significant gains. One stock that Bleeker thinks has a lot to gain is Emcor Group (NYSE: EME), which benefits from domestic advanced manufacturing and the growth of new energy to power AI data centers. Bleeker emphasized that the evolving landscape of U.S. high-tech manufacturing presents dynamic investment prospects that could unfold over the next few years. Discover a New One-Stop Shop for AI Stock Ideas The discussion above is from 24/7 Wall St.&#8217;s AI Investor Podcast. In each episode, we break down the biggest news in the technology space and invest $500,000 of Eric Bleeker&#8217;s own money into a portfolio of his favorite AI stock ideas. You can listen to the latest episode on either Spotify or Apple Podcasts below. The post Trump’s Big, Beautiful Bill Hands AI Stocks Like NVIDIA &#038; Meta Platforms a Powerful Catalyst appeared first on 24/7 Wall St..", "url": "https://247wallst.com/investing/2025/07/29/trumps-big-beautiful-bill-hands-ai-stocks-like-nvidia-meta-platforms-a-powerful-catalyst/", "publishedDateET": "2025-07-29T07:39:24-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 09:00:00", "publisher": "Business Wire", "title": "Bonterra DonorDrive and Meta Launch New Integration to Boost Nonprofit Fundraising on Instagram and Facebook", "image": "https://images.financialmodelingprep.com/news/bonterra-donordrive-and-meta-launch-new-integration-to-boost-20250729.jpg", "site": "businesswire.com", "text": "AUSTIN, Texas--(BUSINESS WIRE)--Bonterra, a leader in social impact technology, today announced a powerful new native integration between its peer-to-peer fundraising platform, DonorDrive, and Meta's Instagram and Facebook platforms. The new feature makes it dramatically easier for nonprofits to raise more money, expand reach, and save time by sharing fundraising campaigns directly into social feeds, all with built-in donate buttons and real-time tracking. With Bonterra DonorDrive, nonprofits a.", "url": "https://www.businesswire.com/news/home/20250729584674/en/Bonterra-DonorDrive-and-Meta-Launch-New-Integration-to-Boost-Nonprofit-Fundraising-on-Instagram-and-Facebook/", "publishedDateET": "2025-07-29T05:00:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 08:00:01", "publisher": "CNBC", "title": "Meta's AI spending spree is Wall Street's focus in second-quarter earnings", "image": "https://images.financialmodelingprep.com/news/metas-ai-spending-spree-is-wall-streets-focus-in-20250729.jpg", "site": "cnbc.com", "text": "On Meta's upcoming earnings call, investors will be listening to what CEO Mark Zuckerberg has to say about his company's recent AI hiring blitz and strategy shift. A decision by Meta to copy a technique by Chinese AI lap DeepSeek backfired, resulting in the company's decision to launch a new AI unit and bring in a team of high-profile AI researchers.", "url": "https://www.cnbc.com/2025/07/29/meta-ai-q2-earnings.html", "publishedDateET": "2025-07-29T04:00:01-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 07:55:00", "publisher": "Market Watch", "title": "Meta is spending ever more on AI. Earnings will show if that's paying off.", "image": "https://images.financialmodelingprep.com/news/meta-is-spending-ever-more-on-ai-earnings-will-20250729.jpg", "site": "marketwatch.com", "text": "Meta reports second-quarter earnings after Wednesday's closing bell, with investors focused on the Facebook parent's ability to monetize AI through advertising and beyond.", "url": "https://www.marketwatch.com/story/meta-is-spending-ever-more-on-ai-earnings-will-show-if-thats-paying-off-e8b8faad", "publishedDateET": "2025-07-29T03:55:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 07:49:00", "publisher": "Market Watch", "title": "EssilorLuxottica earnings boost illustrates growth potential for Meta's smartglasses", "image": "https://images.financialmodelingprep.com/news/essilorluxottica-earnings-boost-illustrates-growth-potential-for-metas-smartglasses-20250729.jpg", "site": "marketwatch.com", "text": "Sales of EssilorLuxottica's Ray-Ban Meta smartglasses tripled in the first half of 2025", "url": "https://www.marketwatch.com/story/essilor-luxottica-earnings-boost-illustrates-growth-potential-for-metas-smartglasses-ad86b15b", "publishedDateET": "2025-07-29T03:49:00-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 06:14:19", "publisher": "Seeking Alpha", "title": "METW: Harvesting Meta's Mag 7 Momo On A Weekly Basis", "image": "https://images.financialmodelingprep.com/news/metw-harvesting-metas-mag-7-momo-on-a-weekly-basis-20250729.jpg", "site": "seekingalpha.com", "text": "METW offers a unique weekly income stream by leveraging Meta Platforms' returns, targeting 120% of META's weekly performance via derivatives. The ETF is innovative but carries outsized risks: single-stock concentration, leverage, and counterparty risk, with no guarantee of achieving its weekly objective. With a high 0.99% expense ratio and no long-term track record, METW's appeal lies in its potential for enhanced income.", "url": "https://seekingalpha.com/article/4805366-metw-etf-harvesting-meta-mag-7-momo-weekly", "publishedDateET": "2025-07-29T02:14:19-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 06:02:55", "publisher": "Reuters", "title": "Meta's year of bold 'superintelligence' bets unlikely to pump profits", "image": "https://images.financialmodelingprep.com/news/metas-year-of-bold-superintelligence-bets-unlikely-to-pump-profits-20250729.jpeg", "site": "reuters.com", "text": "It's crunch time for Mark Zuckerberg as he pulls out all the stops to stay relevant in Silicon Valley's intensifying advanced artificial intelligence race.", "url": "https://www.reuters.com/business/metas-year-bold-superintelligence-bets-unlikely-pump-profits-2025-07-29/", "publishedDateET": "2025-07-29T02:02:55-04:00"}
{"symbol": "META", "publishedDate": "2025-07-29 04:42:09", "publisher": "Forbes", "title": "Buy or Sell META Stock Ahead of Its Upcoming Earnings?", "image": "https://images.financialmodelingprep.com/news/buy-or-sell-meta-stock-ahead-of-its-upcoming-20250729.jpg", "site": "forbes.com", "text": "Meta Platforms (NASDAQ:META) is set to publish its earnings report on Wednesday, July 30, 2025. For those trading based on events, analyzing Meta's historical stock behavior surrounding earnings can be vital, although the actual outcomes compared to expectations will predominantly influence the market.", "url": "https://www.forbes.com/sites/greatspeculations/2025/07/29/buy-or-sell-meta-stock-ahead-of-its-upcoming-earnings/", "publishedDateET": "2025-07-29T00:42:09-04:00"}
