[
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 04:00:05",
    "publisher": "PYMNTS",
    "title": "Amazon and Walmart Hit the Wall as Shoppers Shift Spending",
    "image": "https://images.financialmodelingprep.com/news/amazon-and-walmart-hit-the-wall-as-shoppers-shift-20250529.jpg",
    "site": "pymnts.com",
    "text": "The intense rivalry between eCommerce titan Amazon and brick-and-mortar giant Walmart has long pitted the two companies against each other. Now, both retailers have a new challenge: Shoppers themselves.",
    "url": "https://www.pymnts.com/news/retail/2025/amazon-and-walmart-hit-the-wall-as-shoppers-shift-spending/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-29T04:00:05-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 06:09:00",
    "publisher": "The Motley Fool",
    "title": "How Walmart Stock Investors Are Impacted by President Donald Trump's Tariff Policy",
    "image": "https://images.financialmodelingprep.com/news/how-walmart-stock-investors-are-impacted-by-president-donald-20250529.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.40%) imports a large percentage of its products, which makes it vulnerable to a higher tariff policy.",
    "url": "https://www.fool.com/investing/2025/05/29/how-walmart-stock-investors-are-impacted-by-presid/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-29T06:09:00-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 07:00:00",
    "publisher": "Business Wire",
    "title": "NationsBenefits® and Walmart are Revolutionizing Health Plan Member Engagement with Technology, Retail and Nutrition Integrations",
    "image": "https://images.financialmodelingprep.com/news/nationsbenefits-and-walmart-are-revolutionizing-health-plan-member-engagement-20250529.jpg",
    "site": "businesswire.com",
    "text": "PLANTATION, Fla. & BENTONVILLE, Ark.--(BUSINESS WIRE)-- #NationsBenefits--NationsBenefits®, the leading healthcare fintech, supplemental benefits, and outcomes platform, and Walmart, the world's largest retailer, today announced they are continuing to work together to transform how health plan members access essential benefits through tech-powered tools. This collaboration includes NationsBenefits' proprietary Basket Analyzer Service (BAS) as well as the Walmart Everyday Health Signals™ program, which leverages o.",
    "url": "https://www.businesswire.com/news/home/20250529492434/en/NationsBenefits%C2%AE-and-Walmart-are-Revolutionizing-Health-Plan-Member-Engagement-with-Technology-Retail-and-Nutrition-Integrations/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-29T07:00:00-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 08:52:18",
    "publisher": "24/7 Wall Street",
    "title": "Prediction: Walmart (WMT) Will be the Next $1 Trillion Stock",
    "image": "https://images.financialmodelingprep.com/news/prediction-walmart-wmt-will-be-the-next-1-trillion-20250529.jpg",
    "site": "247wallst.com",
    "text": "Walmart's (WMT) dominance in retail, spanning physical stores, e-commerce, and high-margin advertising, positions it for significant growth in a cost-conscious market.",
    "url": "https://247wallst.com/investing/2025/05/29/prediction-walmart-wmt-will-be-the-next-1-trillion-stock/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-29T08:52:18-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-29 09:05:00",
    "publisher": "Business Wire",
    "title": "Walmart Family Mobile Introduces Most Affordable Plans Yet with New Features to Support Families During Economic Challenges",
    "image": "https://images.financialmodelingprep.com/news/walmart-family-mobile-introduces-most-affordable-plans-yet-with-20250529.jpg",
    "site": "businesswire.com",
    "text": "NEW YORK--(BUSINESS WIRE)--Walmart Family Mobile, a leading prepaid brand powered by Verizon's award-winning network and available exclusively at Walmart, is proud to introduce its most affordable plans yet, designed to help families stay connected without compromising their budget. With inflation continuing to impact household finances across the country, Walmart Family Mobile helps families save money during times of financial uncertainty. New Plans and Features: New $19.88 Plan: Introducing.",
    "url": "https://www.businesswire.com/news/home/20250529714684/en/Walmart-Family-Mobile-Introduces-Most-Affordable-Plans-Yet-with-New-Features-to-Support-Families-During-Economic-Challenges/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-29T09:05:00-04:00",
    "date_et": "2025-05-29"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-30 06:03:00",
    "publisher": "The Motley Fool",
    "title": "Here's What You Need to Know About Before You Buy or Sell Walmart Stock",
    "image": "https://images.financialmodelingprep.com/news/heres-what-you-need-to-know-about-before-you-20250530.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.18%) is attracting investors because of its excellent performance.",
    "url": "https://www.fool.com/investing/2025/05/30/heres-what-you-need-to-know-about-before-you-buy-o/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-30T06:03:00-04:00",
    "date_et": "2025-05-30"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-30 06:05:00",
    "publisher": "The Motley Fool",
    "title": "3 USA-Based Stocks That Can Be Great Buys Amid Tariff Risks",
    "image": "https://images.financialmodelingprep.com/news/3-usabased-stocks-that-can-be-great-buys-amid-20250530.jpg",
    "site": "fool.com",
    "text": "Tariffs pose a big uncertainty for many businesses and investors for the foreseeable future. How big they will be and how long they will be imposed are two of the biggest unknowns, and that can make it difficult to predict how the stock market will perform.",
    "url": "https://www.fool.com/investing/2025/05/30/3-usa-based-stocks-that-can-be-great-buys-amid-tar/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-30T06:05:00-04:00",
    "date_et": "2025-05-30"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-30 08:15:00",
    "publisher": "The Motley Fool",
    "title": "This Absurdly Cheap Retail Stock Has Shrunk to Just 5% of Walmart's Value",
    "image": "https://images.financialmodelingprep.com/news/this-absurdly-cheap-retail-stock-has-shrunk-to-just-20250530.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.18%) is one of the most valuable companies in the world, approaching $800 billion in market value. It looks on track to become the first retailer to hit the $1 trillion mark.",
    "url": "https://www.fool.com/investing/2025/05/30/this-absurdly-cheap-retail-stock-has-shrunk-to/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-30T08:15:00-04:00",
    "date_et": "2025-05-30"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-30 09:30:00",
    "publisher": "The Motley Fool",
    "title": "3 Reasons to Buy Walmart Stock Like There's No Tomorrow",
    "image": "https://images.financialmodelingprep.com/news/3-reasons-to-buy-walmart-stock-like-theres-no-tomorrow-20250530.jpg",
    "site": "fool.com",
    "text": "Shares of Walmart (WMT 1.01%) have been on a roll since 2024's stock split, which was its first in over two decades. The stock zoomed up from a 52-week low of $64.16 in May of last year to a high of $105.30 this February.",
    "url": "https://www.fool.com/investing/2025/05/30/3-reasons-to-buy-walmart-like-theres-no-tomorrow/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-30T09:30:00-04:00",
    "date_et": "2025-05-30"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-05-30 10:06:07",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Inc. (WMT) is Attracting Investor Attention: Here is What You Should Know",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-is-attracting-investor-attention-here-is-20250530.jpg",
    "site": "zacks.com",
    "text": "Walmart (WMT) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
    "url": "https://www.zacks.com/stock/news/2479375/walmart-inc-wmt-is-attracting-investor-attention-here-is-what-you-should-know?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|most_searched_stocks-2479375",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-05-30T10:06:07-04:00",
    "date_et": "2025-05-30"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-01 04:40:00",
    "publisher": "The Motley Fool",
    "title": "These 3 Dow Stocks Are Set to Soar in 2025 and Beyond",
    "image": "https://images.financialmodelingprep.com/news/these-3-dow-stocks-are-set-to-soar-in-20250601.jpg",
    "site": "fool.com",
    "text": "These are tricky times for investors. Oh, the market's never exactly easy to navigate.",
    "url": "https://www.fool.com/investing/2025/06/01/these-3-dow-stocks-are-set-to-soar-in-2025-and-bey/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-01T04:40:00-04:00",
    "date_et": "2025-06-01"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-02 10:12:46",
    "publisher": "Patch",
    "title": "Beloved Hot Dog Chain To Open New Restaurants Inside Retail Giant",
    "image": "https://images.financialmodelingprep.com/news/beloved-hot-dog-chain-to-open-new-restaurants-inside-20250602.jpg",
    "site": "https://www.patch.com",
    "text": "IRVINE, CA — Fans of Wienerschnitzel's famous hot dogs will soon be able to satisfy their craving while shopping at Walmart. The popular hot dog brand confirmed Friday plans to add restaurants to multiple Walmart stores, starting with six owned and operated by local high-caliber franchisees. According to Wienerschnitzel, the Walmart restaurants will enable the company to \"[expand] into target markets through non-traditional avenues.\" Where Will They Be Located? The six restaurants are set to open by this fall in Walmart stores in the following communities: The Walmart locations will all feature the chain's full menu, including iconic items like the chili cheese dog, junkyard dog, chili cheese fries, jalapeño poppers and \"tastee freez\" soft serve desserts. As the brand looks to scale its presence, these partnerships provide a blueprint for future growth while maintaining its iconic brand appeal, according to Wienerschnitzel. A Walmart spokesperson noted the store chain is \"always looking for prospective tenants, excited to possibly bring their business to our stores.\" Growing Brands According to Wienerschnitzel, the move into Walmart stores sparks a new focus on non-traditional growth for the company. Supporting this expansion and fueling the brand's momentum are strategic new hires like Shak Turner, the brand's newest director of franchise expansion. Turner, who joined the company in March, will mainly focus on driving growth across non-traditional formats and attracting high-ranking multi-unit franchise candidates, according to Wienerschnitzel. \"Wienerschnitzel has spent decades building a strong reputation, especially on the West Coast, and this expansion into Walmart stores signifies a new era of growth for the brand,\" Turner said in a news release. \"It's clear Wienerschnitzel's unique concept fills a specific void for multi-brand franchisees looking to grow their portfolios, which is one of the elements that attracted me to the brand initially. I'm thrilled to join this amazing team and play a part in spearheading initiatives and new partnerships, which will no doubt catapult the brand to new markets.\" There are currently 340 franchised Wienerschnitzel locations in operation throughout 13 states, and more than 50 units in various stages of development across the U.S., according to the company. Founded by John Galardi in 1961 with a single hot dog stand in Wilmington, Calif., the company now bills itself as \"the world's largest hot dog chain.\" Based in Tustin, Calif., Galardi Group Inc. franchises 340 Wienerschnitzel restaurants in 13 states. The group is also the parent company and franchisor of Hamburger Stand and Tastee Freez, LLC. This week, Walmart confirmed plans to open five new stores and a new Sam's Club location by the end of September, with a total of 10 new stores planned to be open by the end of 2025. More Walmart Stories Trending on Patch:  According to a spokesperson, the five new Walmart stores planned to open by September include two in Florida and one in Alabama, California and Utah.",
    "url": "https://www.patch.com/us/across-america/beloved-hot-dog-chain-open-new-restaurants-inside-popular-store",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-02T10:12:46-04:00",
    "date_et": "2025-06-02"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-02 12:46:24",
    "publisher": "Zacks Investment Research",
    "title": "CRRFY vs. WMT: Which Stock Is the Better Value Option?",
    "image": "https://images.financialmodelingprep.com/news/crrfy-vs-wmt-which-stock-is-the-better-value-20250602.jpg",
    "site": "zacks.com",
    "text": "Investors interested in stocks from the Retail - Supermarkets sector have probably already heard of Carrefour SA (CRRFY) and Walmart (WMT). But which of these two stocks is more attractive to value investors?",
    "url": "https://www.zacks.com/stock/news/2480440/crrfy-vs-wmt-which-stock-is-the-better-value-option?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_3-2480440",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-02T12:46:24-04:00",
    "date_et": "2025-06-02"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-03 10:04:43",
    "publisher": "247 Wallst",
    "title": "My Family’s $1,400 Monthly Grocery Budget Seems Way Too High",
    "image": "https://images.financialmodelingprep.com/news/my-familys-1400-monthly-grocery-budget-seems-way-too-20250603.jpg",
    "site": "https://247wallst.com",
    "text": "Let&#8217;s assume, for a moment, that you are the person responsible for budgeting in your household. You likely have a pretty good idea of how much the family spends on food monthly. If you told your family members exactly what this number is, they&#8217;d likely be shocked. Key Points The cost of groceries is only going up, but it shouldn’t be a family’s biggest expense. In the case of this Redditor, the family is spending a good portion of their monthly income on food and dining out. There are several ways to reduce the cost of groceries, such as meal prepping each week. Are you spending too much money on groceries? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) How much a family spends on groceries is exactly what one Redditor posting in r/MiddleClassFinance is worried about. In this family&#8217;s case, it&#8217;s far too easy to get carried away with overspending each month, especially when it comes to dining out. Large Grocery Bill What&#8217;s surprising is that this Redditor outright admits the family spends around $1,400 per month on groceries. For a family of three, including a two-year-old, this is entirely too much money. Having tracked their spending since June 2024, there is a real-world concern. When the Redditor breaks down this total number, we learn that the family’s average monthly grocery bill is $692. Additionally, they are spending $405 on fast food and takeout, as well as $289 on dining out. For a family earning around $9,000 per month, this number should be alarming. In fact, the grocery budget is likely their second biggest expense, after a mortgage, which is a reasonable concern. If the question is whether or not they are spending too much, the answer is a resounding yes. Average Monthly Spend According to the US Bureau of Labor Statistics, the average monthly cost of groceries is $504 as of late 2024. The total annual cost for families should be approximately $6,043. Compared to other families, this family spends over $16,000 on food and groceries each month, far exceeding the average amount typically spent by families. Another consideration is that the US Department of Agriculture states that, for a family of four, the monthly budget in March 2025 should be $996. Even if you subtract a little for a family of three, their total expense is still well outpacing what the agreed-upon spending should be for a family. How to Spend Smarter First and foremost, this family and Redditor need to set up a detailed monthly budget to look at where they can cut back. Spending half of their grocery bill on food that is made at home is crazy. In other words, eating out and or bringing food in has to stop immediately. Setting a Budget There should be a budget set for how many times a month the family will order in or take out, and that’s all they can do for the whole month. Grocery spending is a necessity, but dining out or ordering fast food is a luxury. As a result, it shouldn’t be too challenging to make this change. Finding Coupons In addition, this family needs to become more savvy about coupons, discount grocery stores, and taking advantage of farmers’ markets, among other strategies. Using websites like iBotta or Coupons.com to save money can be a real advantage. Yes, it takes a little extra time to go through and save digital coupons, but the payoff is quickly evident in the savings. Meal Prepping Another potential option is meal prep for the family, which provides a set menu for the week. Let’s assume the family goes to the grocery shops on the weekend. This allows them to meal prep for the week, including lunches and dinners, which is likely where most of the excess spending goes. House Brands Another consideration is to buy generic brands at the grocery store, such as those from Great Value at Walmart or Favorite Day at Target. The savings here can really add up, and the food rarely tastes any different, so there is plenty of money to be saved. As someone who regularly buys Target’s house brands, I can personally attest to there being very little difference in taste, except that everything costs less. The post My Family&#8217;s $1,400 Monthly Grocery Budget Seems Way Too High appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/personal-finance/2025/06/03/my-familys-1400-monthly-grocery-budget-seems-way-too-high/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-03T10:04:43-04:00",
    "date_et": "2025-06-03"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-04 12:53:24",
    "publisher": "Seeking Alpha",
    "title": "Walmart: Some Ways We Could Profit Between Earnings",
    "image": "https://images.financialmodelingprep.com/news/walmart-some-ways-we-could-profit-between-earnings-20250604.jpg",
    "site": "seekingalpha.com",
    "text": "With its very large size, Walmart has a narrow-to-strong economic moat, based on cost advantages and network effects. Growth prospects are steady, with ~4% revenue growth expected and even more for profitability, but margins are pressured by tariffs this year. Derived from a DCF model and backed by relative valuations, my Fair Value estimate is $68.2, about 31% potential downside from the current price ($99.5).",
    "url": "https://seekingalpha.com/article/4792395-walmart-some-ways-we-could-profit-between-earnings",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-04T12:53:24-04:00",
    "date_et": "2025-06-04"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-04 12:56:04",
    "publisher": "Zacks Investment Research",
    "title": "How Walmart's Physical Stores Are Powering Its Digital Expansion",
    "image": "https://images.financialmodelingprep.com/news/how-walmarts-physical-stores-are-powering-its-digital-expansion-20250604.jpg",
    "site": "zacks.com",
    "text": "WMT's digital momentum grows as its omnichannel strategy and tech investments transform customer experience.",
    "url": "https://www.zacks.com/stock/news/2484679/how-walmart-s-physical-stores-are-powering-its-digital-expansion?cid=CS-STOCKNEWSAPI-FT-analyst_blog|quick_take-2484679",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-04T12:56:04-04:00",
    "date_et": "2025-06-04"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 06:19:38",
    "publisher": "Reuters",
    "title": "Exclusive: Walmart's Flipkart secures approval for direct lending in India, documents show",
    "image": "https://images.financialmodelingprep.com/news/exclusive-walmarts-flipkart-secures-approval-for-direct-lending-in-20250605.jpg",
    "site": "reuters.com",
    "text": "Walmart's Flipkart has secured a lending licence from the Indian central bank and banking regulator, enabling it to offer loans directly to customers and sellers on its platform, according to documents reviewed by Reuters and a source.",
    "url": "https://www.reuters.com/world/india/walmarts-flipkart-secures-approval-direct-lending-india-documents-show-2025-06-05/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T06:19:38-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 07:26:25",
    "publisher": "Reuters",
    "title": "Exclusive: Walmart's Flipkart secures approval for direct lending in India",
    "image": "https://images.financialmodelingprep.com/news/exclusive-walmarts-flipkart-secures-approval-for-direct-lending-in-india-20250605.jpg",
    "site": "reuters.com",
    "text": "Walmart's Flipkart has secured a lending licence from the Indian central bank and banking regulator, enabling it to offer loans directly to customers and sellers on its platform, a spokesperson for the company confirmed after Reuters reported the development citing documents and a source.",
    "url": "https://www.reuters.com/business/finance/walmarts-flipkart-secures-approval-direct-lending-india-2025-06-05/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T07:26:25-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 08:13:50",
    "publisher": "Reuters",
    "title": "Walmart's Sam's Club to remove synthetic dyes from private brand by year end",
    "image": "https://images.financialmodelingprep.com/news/walmarts-sams-club-to-remove-synthetic-dyes-from-private-20250605.jpg",
    "site": "reuters.com",
    "text": "Walmart-owned Sam's Club said on Thursday it would eliminate over 40 ingredients, including artificial colors and aspartame, from private label brand Member's Mark by the end of this year.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/walmarts-sams-club-remove-synthetic-dyes-private-brand-by-year-end-2025-06-05/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T08:13:50-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 14:47:03",
    "publisher": "CNBC",
    "title": "Corporate layoffs have ramped up in recent weeks. Here are the companies making cuts",
    "image": "https://images.financialmodelingprep.com/news/corporate-layoffs-have-ramped-up-in-recent-weeks-here-20250605.jpg",
    "site": "cnbc.com",
    "text": "Companies are under increasing pressure to trim costs against the backdrop of global economic uncertainty brought on by President Donald Trump's trade policies. Many companies lumped layoffs in with larger cost-cutting strategies or growth plans.",
    "url": "https://www.cnbc.com/2025/06/05/corporate-layoffs-companies-making-job-cuts.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T14:47:03-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 16:00:00",
    "publisher": "TechCrunch",
    "title": "Walmart and Wing expand drone delivery to five more U.S. cities",
    "image": "https://images.financialmodelingprep.com/news/walmart-and-wing-expand-drone-delivery-to-five-more-20250605.jpg",
    "site": "techcrunch.com",
    "text": "Wing, the on-demand drone delivery company owned by Alphabet, is spreading its commercial wings with help from Walmart.",
    "url": "https://techcrunch.com/2025/06/05/walmart-and-wing-expand-drone-delivery-to-five-more-u-s-cities/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T16:00:00-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 16:07:00",
    "publisher": "Business Wire",
    "title": "Walmart Announces 2025 Annual Shareholders' Meeting Voting Results",
    "image": "https://images.financialmodelingprep.com/news/walmart-announces-2025-annual-shareholders-meeting-voting-results-20250605.jpg",
    "site": "businesswire.com",
    "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)--Walmart Inc. (NYSE: WMT) announced preliminary voting results from its Annual Shareholders' Meeting held earlier today. Approximately 91.4% of all outstanding shares were represented at the meeting. Doug McMillon, President and CEO, reviewed Walmart's strong results from fiscal year 2025. He emphasized investments in wages, opportunity, innovation, technology, and making communities better, stating the company can continue to “improve our ROI even as we make.",
    "url": "https://www.businesswire.com/news/home/20250605416711/en/Walmart-Announces-2025-Annual-Shareholders%E2%80%99-Meeting-Voting-Results/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T16:07:00-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-05 17:26:25",
    "publisher": "CNBC",
    "title": "Walmart plans to expand drone deliveries to three more states",
    "image": "https://images.financialmodelingprep.com/news/walmart-plans-to-expand-drone-deliveries-to-three-more-20250605.jpg",
    "site": "cnbc.com",
    "text": "Walmart said it will expand drone deliveries to customers from 100 stores in Atlanta, Charlotte, Houston, Orlando and Tampa within the coming year. Customers can already get items by drone delivery in parts of Northwest Arkansas and Dallas-Fort Worth.",
    "url": "https://www.cnbc.com/2025/06/05/walmart-expands-drone-deliveries.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-05T17:26:25-04:00",
    "date_et": "2025-06-05"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 06:56:48",
    "publisher": "CNBC Television",
    "title": "Walmart plans to expand deliveries by drone",
    "image": "https://images.financialmodelingprep.com/news/walmart-plans-to-expand-deliveries-by-drone-20250606.jpg",
    "site": "youtube.com",
    "text": "CNBC's Becky Quick reports on the latest news.",
    "url": "https://www.youtube.com/watch?v=Ird-Q-Ft7-0",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T06:56:48-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 10:41:31",
    "publisher": "Fast Company",
    "title": "Walmart is planning a major expansion of its drone delivery service with Wing. Here's where it will land next",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-planning-a-major-expansion-of-its-drone-20250606.jpg",
    "site": "fastcompany.com",
    "text": "Our sky-mall future is officially here: Walmart and drone company Wing are rolling out drone delivery to a number of additional metro areas in what the companies are calling “the world's largest drone delivery expansion” ever.",
    "url": "https://www.fastcompany.com/91346758/walmart-wing-drone-delivery-service-expands-orlando-fl-tampa-atlanta-nc",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T10:41:31-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 10:43:48",
    "publisher": "247 Wallst",
    "title": "If I Could Go Back, I’d Start Investing in Dividends at 20 – Here’s Why Timing Matters",
    "image": "https://images.financialmodelingprep.com/news/if-i-could-go-back-id-start-investing-in-20250606.jpg",
    "site": "https://247wallst.com",
    "text": "At what age would you buy dividend stocks if you could go back in time? The Dividends subreddit was bustling after one investor asked if people regretted buying dividend stocks too early or too late in their journey. For instance, some people may regret buying dividend stocks in their 20s because they saw growth stocks outperform them for more than a decade. On the other hand, other investors may wish they got into dividend stocks in their 40s instead of waiting for their 60s due to market volatility and steep losses from unprofitable investments. Dividend investors shared their thoughts and some advice for people who are considering dividend stocks. Key Points Should you buy dividend stocks in your 20s? Redditors shared their thoughts. Dividend growth stocks make more sense for younger investors, but high-yield stocks become a priority as people get older and approach retirement. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Buy Stocks For The Long Run One of the top comments came from a Walmart (NYSE:WMT) investor who bought shares at $6 apiece and held on to them. The investor now has 1,110 shares and receives an annual dividend that is close to 16% of the initial investment. That&#8217;s the advantage of buying dividend growth stocks. These corporations pay dividends but still have plenty of growth prospects left. Even at its current level of success, Walmart still has growth opportunities. Online advertising, e-commerce, and retail locations are some of the company&#8217;s growth levers. Buying dividend stocks doesn&#8217;t mean you have to be stuck with mature, high-yield companies. For instance, Broadcom (NASDAQ:AVGO) has a dividend yield above 1% and has crushed the stock market with a 685% gain over the past five years. Why Wait To Invest? Multiple dividend investors asked why people would wait to invest. Some people said they wished they could invest when they were born, while others wished they invested in their early 20s. People weren&#8217;t expressing regret about entering stocks in their 20s and 30s. Waiting to invest doesn&#8217;t make much sense if you want to become wealthy. The longer you let your money sit in the stock market, the more time you have to compound your returns. Waiting to invest causes your money to lose value due to inflation. A high-yield savings account is better than nothing, but it can&#8217;t appreciate like dividend stocks. You only get the cash flow from a bank account, while dividend stocks can double in value over the course of 5-10 years. Transition To High-Yield Dividend Stocks When You Need Steady Income A few dividend investors said that it makes sense to diversify into high-yield stocks when they need additional income. Many investors focused on dividend growth stocks or index funds that tracked major indices like the S&amp;P 500 when they were younger. Then, they gradually sold off some of those holdings and shifted into funds with lower risk and higher yields. Every person has a different financial situation and long-term goals. If you don&#8217;t need to sell your assets within the next decade and don&#8217;t need dividend income, it may make more sense to focus on growth-oriented opportunities. However, your plans may look different if you want to sell your stocks in 1-3 years to buy a house. Then, it may be better to take a cautious approach and focus on funds that have high yields and steady growth instead of riskier funds that aim to produce 10%+ annualized returns. If you&#8217;re just getting started, you can diversify your portfolio with dividend stocks and growth-oriented stocks. Reinvesting dividends ensures that your dividend income grows over time and can eventually cover your living expenses. Monitoring dividend stocks can help you build a robust portfolio that aligns with your risk tolerance. The post If I Could Go Back, I&#8217;d Start Investing in Dividends at 20 &#8211; Here&#8217;s Why Timing Matters appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/personal-finance/2025/06/05/if-i-could-go-back-id-start-investing-in-dividends-at-20-heres-why-timing-matters/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T10:43:48-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 12:01:04",
    "publisher": "Zacks Investment Research",
    "title": "How Walmart's Physical Stores Are Powering Its Digital Expansion (Revised)",
    "image": "https://images.financialmodelingprep.com/news/how-walmarts-physical-stores-are-powering-its-digital-expansion-20250606.jpg",
    "site": "zacks.com",
    "text": "WMT's digital momentum grows as its omnichannel strategy and tech investments transform customer experience.",
    "url": "https://www.zacks.com/stock/news/2487567/how-walmart-s-physical-stores-are-powering-its-digital-expansion-revised?cid=CS-STOCKNEWSAPI-FT-analyst_blog|quick_take-2487567",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T12:01:04-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 13:05:49",
    "publisher": "Fox Business",
    "title": "Walmart expands drone delivery service to 3 more states in race against Amazon",
    "image": "https://images.financialmodelingprep.com/news/walmart-expands-drone-delivery-service-to-3-more-states-20250606.jpg",
    "site": "foxbusiness.com",
    "text": "Walmart is expanding its drone delivery service to three more states in a bid to compete with rival Amazon.",
    "url": "https://www.foxbusiness.com/lifestyle/walmart-expands-drone-delivery-service-three-more-states-race-against-amazon",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T13:05:49-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-06 18:53:49",
    "publisher": "CNBC",
    "title": "Walmart chases new and younger customers as tariffs rattle shoppers",
    "image": "https://images.financialmodelingprep.com/news/walmart-chases-new-and-younger-customers-as-tariffs-rattle-20250606.jpg",
    "site": "cnbc.com",
    "text": "Walmart is trying to gain new customers despite economic worries, as Chief Financial Officer John David Rainey told reporters that tariffs haven't caused a shift in shopping behavior. The retailer hosted its annual gathering for store employees, managers and executives in Northwest Arkansas.",
    "url": "https://www.cnbc.com/2025/06/06/walmart-tariffs-price-increases-annual-meeting.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-06T18:53:49-04:00",
    "date_et": "2025-06-06"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-08 15:52:00",
    "publisher": "The Motley Fool",
    "title": "Where Will Walmart Stock Be in 3 Years?",
    "image": "https://images.financialmodelingprep.com/news/where-will-walmart-stock-be-in-3-years-20250608.jpg",
    "site": "fool.com",
    "text": "When most investors are thinking about buying a particular stock, they'll start by looking at the underlying company's recent fiscal results. And to be fair, it's a sound approach.",
    "url": "https://www.fool.com/investing/2025/06/08/where-will-walmart-stock-be-in-3-years/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-08T15:52:00-04:00",
    "date_et": "2025-06-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-08 17:19:52",
    "publisher": "PYMNTS",
    "title": "Walmart Targets Younger Consumers Amid Tariff Troubles",
    "image": "https://images.financialmodelingprep.com/news/walmart-targets-younger-consumers-amid-tariff-troubles-20250608.jpg",
    "site": "pymnts.com",
    "text": "Walmart is reportedly focusing on new and younger shoppers to offset the impact of tariffs. [contact-form-7] As CNBC reported late Friday (June 8), the retail giant has rolled out a new ad campaign, a clothing brand for tweens, and expanded drone deliveries to woo these consumers at a time when Americans are curbing their spending.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-targets-younger-consumers-amid-tariff-troubles/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-08T17:19:52-04:00",
    "date_et": "2025-06-08"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 04:12:00",
    "publisher": "The Motley Fool",
    "title": "3 Reasons to Buy Walmart Stock Like There's No Tomorrow",
    "image": "https://images.financialmodelingprep.com/news/3-reasons-to-buy-walmart-stock-like-theres-no-tomorrow-20250609.jpg",
    "site": "fool.com",
    "text": "Walmart (WMT -0.50%) is the largest company in the world by sales, and it's held on to that status tightly, even as tech stocks have surged and the world has gone digital. Although Amazon, the second-largest company, keeps getting closer, Walmart's simple retail model beats out everyone else.",
    "url": "https://www.fool.com/investing/2025/06/09/x-reasons-to-buy-wmt-stock-like-theres-no-tomorrow/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T04:12:00-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 07:14:09",
    "publisher": "CNBC Television",
    "title": "Mizuho names Walmart its top consumer internet pick",
    "image": "https://images.financialmodelingprep.com/news/mizuho-names-walmart-its-top-consumer-internet-pick-20250609.jpg",
    "site": "youtube.com",
    "text": "CNBC's Becky Quick reports on the latest news.",
    "url": "https://www.youtube.com/watch?v=8ZhX9QTDQbI",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T07:14:09-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 08:20:00",
    "publisher": "PRNewsWire",
    "title": "OnePay and Synchrony to Launch New Industry-Leading Credit Card Program With Walmart; Credit Card to Be Powered by Mastercard and Set to Go Live This Fall",
    "image": "https://images.financialmodelingprep.com/news/onepay-and-synchrony-to-launch-new-industryleading-credit-card-program-20250609.jpg",
    "site": "prnewswire.com",
    "text": "Synchrony to become exclusive issuer of OnePay credit cards at Walmart, with the credit card experience embedded inside the OnePay app The program will add credit cards to OnePay's growing portfolio of financial services products, helping consumers save, spend, borrow, and grow their money — all in one place NEW YORK and STAMFORD, Conn. , June 9, 2025 /PRNewswire/ -- OnePay, a leading consumer fintech, and Synchrony (NYSE: SYF), a premier consumer financial services company, today announced a strategic partnership to exclusively power a new industry-leading credit card program with Walmart (NYSE: WMT).",
    "url": "https://www.prnewswire.com/news-releases/onepay-and-synchrony-to-launch-new-industry-leading-credit-card-program-with-walmart-credit-card-to-be-powered-by-mastercard-and-set-to-go-live-this-fall-302476403.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T08:20:00-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 08:22:00",
    "publisher": "GlobeNewsWire",
    "title": "OnePay and Synchrony to Launch New Industry-Leading Credit Card Program With Walmart; Credit Card to Be Powered by Mastercard and Set to Go Live This Fall",
    "image": "https://images.financialmodelingprep.com/news/onepay-and-synchrony-to-launch-new-industryleading-credit-card-20250609.jpg",
    "site": "globenewswire.com",
    "text": "Synchrony to become exclusive issuer of OnePay credit cards at Walmart, with the credit card experience embedded inside the OnePay app",
    "url": "https://www.globenewswire.com/news-release/2025/06/09/3095809/0/en/OnePay-and-Synchrony-to-Launch-New-Industry-Leading-Credit-Card-Program-With-Walmart-Credit-Card-to-Be-Powered-by-Mastercard-and-Set-to-Go-Live-This-Fall.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T08:22:00-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 10:50:21",
    "publisher": "Zacks Investment Research",
    "title": "Walmart's Push Into High-Margin Ventures: A Blueprint for Growth?",
    "image": "https://images.financialmodelingprep.com/news/walmarts-push-into-highmargin-ventures-a-blueprint-for-growth-20250609.jpg",
    "site": "zacks.com",
    "text": "WMT is leaning into advertising, memberships and marketplace growth to drive profits and reshape its retail future.",
    "url": "https://www.zacks.com/stock/news/2490748/walmart-s-push-into-high-margin-ventures-a-blueprint-for-growth?cid=CS-STOCKNEWSAPI-FT-analyst_blog|quick_take-2490748",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T10:50:21-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 10:51:24",
    "publisher": "CNBC",
    "title": "Walmart is using its own fintech firm to provide credit cards after dumping Capital One",
    "image": "https://images.financialmodelingprep.com/news/walmart-is-using-its-own-fintech-firm-to-provide-20250609.jpg",
    "site": "cnbc.com",
    "text": "Walmart's majority-owned fintech startup OnePay said Monday that it was launching a pair of new credit cards for customers of the world's biggest retailer. To do so, OnePay is partnering with Synchrony, a major behind-the-scenes player in retail cards, which will issue the cards and handle underwriting decisions starting in the fall, the companies said.",
    "url": "https://www.cnbc.com/2025/06/09/walmart-onepay-synchrony-credit-cards-capital-one.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T10:51:24-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 11:23:22",
    "publisher": "PYMNTS",
    "title": "Walmart Bets On AI Assistant Sparky To Ignite Sales",
    "image": "https://images.financialmodelingprep.com/news/walmart-bets-on-ai-assistant-sparky-to-ignite-sales-20250609.jpg",
    "site": "pymnts.com",
    "text": "Walmart is expanding its artificial intelligence (AI) offerings by introducing a new shopping assistant. Customers can now access the generative AI-powered “Sparky” on the Walmart app, the retail giant said in an Friday (June 6) announcement.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-bets-on-ai-assistant-sparky-to-ignite-sales/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T11:23:22-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 13:14:38",
    "publisher": "Seeking Alpha",
    "title": "3 Potential Winners From The Tariff/Trade War",
    "image": "https://images.financialmodelingprep.com/news/3-potential-winners-from-the-tarifftrade-war-20250609.jpg",
    "site": "seekingalpha.com",
    "text": "We are ten weeks into the new tariff regime with the suspension of reciprocal tariffs due to expire in a month. These tariff changes are having wide impacts across the economy and the only new trade deal so far that has happened has been with the United Kingdom. Tariffs on steel and aluminum just got boosted to 50% and major retailers like Walmart and Amazon are pushing on suppliers to eat most of the new tariff costs.",
    "url": "https://seekingalpha.com/article/4793481-3-potential-winners-from-tariff-trade-war",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T13:14:38-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 16:12:31",
    "publisher": "Seeking Alpha",
    "title": "Walmart Inc. (WMT) Presents at 2025 Oppenheimer Consumer Growth & E-Commerce Conference (Transcript)",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-presents-at-2025-oppenheimer-consumer-growth-20250609.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart Inc. (NYSE:WMT ) 2025 Oppenheimer Consumer Growth & E-Commerce Conference June 9, 2025 2:15 PM ET Company Participants John David Rainey - Executive VP & CFO Conference Call Participants Rupesh Dhinoj Parikh - Oppenheimer & Co. Inc., Research Division Rupesh Dhinoj Parikh Good afternoon, everyone, and thank you for joining us at Oppenheimer's 25th Annual Consumer Growth and E-Commerce Conference. My name is Rupesh Parikh.",
    "url": "https://seekingalpha.com/article/4793522-walmart-inc-wmt-presents-at-2025-oppenheimer-consumer-growth-and-e-commerce-conference",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T16:12:31-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-09 19:24:29",
    "publisher": "PYMNTS",
    "title": "Walmart Takes Aim at Banks With OnePay Expansion",
    "image": "https://images.financialmodelingprep.com/news/walmart-takes-aim-at-banks-with-onepay-expansion-20250609.jpg",
    "site": "pymnts.com",
    "text": "Each week, PYMNTS Intelligence details the competition between Walmart and Amazon, two behemoths of commerce, jockeying for share of wallet and hundreds of millions of consumers. [contact-form-7] In recent reports, we've chronicled the growth in subscriptions used by consumers across both these firms, with more than 30% of consumers having a Walmart+ account.",
    "url": "https://www.pymnts.com/walmart/2025/walmart-takes-aim-at-banks-with-onepay-expansion/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-09T19:24:29-04:00",
    "date_et": "2025-06-09"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 03:06:00",
    "publisher": "The Motley Fool",
    "title": "Prediction: These Are Wall Street's Next 2 Trillion-Dollar Stocks -- and Neither Is Palantir Technologies",
    "image": "https://images.financialmodelingprep.com/news/prediction-these-are-wall-streets-next-2-trilliondollar-stocks-20250610.jpg",
    "site": "fool.com",
    "text": "Over the last century, no asset class has come remotely close to matching the annual return of stocks. Spanning multidecade periods, it's commonplace to see the Dow Jones Industrial Average, S&P 500, and Nasdaq Composite pushing to all-time highs.",
    "url": "https://www.fool.com/investing/2025/06/10/wall-street-next-2-trillion-dollar-stocks-palantir/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T03:06:00-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 10:00:22",
    "publisher": "Zacks Investment Research",
    "title": "Here is What to Know Beyond Why Walmart Inc. (WMT) is a Trending Stock",
    "image": "https://images.financialmodelingprep.com/news/here-is-what-to-know-beyond-why-walmart-inc-20250610.jpg",
    "site": "zacks.com",
    "text": "Recently, Zacks.com users have been paying close attention to Walmart (WMT). This makes it worthwhile to examine what the stock has in store.",
    "url": "https://www.zacks.com/stock/news/2492227/here-is-what-to-know-beyond-why-walmart-inc-wmt-is-a-trending-stock?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|most_searched_stocks-2492227",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T10:00:22-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 11:00:00",
    "publisher": "PRNewsWire",
    "title": "Walmart Inc. Signs 338,000-SF Lease at Jay Paul Company's Iconic Tech Corners Campus in Sunnyvale",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-signs-338000sf-lease-at-jay-paul-companys-20250610.jpg",
    "site": "prnewswire.com",
    "text": "Newmark Arranges Silicon Valley's Largest1 New Office Lease Since 20232 SAN JOSE, Calif. , June 10, 2025 /PRNewswire/ -- Newmark and Jay Paul Company announce that the eCommerce division of Walmart, Inc. has signed a 338,307-square-foot lease at Tech Corners, located at 803-815 11th Avenue in Sunnyvale, California.",
    "url": "https://www.prnewswire.com/news-releases/walmart-inc-signs-338-000-sf-lease-at-jay-paul-companys-iconic-tech-corners-campus-in-sunnyvale-302477102.html",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T11:00:00-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 11:04:10",
    "publisher": "247 Wallst",
    "title": "Why I Think Walmart and Aldi Grocery Prices Are the Same – Are We Alone in This Opinion?",
    "image": "https://images.financialmodelingprep.com/news/why-i-think-walmart-and-aldi-grocery-prices-are-20250610.jpg",
    "site": "https://247wallst.com",
    "text": "As people all over the country are looking for any way possible to reduce their overall expenses, cheaper groceries are at the top of everyone’s list. Enter Aldi and Walmart, two of the more affordable grocery options available to most people. Key Points This Redditor is trying to gauge whether others agree with his assessment of which grocery store is cheaper. Comparing Walmart and Aldi pricing isn’t new, as both of these grocers aim to save people money. When you need more than just groceries, Walmart is the easy choice, offering a wide range of options, including electronics and a pharmacy. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) For one Redditor, they are trying to decide exactly which one of these two stores is less expensive. Posting in r/MiddleClassFinance, their admittedly unpopular opinion is that these two stores are far closer in pricing than most people believe. Grocery Shopping Duel It should go without saying that for most people, Aldi and Walmart are considered two of the least expensive grocery options. In this Redditor’s eyes, when they did some research on everyday items like milk, eggs, or meat, there was almost no difference in price. In fact, after becoming an Aldi believer for a while, the original poster switched back to Walmart after realizing they were not saving all that much. As a family of five living in Michigan, this Redditor is likely looking at slightly higher grocery bills with a few extra mouths to feed. However, they are also away from coastal cities where prices tend to be a little higher. So, is it true that Aldi and Walmart are close in price, or is this Redditor’s belief solely reserved for their scenario? Which Store Is Actually Cheaper? Even a quick Google search will tell you that Walmart and Aldi are likely to trade positions as the least expensive grocers. In the case of meat, there is a good chance that Aldi will win; however, as of the beginning of June 2025, online pricing is relatively even for eggs. The same goes for milk, where both stores are under $3 for 2% milk, so it’s a tie here as well. If you are someone who loves Almond Milk, Aldi takes the win. However, as you continue to explore other options, such as bananas, pasta sauces, and even dish soap, Aldi is generally a little less expensive. However, there is a significant caveat to saying that while Aldi might be cheaper, in some cases, “cheaper” only means a few pennies. In other words, this Redditor’s belief that these two stores are relatively close in price is not far off from reality. Moving on to the comments on this post, there is a fairly healthy debate about which one is cheaper, with no clear winner. Aldi does seem to receive more praise from people who regularly shop at both, but even they admit that the price difference is relatively small. What About Quality? While Aldi and Walmart may be close in price, it immediately raises the question of which store offers better quality. In this case, there is a pretty convincing argument that Aldi wins this category. It’s hard to pinpoint when Walmart’s reputation for quality began to take a hit, but it has certainly developed a reputation for being of lesser quality than its competitors. In the case of the original poster, they admit that while their Walmart has pretty good fruit, they have been to others where they wouldn’t touch the fruit at all. Other Redditors in the comments echo the same sentiment, expressing concerns that the quality of Aldi&#8217;s produce, pantry goods, meat, and other fresh goods is far superior. Aldi has a standout reputation right now for offering great quality at low prices, giving it an easy win in this category. The caveat is that if there isn’t an Aldi near you, shopping at Walmart will not only not break the bank, but you can certainly find quality items if you spend some time digging through fruits and vegetables. Of course, if you need something other than food, such as electronics or clothing, or want to buy a large quantity of plastic spoons and plates for a birthday party, there is a good chance most people will go to Walmart first. The post Why I Think Walmart and Aldi Grocery Prices Are the Same &#8211; Are We Alone in This Opinion? appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/personal-finance/2025/06/09/why-i-think-walmart-and-aldi-grocery-prices-are-the-same-are-we-alone-in-this-opinion/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T11:04:10-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 11:10:13",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Stock Trades at a Premium Valuation: How to Play the Stock",
    "image": "https://images.financialmodelingprep.com/news/walmart-stock-trades-at-a-premium-valuation-how-to-20250610.jpg",
    "site": "zacks.com",
    "text": "WMT's strong growth and omnichannel edge fuel gains, but its premium valuation raises caution for new investors.",
    "url": "https://www.zacks.com/stock/news/2492571/walmart-stock-trades-at-a-premium-valuation-how-to-play-the-stock?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2492571",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T11:10:13-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 13:18:25",
    "publisher": "Patch",
    "title": "Popular Home Improvement Chain Set To Open New Stores In 2025: Report",
    "image": "https://images.financialmodelingprep.com/news/popular-home-improvement-chain-set-to-open-new-stores-20250610.jpg",
    "site": "https://www.patch.com",
    "text": "MOORESVILLE, NC — Popular hardware and home improvement store chain Lowe's has opened a number of new stores in 2025 and plans to open more before the end of the year, according to a new report. Additionally, the chain also plans to open more stores in 2026, making it even easier for shoppers across the U.S. to purchase tools, appliances, building materials and more all under one roof. New Store Locations USA Today reports Lowe's plans to open five to 10 new stores this year, two of which have already opened in Magnolia and Fort Worth, Texas. Additionally, a store in Asheville, N.C., that was closed due to Hurricane Helene in September has since reopened. A Lowe's spokesperson also confirmed to USA Today the company plans to open new stores in Georgetown, Texas, and Maricopa, Ariz., later this year. According to a store directory on the company's website, Lowe's operates over 100 stores in Texas and more than 30 in Arizona. Lowe's also operates over 100 stores in North Carolina where the company is headquartered. More Stores To Come In December, Lowe's held its 2024 analyst and investor conference to provide updates on its key growth and productivity initiatives and near-term and long-term financial targets. During the event, the company announced plans to expand its footprint and attract new customers to the brand by opening 10 to 15 stores per year over the next several years in fast-growing markets in the U.S., according to a news release posted to the company's website. \"In planning this next phase of store expansion, the company will build on the success of its recent new store openings, while also leveraging its enhanced space productivity initiatives,\" the release reads. \"With these new stores, the company expects to strengthen its brand position, build its customer base and drive incremental sales and return on invested capital.\" According to USA Today, the company's plans for five to 10 new stores in 2025 accounts for time needed to ramp up their opening efforts, and the projected 10 to 15 new stores per year will start in 2026. Store Openings In 2025 Lowe's is just one of several companies to recently announce expansion plans for the remainder of 2025 and into 2026. Furniture retailer IKEA confirmed in May the company has already opened four \"plan and order\" points with pick-up locations, as well as one pick-up point location, thus far in 2025. A company spokesperson said IKEA plans to open three more stores and three more plan and order point with pick up locations before the end of the year, and two more are already in the works for 2026. Walmart also confirmed last month about 10 new stores are scheduled to open by the end of 2025, five of which are set to open by September. Meanwhile, popular hot dog chain Wienerschnitzel confirmed plans to add restaurants to multiple Walmart stores, starting with six owned and operated by local high-caliber franchisees. Grocery store chain Wegmans Food Markets confirmed Friday plans to open a total of three stores this year, with one already open and two more scheduled to open this summer. Culver's, a beloved fast food chain specializing in burgers, chicken and frozen treats, has already opened new restaurants in 15 states thus far in 2025 and has broken ground on new restaurants planned for communities in 12 states. Restaurant chain Raising Cane's, which specializes in chicken finger meals and combos, recently announced plans for new locations in Massachusetts and Connecticut as the company continues to expand throughout the Northeast.",
    "url": "https://www.patch.com/us/across-america/popular-home-improvement-chain-set-open-new-stores-2025-report",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T13:18:25-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 13:40:35",
    "publisher": "Investopedia",
    "title": "Here's Where Consumer Purchase Data Shows Walmart Prices Rising",
    "image": "https://images.financialmodelingprep.com/news/heres-where-consumer-purchase-data-shows-walmart-prices-rising-20250610.jpg",
    "site": "investopedia.com",
    "text": "Walmart warned that higher prices were on the way. Fresh data indicates that they're here.",
    "url": "https://www.investopedia.com/here-s-where-consumer-purchase-data-shows-walmart-prices-rising-11751506",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T13:40:35-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-10 21:23:00",
    "publisher": "The Motley Fool",
    "title": "3 Resilient Retail Stocks That Are Still Growing Amid Tariffs",
    "image": "https://images.financialmodelingprep.com/news/3-resilient-retail-stocks-that-are-still-growing-amid-20250610.jpg",
    "site": "fool.com",
    "text": "The tariff risk is a big one for retailers. It can spike costs significantly for businesses, forcing them to either pass on those increases to consumers, or absorb them, resulting in leaner profits.",
    "url": "https://www.fool.com/investing/2025/06/10/3-resilient-retail-stocks-that-are-still-growing-a/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-10T21:23:00-04:00",
    "date_et": "2025-06-10"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-11 10:25:56",
    "publisher": "Seeking Alpha",
    "title": "Walmart Inc. (WMT) Presents at 2025 Evercore Consumer & Retail Conference Transcript",
    "image": "https://images.financialmodelingprep.com/news/walmart-inc-wmt-presents-at-2025-evercore-consumer-retail-20250611.jpg",
    "site": "seekingalpha.com",
    "text": "Walmart Inc. (NYSE:WMT ) 2025 Evercore Consumer & Retail Conference June 11, 2025 8:00 AM ET Company Participants Stephanie Wissink - Senior Vice President of Investor Relations Todd Sears - Senior VP & CFO of Sam's Club Conference Call Participants Gregory Scott Melich - Evercore ISI Institutional Equities, Research Division Gregory Scott Melich Well, good morning, everyone, to the second day of our Consumer and Retail Conference here for Evercore. I'm Greg Melich.",
    "url": "https://seekingalpha.com/article/4794098-walmart-inc-wmt-presents-at-2025-evercore-consumer-and-retail-conference-transcript",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-11T10:25:56-04:00",
    "date_et": "2025-06-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-11 18:51:00",
    "publisher": "The Motley Fool",
    "title": "Better Buy Now: A 50/50 Split of Costco and Walmart or Dollar General and Dollar Tree?",
    "image": "https://images.financialmodelingprep.com/news/better-buy-now-a-5050-split-of-costco-and-20250611.jpg",
    "site": "fool.com",
    "text": "After reaching multi-year lows in 2024, Dollar General (DG 0.19%) and Dollar Tree (DLTR 1.15%) are staging epic recoveries in 2025.",
    "url": "https://www.fool.com/investing/2025/06/11/better-buy-now-costco-walmart-dollar-general-tree/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-11T18:51:00-04:00",
    "date_et": "2025-06-11"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-12 11:23:46",
    "publisher": "24/7 Wall Street",
    "title": "Walmart — Yes Walmart — Ready to Bet Big on AI",
    "image": "https://images.financialmodelingprep.com/news/walmart-yes-walmart-ready-to-bet-big-on-ai-20250612.jpg",
    "site": "247wallst.com",
    "text": "Walmart (NYSE:WMT) is not the first company that pops into mind when thinking of stocks betting big on artificial intelligence (AI).",
    "url": "https://247wallst.com/investing/2025/06/12/walmart-yes-walmart-ready-to-bet-big-on-ai/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-12T11:23:46-04:00",
    "date_et": "2025-06-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-12 14:52:00",
    "publisher": "Barrons",
    "title": "Walmart, Aflac and 8 Other Dividend Aristocrats That Also Wear Buyback Crowns",
    "image": "https://images.financialmodelingprep.com/news/walmart-aflac-and-8-other-dividend-aristocrats-that-also-20250612.jpg",
    "site": "barrons.com",
    "text": "When it comes to playing defense, investors shouldn't overlook dividends' twin, share buybacks, which can signal management is bullish.",
    "url": "https://www.barrons.com/articles/walmart-dividend-stocks-aristocrats-buybacks-e382bfea",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-12T14:52:00-04:00",
    "date_et": "2025-06-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-12 17:31:00",
    "publisher": "Market Watch",
    "title": "Walmart's stock looks like it's in trouble. What the chart says may come next.",
    "image": "https://images.financialmodelingprep.com/news/walmarts-stock-looks-like-its-in-trouble-what-the-20250612.jpg",
    "site": "marketwatch.com",
    "text": "Walmart's stock has suffered its longest losing streak in seven years, but the technical outlook remains bullish as it remains well above a key long-term trend tracker.",
    "url": "https://www.marketwatch.com/story/walmarts-stock-looks-like-its-in-trouble-what-the-chart-says-may-come-next-e43b0e12",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-12T17:31:00-04:00",
    "date_et": "2025-06-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-12 18:16:32",
    "publisher": "Benzinga",
    "title": "Walmart Heiress Takes On Trump With 'No Kings' Ad: White House Calls It 'Burning Some Of Her Inheritance For A PR Stunt'",
    "image": "https://images.financialmodelingprep.com/news/walmart-heiress-takes-on-trump-with-no-kings-ad-20250612.jpg",
    "site": "benzinga.com",
    "text": "Retailer Walmart Inc WMT has been battling with the Donald Trump administration over tariffs and may have a new fight on its hands with Trump fans thanks to an heiress of the company's founding family.",
    "url": "https://www.benzinga.com/news/politics/25/06/45916986/walmart-heiress-takes-on-trump-with-no-kings-ad-white-house-calls-it-burning-some-of-her-inheritance-for-a-pr-stunt",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-12T18:16:32-04:00",
    "date_et": "2025-06-12"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 05:30:00",
    "publisher": "WSJ",
    "title": "Walmart and Amazon Are Exploring Issuing Their Own Stablecoins",
    "image": "https://images.financialmodelingprep.com/news/walmart-and-amazon-are-exploring-issuing-their-own-stablecoins-20250613.jpg",
    "site": "wsj.com",
    "text": "Corporate coins could take payments activity away from banks and the traditional financial system.",
    "url": "https://www.wsj.com/finance/banking/walmart-amazon-stablecoin-07de2fdd",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T05:30:00-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 09:44:33",
    "publisher": "Invezz",
    "title": "Amazon and Walmart considering to issue own stablecoins: report",
    "image": "https://images.financialmodelingprep.com/news/amazon-and-walmart-considering-to-issue-own-stablecoins-report-20250613.jpg",
    "site": "invezz.com",
    "text": "Retail behemoths Walmart and Amazon are exploring the issuance of their own stablecoins, says a Wall Street Journal report.  These companies are aiming for a strategic maneuver that could save these companies billions in transaction fees and accelerate payment processing.",
    "url": "https://invezz.com/news/2025/06/13/amazon-and-walmart-considering-to-issue-own-stablecoins-report/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T09:44:33-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 09:47:51",
    "publisher": "Proactive Investors",
    "title": "Walmart, Amazon explore launching stablecoins amid push to cut card fees",
    "image": "https://images.financialmodelingprep.com/news/walmart-amazon-explore-launching-stablecoins-amid-push-to-cut-20250613.jpg",
    "site": "proactiveinvestors.com",
    "text": "Walmart Inc (NYSE:WMT, ETR:WMT) and Amazon.com Inc (NASDAQ:AMZN) are exploring launching their own US dollar-pegged stablecoins, a move that could reshape how consumers pay for goods online and in stores, according to the Wall Street Journal. The retail giants are looking to streamline payment processes and potentially bypass traditional banking systems, with an eye on reducing the billions they collectively spend on credit and debit card processing fees, the report said.",
    "url": "https://www.proactiveinvestors.com/companies/news/1072958",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T09:47:51-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 11:46:00",
    "publisher": "Barrons",
    "title": "Walmart and Amazon Explore Stablecoins. Visa Stock Tumbles but Analysts Don't See Immediate Threat",
    "image": "https://images.financialmodelingprep.com/news/walmart-and-amazon-explore-stablecoins-visa-stock-tumbles-but-20250613.jpg",
    "site": "barrons.com",
    "text": "Stablecoins are unlikely to impact Visa and Mastercard in the short term, say analysts.",
    "url": "https://www.barrons.com/articles/visa-stock-stablecoins-walmart-amazon-c57ead74",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T11:46:00-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 12:19:00",
    "publisher": "Market Watch",
    "title": "From Walmart to car washes, American companies are getting caught up in ICE raids and protests",
    "image": "https://images.financialmodelingprep.com/news/from-walmart-to-car-washes-american-companies-are-getting-20250613.jpg",
    "site": "marketwatch.com",
    "text": "‘Employees are in fear': Some workers are staying home and more brands could face boycott campaigns that have become a staple in the fight over social-justice issues",
    "url": "https://www.marketwatch.com/story/from-walmart-to-car-washes-american-companies-are-getting-caught-up-in-ice-raids-and-protests-df3c6c4e",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T12:19:00-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-13 20:52:00",
    "publisher": "Barrons",
    "title": "Costco, O'Reilly, and Walmart: Together, These Retail Bulls Spell COW.",
    "image": "https://images.financialmodelingprep.com/news/costco-oreilly-and-walmart-together-these-retail-bulls-spell-20250613.jpg",
    "site": "barrons.com",
    "text": "With FAANG a little dated, the Magnificent Seven struggling, and markets deeply uncertain, these high-multiple retail powerhouses get their own acronym.",
    "url": "https://www.barrons.com/articles/costco-oreilly-and-walmart-together-these-retail-bulls-spell-cow-66bde5d8",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-13T20:52:00-04:00",
    "date_et": "2025-06-13"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-14 03:06:00",
    "publisher": "The Motley Fool",
    "title": "Prediction: 3 Non-Tech Stocks That Can Blow Past Nvidia's Market Cap by 2035",
    "image": "https://images.financialmodelingprep.com/news/prediction-3-nontech-stocks-that-can-blow-past-nvidias-20250614.jpg",
    "site": "fool.com",
    "text": "For more than two years, the evolution of artificial intelligence (AI) has dominated the investment landscape. The capacity for AI-empowered software and systems to make split-second decisions without the aid of humans is a technology that can provide operating efficiencies throughout most industries around the globe.",
    "url": "https://www.fool.com/investing/2025/06/14/prediction-3-stocks-can-blow-past-nvidia-by-2035/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-14T03:06:00-04:00",
    "date_et": "2025-06-14"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-15 19:00:00",
    "publisher": "The Motley Fool",
    "title": "Best Stock to Buy Right Now: Walmart vs. Costco",
    "image": "https://images.financialmodelingprep.com/news/best-stock-to-buy-right-now-walmart-vs-costco-20250615.jpg",
    "site": "fool.com",
    "text": "Owning Costco (COST -1.34%) or Walmart (WMT -0.41%) stock today might seem risky, given the uncertainty around tariffs and economic growth. Retailers are among the first to notice when consumers are pulling back on spending, often by trading down to cheaper brands and limiting discretionary purchases.",
    "url": "https://www.fool.com/investing/2025/06/15/best-stock-to-buy-right-now-walmart-vs-costco/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-15T19:00:00-04:00",
    "date_et": "2025-06-15"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-17 10:31:15",
    "publisher": "Zacks Investment Research",
    "title": "Is Walmart (WMT) a Buy as Wall Street Analysts Look Optimistic?",
    "image": "https://images.financialmodelingprep.com/news/is-walmart-wmt-a-buy-as-wall-street-analysts-20250617.jpg",
    "site": "zacks.com",
    "text": "The recommendations of Wall Street analysts are often relied on by investors when deciding whether to buy, sell, or hold a stock. Media reports about these brokerage-firm-employed (or sell-side) analysts changing their ratings often affect a stock's price.",
    "url": "https://www.zacks.com/stock/news/2506370/is-walmart-wmt-a-buy-as-wall-street-analysts-look-optimistic?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|average_broker_rating-2506370",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-17T10:31:15-04:00",
    "date_et": "2025-06-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-17 11:00:01",
    "publisher": "Schwab Network",
    "title": "Retailers Reacting to Tariffs: WMT Unsung Streaming Tie & AMZN A.I. Growth",
    "image": "https://images.financialmodelingprep.com/news/retailers-reacting-to-tariffs-wmt-unsung-streaming-tie-amzn-ai-20250617.jpg",
    "site": "youtube.com",
    "text": "Tsvetta Kaleynska gives investors an overview of the retail picture and where it stands as tariffs paint an uncertain background. While she notes companies like Target (TGT) facing numerous headwinds, it's not the same across the industry.",
    "url": "https://www.youtube.com/watch?v=06-ig2eLNcc",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-17T11:00:01-04:00",
    "date_et": "2025-06-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-17 14:36:00",
    "publisher": "PYMNTS",
    "title": "Walmart Working on Shoppable Ads for Vizio TVs",
    "image": "https://images.financialmodelingprep.com/news/walmart-working-on-shoppable-ads-for-vizio-tvs-20250617.jpg",
    "site": "pymnts.com",
    "text": "Walmart reportedly aims to enable consumers to make purchases through TV remotes and interfaces while they are watching TV shows. [contact-form-7] This plan is one of several that the retailer is working on after its $2.",
    "url": "https://www.pymnts.com/news/retail/2025/walmart-working-on-shoppable-ads-for-vizio-tvs/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-17T14:36:00-04:00",
    "date_et": "2025-06-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-17 17:40:55",
    "publisher": "InvestorPlace",
    "title": "How Walmart and Amazon Could Upend the Banking System",
    "image": "https://images.financialmodelingprep.com/news/how-walmart-and-amazon-could-upend-the-banking-system-20250617.jpg",
    "site": "investorplace.com",
    "text": "Walmart and Amazon send a warning shot to credit card companies",
    "url": "https://investorplace.com/2025/06/how-walmart-and-amazon-could-upend-the-banking-system/",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-17T17:40:55-04:00",
    "date_et": "2025-06-17"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-18 11:51:04",
    "publisher": "Zacks Investment Research",
    "title": "Walmart Sees Continued Comps Gains: Will Broad-Based Strength Support?",
    "image": "https://images.financialmodelingprep.com/news/walmart-sees-continued-comps-gains-will-broadbased-strength-support-20250618.jpg",
    "site": "zacks.com",
    "text": "WMT's U.S. comps growth of 4.5% in the first quarter shows strength in essentials, e-commerce and private brands despite headwinds.",
    "url": "https://www.zacks.com/stock/news/2511193/walmart-sees-continued-comps-gains-will-broad-based-strength-support?cid=CS-STOCKNEWSAPI-FT-analyst_blog|quick_take-2511193",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-18T11:51:04-04:00",
    "date_et": "2025-06-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-18 12:41:24",
    "publisher": "Zacks Investment Research",
    "title": "CRRFY or WMT: Which Is the Better Value Stock Right Now?",
    "image": "https://images.financialmodelingprep.com/news/crrfy-or-wmt-which-is-the-better-value-stock-20250618.jpg",
    "site": "zacks.com",
    "text": "Investors looking for stocks in the Retail - Supermarkets sector might want to consider either Carrefour SA (CRRFY) or Walmart (WMT). But which of these two companies is the best option for those looking for undervalued stocks?",
    "url": "https://www.zacks.com/stock/news/2511145/crrfy-or-wmt-which-is-the-better-value-stock-right-now?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_3-2511145",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-18T12:41:24-04:00",
    "date_et": "2025-06-18"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-19 10:01:48",
    "publisher": "Patch",
    "title": "Border Patrol Arrests U.S. Citizen, 20, In Dramatic LA County Take-Down, Prompting New Protests",
    "image": "https://images.financialmodelingprep.com/news/border-patrol-arrests-us-citizen-20-in-dramatic-la-county-20250619.jpg",
    "site": "https://www.patch.com",
    "text": "PICO RIVERA, CA — A U.S. citizen was arrested during a federal immigration raid in Pico Rivera Tuesday after he spoke out against an agent's questioning of another man. The violent takedown, which was caught on video, prompted a protest later that evening. Now, Rep. Linda Sánchez is demanding answers from federal officials about the incident and several other raids in the area that appear to target workers based on their ethnicity, she said in a letter to the Secretary of the Department of Homeland Security, the Director of U.S. Immigration and Customs Enforcement, and the U.S. Attorney General. Federal authorities conducted raids at multiple sites in the Southeast Los Angeles County city, including a Food 4 Less on Whittier Boulevard and a Lowes Home Improvement store on Washington Boulevard, where the confrontation occurred. Footage from the incident obtained by KTLA shows several masked border patrol agents in a struggle with a 20-year-old Adrian Andrew Martinez. Amid the scuffle, someone can be heard screaming, \"He's a U.S. citizen!\" In the video, Martinez appeared to be resisting efforts to handcuff him, but he was quickly taken to the ground, detained and put in the back of a U.S. Customs and Border Protection vehicle. Martinez, was on a break from his job at a nearby Walmart when he called out the border patrol agent's questioning of an elderly man in the parking lot, KTLA reported. Witness Oscar Preciado said Martinez was only questioning the officers when they put their hands on him. \"They started yelling at us, 'Get back. Get back. Get back.' While they were pushing one of the other guys, they threw him to the floor twice by the neck, just for standing up for his coworker, who they were grabbing,\" Preciado told ABC7. \"They’re saying that he attacked them so they want to press charges,\" his mother, Mayra Villarreal, told Fox 11. Reached for comment, a Customs and Border Protection spokesperson told Patch \"the videos are missing critical moments and don’t tell the whole story.\" \"Border Patrol agents conducted roving patrol duties in the city of Pico Riviera, CA. While making effecting the arrest of an illegal alien at the Lowe's store at 8600 Washington Blvd., agents were confronted by a hostile group that attempted to interfere with their duties. During the interference, an agent was punched in the face and another agent was struck in the arm by a member of the group. Despite interference from the growing crowd and resistance by the subject, he was taken into custody,\" the spokesperson wrote. The case has been presented to the U.S. Attorney’s Office, with the suspect facing prosecution on a charge of impeding or assaulting a federal Officer, according to CBP. The spokesman confirmed Martinez was in federal custody Wednesday afternoon. Sanchez (D-Whittier) said she has been working with the Hernandez family to locate Adrian, and connect him with his parents. “I am deeply troubled that a U.S. citizen, who supports his family by working at Walmart, and is, by all accounts, an upstanding member of his community, continues to be detained by the federal government,” Congresswoman Sánchez wrote. “Furthermore, upon learning more details of the raid and others occurring throughout Los Angeles, I am deeply concerned that the specific immigration raid that took place at this Walmart seems to be in violation of 42 U.S. Code § 1985, which states that targeting workers on the basis of their race, as well as subsequent use of excessive force, is a blatant violation of their civil rights.” Her letter further demanded responses from federal officials about the legal authority for holding Hernandez and whether border patrol agents had warrants to engage in immigration enforcement at the Pico Rivera Towne Center as well as who they were targeting and why. Tuesday's events also prompted city officials to release a statement. \"The City of Pico Rivera is aware and can confirm recent reports on immigration control operations conducted by the United States Immigration and Customs Control Service (ICE) within our city. These actions have, understandably, generated worry, fear and anxiety among many of our residents,\" the city wrote. \"We want to be clear: The City of Pico Rivera and Los Angeles County Sheriff's Department are not involved, cooperating with, or supporting, in any way, federal immigration control operations. Our city maintains its steadfast commitment to protecting the rights and dignity of all people, regardless of their migrant status. Each person has the right to due process as guaranteed by the Constitution,\" the statement continued. \"We are deeply concerned about the tone and nature of these recent actions. Reports of aggressive tactics, arrests without warrants and operatives that appear to target specific communities raise serious doubts about the proportionality, justice and legality of the process.\" The protest lasted for hours after news of the raids, with marchers traveling from City Hall to the corner of Rosemead and Washington boulevards. Los Angeles County Sheriff's Department deputies monitored the demonstration, but no arrests were reported. City News Service contributed to this report.",
    "url": "https://www.patch.com/california/los-angeles/us-citizen-arrested-violent-confrontation-federal-agents-la-county-reports",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-19T10:01:48-04:00",
    "date_et": "2025-06-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-19 10:01:48",
    "publisher": "Patch",
    "title": "Plainfield Staff Eye Opening Date For New Woodman's Grocery Store",
    "image": "https://images.financialmodelingprep.com/news/plainfield-staff-eye-opening-date-for-new-woodmans-grocery-20250619.jpg",
    "site": "https://www.patch.com",
    "text": "PLAINFIELD, IL — Residents of Plainfield and neighboring communities are highly anticipating the opening of the new Woodman's Food Market off 119th Street and Route 59. If all goes according to plan, with no delays, Economic Development Director Jake Melrose said the store is slated to open in October 2026, per Mayor John Argoudelis. So far, contractors have started pushing dirt, and Argoudelis expects the building to start going up later this year. The employee-owned company, founded in 1919, purchased the 36-acre lot where it plans to open a 240,000-square-foot store and a fuel center featuring a car wash, convenience store and oil change center. The site would also feature seven outlots open to additional development, Patch reported. RELATED: Woodman's Food Market Proposes Plainfield Store, Fuel Station With the new grocery store option will come a brand-new, fully improved intersection at 119th Street and Route 59. That entails dedicated left, right and through turn lanes, full crosswalks, and new light signals — \"all the bells and whistles ... that'll help traffic flow immensely,\" Argoudelis told Patch in January. As of Patch's previous update in January, the village was hopeful that Woodman's would open by the year's end. Plainfield staff first began working with the Woodman's team immediately following Walmart's closure in March 2023 to potentially redevelop the vacant lot, but efforts were unsuccessful, Patch reported. Woodman's location would allow the grocery store to provide locals with a \"better finished product than anything that was afforded to them by the former [Walmart] location.\"",
    "url": "https://www.patch.com/illinois/plainfield/plainfield-staff-eye-opening-date-new-woodmans-grocery-store",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-19T10:01:48-04:00",
    "date_et": "2025-06-19"
  },
  {
    "symbol": "WMT",
    "publishedDate": "2025-06-19 10:51:04",
    "publisher": "Zacks Investment Research",
    "title": "Walmart vs. The TJX Companies: Which Retailer Has the Edge in 2025?",
    "image": "https://images.financialmodelingprep.com/news/walmart-vs-the-tjx-companies-which-retailer-has-the-20250619.jpg",
    "site": "zacks.com",
    "text": "WMT's tech-driven growth and strong returns give it the edge over TJX's global expansion and off-price appeal in 2025.",
    "url": "https://www.zacks.com/stock/news/2515009/walmart-vs-the-tjx-companies-which-retailer-has-the-edge-in-2025?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2515009",
    "ticker": "WMT",
    "event_date": "2025-06-05",
    "window_start": "2025-05-29",
    "window_end": "2025-06-19",
    "publishedDateET": "2025-06-19T10:51:04-04:00",
    "date_et": "2025-06-19"
  }
]