[
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-09 08:15:00",
    "publisher": "The Motley Fool",
    "title": "27.3% of Warren Buffett's $258.7 Billion Portfolio Is Invested in These 2 American Stocks",
    "image": "https://images.financialmodelingprep.com/news/273-of-warren-buffetts-2587-billion-portfolio-is-invested-20250709.jpg",
    "site": "fool.com",
    "text": "Warren Buffett has said time and time again to never bet against America. Investors who buy and hold American stocks have seen miraculous gains in wealth over the last century, due to the economic dominance of the country that now has a gross domestic product (GDP) of $30 trillion.",
    "url": "https://www.fool.com/investing/2025/07/09/273-of-warren-buffetts-2587-billion-portfolio-is/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-09T08:15:00-04:00",
    "date_et": "2025-07-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-09 08:20:06",
    "publisher": "Benzinga",
    "title": "Bank of America Likely To Report Higher Q2 Earnings; These Most Accurate Analysts Revise Forecasts Ahead Of Earnings Call",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-likely-to-report-higher-q2-earnings-20250709.jpg",
    "site": "benzinga.com",
    "text": "Bank of America Corporation BAC will release earnings results for the second quarter, before the opening bell on Wednesday, July 16.",
    "url": "https://www.benzinga.com/analyst-stock-ratings/price-target/25/07/46316775/bank-of-america-likely-to-report-higher-q2-earnings-these-most-accurate-analysts-revise-forecasts-ahead-of-earnings-call",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-09T08:20:06-04:00",
    "date_et": "2025-07-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-09 09:00:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America to Report Second Quarter 2025 Financial Results and Host Investor Conference Call on July 16",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-to-report-second-quarter-2025-financial-20250709.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 9, 2025 /PRNewswire/ -- As previously announced, Bank of America will report its second quarter 2025 financial results on Wednesday, July 16.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-to-report-second-quarter-2025-financial-results-and-host-investor-conference-call-on-july-16-302500540.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-09T09:00:00-04:00",
    "date_et": "2025-07-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-09 10:00:11",
    "publisher": "247 Wallst",
    "title": "Here Are 3 ETFs Warren Buffett Would Approve Of for the Average Investor",
    "image": "https://images.financialmodelingprep.com/news/here-are-3-etfs-warren-buffett-would-approve-of-20250709.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points Warren Buffett is a long-term investor by nature, and only invests in those business models that are simple to understand. He is not one of those investors who keeps his strategy private; Buffett has been transparent along his investment journey. We’ve identified a trio of ETFs that fit his strategy and therefore would likely receive Buffett’s stamp of approval for the average investor in July. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) Everybody wants to invest like Warren Buffett, and rightfully so. The Omaha of Nebraska has amassed a fortune of $145.3 billion as of mid-2025 since making his first investment at the ripe age of 11. Now that he&#8217;s 94 years old, Buffett has become better with age, making him one of the most successful investors who ever lived. Fortunately, Buffett has shared investment nuggets along the way from which investors can glean to build their own winning strategies, formulas that fit both their risk tolerance, financial goals and budget. While Buffett is known for investing in individual stocks, those whose business models are simple enough to understand, he is ultimately an investor who is in it for the long haul. Similarly, ETFs are designed to let investors ride the market wave without having to make frequent changes if they don&#8217;t want to. That is why we believe we&#8217;ve identified three ETFs that Buffett himself would approve of for the average investor in July. iShares U.S. Financials ETF (IYF) Considering Warren Buffett&#8217;s inaugural investment was famously in a bank—Cities Service preferred shares—and financial institutions remain a lighthouse for his investment decisions, it makes sense to begin our exploration here. Our first pick: the iShares U.S. Financials ETF (IYF). And with Buffett&#8217;s own Berkshire Hathaway counted among this ETF&#8217;s top holdings, it would likely appeal to the Oracle of Omaha. In addition to banks, IYF targets exposure to the insurance sector, playing into the hands of Buffett&#8217;s affinity for insurance, which he has called the &#8220;engine&#8221; that has powered Berkshire Hathaway&#8217;s performance for decades. The IYF ETF boasts a lineup of colossal financial institutions like JPMorgan (NYSE: JPM), Bank of America (NYSE: BAC) and Wells Fargo (NYSE: WFC), offering investors access to stable banks renowned for their robust balance sheets. These titans of finance have a demonstrated history of navigating—and profiting through—evolving market cycles. This resilience can significantly benefit investors, especially when these institutions commit to enhancing shareholder value through activities like stock buybacks. Even in economic climates with elevated interest rates, banks often find an advantage, benefiting from higher loan rates for borrowers while simultaneously attracting savers with compelling yields. Investors have also been betting on the likelihood of lower interest rates, a phenomenon that could take hold as soon as July at the next Fed meeting. This optimism has benefited the iShares U.S. Financials ETF, sending the fund to revisit its 52-week high level of approximately $123 recently, offering investors an opportunity to potentially ride this wave in July. As of early July, the IYF ETF has delivered returns of 10.8%, nearly doubling the S&amp;P 500&#8217;s returns of 6.75% over the same stretch. Over the past year, this financials ETF boasts a total return of 19.5%, in line with its benchmark index, the Russell 1000 Financials 40 Act 15/22.5 Daily Capped Index (USD). With an expense ratio of 0.39%, investors won&#8217;t have to worry about having to overpay: If you invest $10,000 in IYF, you would pay approximately $39 in fees per year. Schwab U.S. Dividend Equity ETF (SCHD) Next up is the Schwab U.S. Dividend Equity ETF (SCHD). Not only does this ETF deliver consistent income, but one of its core components is yet another Warren Buffett favorite: Coca-Cola (NYSE: KO). The iconic beverage giant commands a 4.3% slice of the SCHD ETF, and remarkably, represents a whopping 9.7% of Berkshire Hathaway&#8217;s total portfolio. Within the SCHD ETF, Coca-Cola is joined by fellow dividend stalwarts like Verizon Communications (NYSE: VZ), Altria Group (NYSE: MO) and Lockheed Martin (NYSE: LMT). These companies have built reputations for consistently returning value to shareholders through robust dividends, making them almost a guaranteed fit for Buffett&#8217;s investing playbook. Their predictable cash flows and essential products underpin a long history of rewarding shareholders, a characteristic central to Buffett&#8217;s philosophy. While Buffett&#8217;s company, Berkshire Hathaway, isn&#8217;t a dividend-paying stock itself, that certainly doesn&#8217;t mean he discounts their power. Buffett has openly championed dividend-paying stocks as a shrewd strategy for investors on the hunt for steady income. Perhaps the most convincing evidence lies in Berkshire Hathaway&#8217;s top holding—Coca-Cola—a stock that diligently pays a dividend, which Buffett has no intentions of selling anytime soon. Its global brand power and consistent profitability make it a perpetual cash cow for Berkshire&#8217;s coffers. In early 2025, Coca-Cola announced its 63rd straight annual dividend hike, lifting its quarterly payout by 5.2% to $0.51 per share. Considering Buffett owns approximately 400 million shares of Coca-Cola stock, his company is effectively raking in over $800 million each year in dividend checks. Coca-Cola stock is also up 14.5% year-to-date, offering investors the added bonus of capital appreciation alongside their income. As for the broader Schwab U.S. Dividend Equity ETF, it meticulously tracks the total return of the Dow Jones U.S. Dividend 100 Index. With an incredibly modest expense ratio of just 0.060%, the SCHD ETF boasts over 100 holdings, granting shareholders a strong degree of diversification for protection. The fund’s underlying strategy prioritizes quality over quantity, avoiding risky high-yielding dividend stocks. Instead, it favors companies with long, proven track records of reliable payouts, offering investors a more reliable income stream and reduced volatility. This disciplined approach means even when the fund&#8217;s overall value experiences a dip, as it appears to have done in this wild 2025, investors still receive the benefit of earning consistent income through dividend distributions—which, Buffett seems to agree, is the ultimate icing on the cake for dividend stock investors anyway. Invesco QQQ Trust (QQQ) The Invesco QQQ Trust (QQQ) is a popular ETF known for its exposure to some high-flying technology stocks, including Apple (Nasdaq: AAPL) and Amazon (Nasdaq: AMZN). In fact, most of its top-10 holdings are technology stocks, with the exception of Costco Wholesale (Nasdaq: COST). While Warren Buffett isn&#8217;t known for his technology prowess, favoring instead businesses with more simple models, he has warmed up to the technology sector in recent years. Today, Apple and Amazon comprise 21.7% and 0.8% of Berkshire Hathaway&#8217;s portfolio, respectively. Apple is one of only a handful of Buffett&#8217;s technology stocks, which he began adding nearly a decade ago. The billionaire investor dove in head first with a $1 billion investment, making the iPhone maker one of the top holdings of Berkshire&#8217;s portfolio. Today Apple remains a key holding, with Berkshire&#8217;s investment worth over $64 billion. Buffett also bemoaned his hesitancy to add Amazon stock sooner than he did, kicking himself for for being &#8220;too dumb.&#8221; But he won&#8217;t make that mistake twice, and his AMZN holdings are now worth $2.2 billion in the Berkshire portfolio. Given their high-growth nature, the companies that make up the QQQ ETF are heavy capex spenders. While this strategy comes with an inherent amount of risk, which is the first group to be punished in challenging economic environments, the payoff can be equally as rewarding. And when it comes to capital appreciation, QQQ doesn&#8217;t disappoint. The QQQ ETF has delivered impressive long-term returns, outshining the S&amp;P 500 in seven out of the past 10 years. Investors who directed $10,000 invested in Invesco QQQ in 2020 would have seen their investment balloon to approximately $22,976 today. So far in 2025, QQQ posted a strong year-to-date gain of approximately 8%; at this pace, it will replicate last year&#8217;s returns of approximately 16%. Investors also receive a rather efficient expense ratio of just 0.20%, making it a cost-effective investment vehicle for access to Big Tech stocks, among other sector leaders. Investors with an appetite for risk and growth might find the QQQ appealing while also seizing the opportunity to hold a couple of Warren Buffett favorites.The post Here Are 3 ETFs Warren Buffett Would Approve Of for the Average Investor appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/07/here-are-3-etfs-warren-buffett-would-approve-of-for-the-average-investor-2/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-09T10:00:11-04:00",
    "date_et": "2025-07-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-09 11:01:18",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America (BAC) Earnings Expected to Grow: Should You Buy?",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-bac-earnings-expected-to-grow-should-20250709.jpg",
    "site": "zacks.com",
    "text": "Bank of America (BAC) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.",
    "url": "https://www.zacks.com/stock/news/2569182/bank-of-america-bac-earnings-expected-to-grow-should-you-buy?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_9-2569182",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-09T11:01:18-04:00",
    "date_et": "2025-07-09"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-10 10:00:19",
    "publisher": "Zacks Investment Research",
    "title": "Here is What to Know Beyond Why Bank of America Corporation (BAC) is a Trending Stock",
    "image": "https://images.financialmodelingprep.com/news/here-is-what-to-know-beyond-why-bank-of-20250710.jpg",
    "site": "zacks.com",
    "text": "Bank of America (BAC) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
    "url": "https://www.zacks.com/stock/news/2570959/here-is-what-to-know-beyond-why-bank-of-america-corporation-bac-is-a-trending-stock?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|most_searched_stocks-2570959",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-10T10:00:19-04:00",
    "date_et": "2025-07-10"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-10 10:26:11",
    "publisher": "Zacks Investment Research",
    "title": "BAC Shares Lag Peers in First Half: Can it Regain Momentum?",
    "image": "https://images.financialmodelingprep.com/news/bac-shares-lag-peers-in-first-half-can-it-20250710.jpg",
    "site": "zacks.com",
    "text": "Bank of America lags peers in 1H 2025 as investors weigh NII outlook, IB weakness and asset quality woes. Let's find out if the stock has any upside potential.",
    "url": "https://www.zacks.com/stock/news/2571048/bac-shares-lag-peers-in-first-half-can-it-regain-momentum?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2571048",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-10T10:26:11-04:00",
    "date_et": "2025-07-10"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-10 11:30:12",
    "publisher": "247 Wallst",
    "title": "US Private Credit Surges to Record $1.8 Trillion as BDCs Fill $350 Billion Financing Gap",
    "image": "https://images.financialmodelingprep.com/news/us-private-credit-surges-to-record-18-trillion-as-20250710.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points The bank consolidations caused by the 2008 subprime mortgage banking meltdown wound up favoring large corporations for ongoing business at the expense of smaller ones. The Business Development Company sector has filled the debt financing gap for small and medium sized businesses abandoned by the large banks after 2008. Due to BDC registration requirements for capital markets access, shareholders receive 90% of BDC profits, often resulting in double digit annual yields. It’s hard to believe, but today there are credit cards offering up to 6% cash back, $200 statement credits, $0 annual fees, travel rewards, and more. See for yourself, I couldn’t believe it at first. Frankly, with rewards this good we don’t expect them to be available forever. But if you sign up today you can secure some of the best rewards we’ve ever seen. Click here to get started. Prior to 2008, some of the more popular US banking institutions included: Lehman Brothers Bear Stearns Wachovia Bank Washington Mutual Merrill-Lynch IndyMac As depicted in the 2015 movie, The Long Short, the unsustainable subprime mortgage bubble wound up causing a banking industry meltdown. All of the banks in the list above despite decades of successful operations, were caught flatfooted and insolvent when the crash hit. The federal government was forced to trigger TARP (Troubled Asset Relief Program) which helped to shore up the balance sheets of the largest institutions. The leftover banks were steered towards the TARP recipients for acquisition, with Bear Stearns most notably being acquired by JP Morgan Chase at a fire-sale price of $2 per share. Unsurprisingly, turning around operations to remove red ink from balance sheets became the imperative of all of these new consolidated banks. For example, Brian Moynihan of Bank of America, which acquired Merrill-Lynch, issued a directive for brokers to close out accounts smaller than $200,000. An unforeseen casualty of the bank consolidations were the small and medium sized businesses that had been relying on the Washington Mutuals, et al. for their revolving credit lines, their inventory finance, and a panoply of other debt finance services. With millions of medium and small businesses suddenly stuck without financing options, Business Development Companies (BDCs) emerged to fill the gap, which has subsequently created a sizable standalone BDC category estimated to be over $350 billion and part of the larger $1.8 trillion private credit sector. As BDCs are registered with the SEC, they are treated comparably to REITs and thus, shareholders receive 90% of BDC profits. The five BDC examples below give a good example of the demand strength in the sector and the boost to entrepreneurship and business creation and the yields each offers investors. WhiteHorse Finance, Inc. WhiteHorse Finance has provided over $2.78 billion worth of financings since 2012, with a partiality to software companies. WhiteHorse Finance, Inc. (NASDAQ: WHF) Yield: 17.66% WhiteHorse Finance, Inc. is a Business Development Company that finances lower and mid-tier companies with growth capital in the form of senior secured notes or first lien notes. Headquartered in Miami, FL, WhiteHorse typically originates its debt underwritings in the $25 million to $50 million range for US companies in the $50 million to $350 million enterprise value category. It has deployed its $642 million portfolio to finance $2.78 billion across 260 transactions since going public in 2012. Goldman Sachs BDC, Inc. Investment banking behemoth Goldman Sachs has a BDC industry presence under its own moniker. Goldman Sachs BDC, Inc.(NYSE: GSBD) Yield: 14.13% The lucrative profits that well financed firms can avail themselves of in the BDC space have caused some of the aforementioned larger banks to get a foothold into it as well, after abandoning it years ago. Goldman Sachs is one of them. MSNBC’s Jim Cramer described Goldman Sachs recently as a firm with “a thirst that can’t be slaked without more deals.” Journalist Matt Taibbi dubbed Goldman Sachs, the prestigious (some would say nefarious) investment bank with the nickname, “Great Vampire Squid” due to it being “wrapped around the face of humanity, relentlessly jamming its blood funnel into anything that smells like money” and its omnipresent shadow on any financial platform where money can be made. The self-descriptive Goldman Sachs BDC, Inc. represents the Goldman Sachs BDC footprint. Stellus Capital Investment Corporation Orthotics producer Dr. Scholl&#8217;s is one of Stellus Capital Management&#8217;s 350+ financing clients. Stellus Capital Investment Corporation (NYSE: SCM) Yield: 11.47% Participating in both the private corporate debt and equity markets, Houston, TX headquartered Stellus Capital Investment Corp. finances deals for American and Canadian companies with EBITDA between $5 million and $50 million. With a $3.4 billion AUM warchest, Stellus has invested over $9.8 billion across 350+ investments since beginning over 20 years ago. The company currently has over 100 financings currently active. Carlyle Secured Lending, Inc. Carlyle Secured Lending is the BDC arm of Carlyle Group, best known for its financings in the aerospace and defense industries. Stock: Carlyle Secured Lending, Inc. (NASDAQ: CGBD) Yield: 12.93% Best known for its involvement with its aerospace and defense industry investments, NY based Carlyle Group has stakes in a number of other financial platforms. With a multi billion portfolio, Carlyle Secured Lending, Inc. is Carlyle Group’s entry into the BDC arena. Golub Capital BDC Inc. Small businesses and private credit financings that might be too small for most BDCs make up a sizable portion of Golub Capital&#8217;s clientele, and have helped it to earn its numerous awards. Golub Capital BDC Inc. (NASDAQ: GBDC) Yield: 10.65% Golub Capital BDC Inc. has an unbroken award winning decade-long streak in process, with its 2024 Lender of the Year win. In 2023, Golub Capital won all three Lender of the Year, Senior Lender of the Year, and BDC Manager of the Year in the Americas awards from Private Debt Investor (PDI), and has won 24 PDI awards since 2013. Its latest acknowledgement came this year from Newsweek, which listed Golub Capital BDC in its “America’s Greatest Midsize Workplaces” rankings. The post US Private Credit Surges to Record $1.8 Trillion as BDCs Fill $350 Billion Financing Gap appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/10/us-private-credit-surges-to-record-1-8-trillion-as-bdcs-fill-350-billion-financing-gap/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-10T11:30:12-04:00",
    "date_et": "2025-07-10"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-10 16:15:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America, N.A. Announces Redemptions of $2,000,000,000 5.650% Senior Bank Notes and $400,000,000 Floating Rate Senior Bank Notes, Due August 2025",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-na-announces-redemptions-of-2000000000-5650-20250710.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 10, 2025 /PRNewswire/ -- Bank of America, N.A.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-na-announces-redemptions-of-2-000-000-000-5-650-senior-bank-notes-and-400-000-000-floating-rate-senior-bank-notes-due-august-2025--302502781.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-10T16:15:00-04:00",
    "date_et": "2025-07-10"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-11 10:16:21",
    "publisher": "Zacks Investment Research",
    "title": "Unlocking Q2 Potential of Bank of America (BAC): Exploring Wall Street Estimates for Key Metrics",
    "image": "https://images.financialmodelingprep.com/news/unlocking-q2-potential-of-bank-of-america-bac-exploring-wall-20250711.jpg",
    "site": "zacks.com",
    "text": "Get a deeper insight into the potential performance of Bank of America (BAC) for the quarter ended June 2025 by going beyond Wall Street's top-and-bottom-line estimates and examining the estimates for some of its key metrics.",
    "url": "https://www.zacks.com/stock/news/2573448/unlocking-q2-potential-of-bank-of-america-bac-exploring-wall-street-estimates-for-key-metrics?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm_preview-2573448",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-11T10:16:21-04:00",
    "date_et": "2025-07-11"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-11 10:31:13",
    "publisher": "Zacks Investment Research",
    "title": "Why Bank of America (BAC) is a Top Stock for the Long-Term",
    "image": "https://images.financialmodelingprep.com/news/why-bank-of-america-bac-is-a-top-stock-20250711.jpg",
    "site": "zacks.com",
    "text": "Finding strong, market-beating stocks with a positive earnings outlook becomes easier with the Focus List, a top feature of the Zacks Premium portfolio service.",
    "url": "https://www.zacks.com/stock/news/2573534/why-bank-of-america-bac-is-a-top-stock-for-the-long-term?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|zacks_education_focus_list-2573534",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-11T10:31:13-04:00",
    "date_et": "2025-07-11"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-11 12:10:10",
    "publisher": "Zacks Investment Research",
    "title": "Pre-Markets Red on Trump's Tariff Threats to Canada",
    "image": "https://images.financialmodelingprep.com/news/premarkets-red-on-trumps-tariff-threats-to-canada-20250711.jpg",
    "site": "zacks.com",
    "text": "Pre-Markets Red on Trump's Tariff Threats to Canada.",
    "url": "https://www.zacks.com/stock/news/2573895/pre-markets-red-on-trump-s-tariff-threats-to-canada?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2573895",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-11T12:10:10-04:00",
    "date_et": "2025-07-11"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-14 08:57:33",
    "publisher": "Benzinga",
    "title": "How To Earn $500 A Month From Bank of America Stock Ahead Of Q2 Earnings",
    "image": "https://images.financialmodelingprep.com/news/how-to-earn-500-a-month-from-bank-of-20250714.jpg",
    "site": "benzinga.com",
    "text": "Bank of America Corporation BAC will release earnings results for the second quarter before the opening bell on Wednesday, July 16.",
    "url": "https://www.benzinga.com/trading-ideas/dividends/25/07/46390407/how-to-earn-500-a-month-from-bank-of-america-stock-ahead-of-q2-earnings-2",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-14T08:57:33-04:00",
    "date_et": "2025-07-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-14 10:21:04",
    "publisher": "Zacks Investment Research",
    "title": "Evaluating BAC's Growth Drivers and Risks Ahead of Q2 Earnings",
    "image": "https://images.financialmodelingprep.com/news/evaluating-bacs-growth-drivers-and-risks-ahead-of-q2-20250714.jpg",
    "site": "zacks.com",
    "text": "Bank of America, slated to report Q2 results on July 16, eyes stronger NII and trading gains, but faces pressure from weak IB fees and rising expenses.",
    "url": "https://www.zacks.com/stock/news/2579606/evaluating-bac-s-growth-drivers-and-risks-ahead-of-q2-earnings?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2579606",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-14T10:21:04-04:00",
    "date_et": "2025-07-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-14 12:05:17",
    "publisher": "Zacks Investment Research",
    "title": "Pre-Markets in the Red to Start a Fresh Week",
    "image": "https://images.financialmodelingprep.com/news/premarkets-in-the-red-to-start-a-fresh-week-20250714.jpg",
    "site": "zacks.com",
    "text": "Pre-market futures are notably lower than Friday afternoon's close on all major indexes, though they are beginning to climb out of the muck of fresh tariff threats as early trading warms up to start a new trading week. We had gotten back up to or near record market highs last week before new tariff threats from President Trump threw a damp towel over stock market heat.",
    "url": "https://www.zacks.com/stock/news/2580041/pre-markets-in-the-red-to-start-a-fresh-week?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2580041",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-14T12:05:17-04:00",
    "date_et": "2025-07-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-14 16:15:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America Announces Redemption of $2,000,000,000 4.827% Fixed/Floating Rate Senior Notes, Due July 2026",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-announces-redemption-of-2000000000-4827-fixedfloating-20250714.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 14, 2025 /PRNewswire/ -- Bank of America Corporation announced today that it will redeem on July 22, 2025 all $2,000,000,000 principal amount outstanding of its 4.827% Fixed/Floating Rate Senior Notes, due July 2026 (CUSIP No.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-announces-redemption-of-2-000-000-000-4-827-fixedfloating-rate-senior-notes-due-july-2026--302504408.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-14T16:15:00-04:00",
    "date_et": "2025-07-14"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-15 14:00:09",
    "publisher": "247 Wallst",
    "title": "These 5 ETFs (MSTY, QQQI, JEPQ, SPYI, DIVO) Are Reshaping Passive Income Portfolios",
    "image": "https://images.financialmodelingprep.com/news/these-5-etfs-msty-qqqi-jepq-spyi-divo-are-20250715.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points MSTY, QQQI, and JEPQ offer monthly cash distributions and exposure to top tech names. Meanwhile, SPYI and DIVO can help monthly payout seekers diversify beyond the tech sector. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) It wasn&#8217;t very long ago that passive income investors had to wait three full months before an exchange traded fund (ETF) would finally pay a dividend. Recently, however, an explosion in the number of ETFs has enabled more frequent cash distributions and powerful wealth-compounding possibilities. Five funds in particular are changing the ETF game with eye-catching yields and monthly cash payouts. Ambitious dividend harvesters can try out some of these funds or even, if they dare, buy all five of the following passive income ETF all-stars. MSTY, QQQI, and JEPQ for Tech Exposure All five of the ETFs featured today provide cash dividends/distributions each and every month. Yet, there are crucial differences between these funds, especially when it comes to their annual yields and risk profiles. To start off, I&#8217;ll direct your attention to an ETF that&#8217;s on the hotter end of the risk spectrum. I&#8217;m referring to the YieldMax MSTR Option Income Strategy ETF (NYSEARCA:MSTY), which generates some income from U.S. Treasury bonds but mainly relies on option-trading strategies. More specifically, the MSTY ETF uses synthetic covered call strategies (or possibly synthetic covered call spread strategies) to indirectly derive income from Microstrategy (NASDAQ:MSTR) stock. As you may be aware, Microstrategy is a technology firm that aggressively invests in Bitcoin (CRYPTO:BTC). Since Microstrategy stock can be quite volatile and option-trading strategies can be risky, the YieldMax MSTR Option Income Strategy ETF isn&#8217;t for the faint of heart. On the other hand, high risks can come with huge rewards as the MSTY ETF currently advertises a gigantic 72.93% annual distribution rate. While MSTY pays you every month and has an enormous annual yield, it&#8217;s not everybody&#8217;s cup of tea. Maybe you still want exposure to interesting technology companies but aren&#8217;t prepared to accept high risk. If so, then I&#8217;ve got two monthly-paying funds that emphasize the tech sector but aren&#8217;t overly volatile. The first one is the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI), which is centered around the tech-heavy NASDAQ 100 stock index. This fund uses options-trading strategies to squeeze income from a basket of approximately 100 stocks, including NVIDIA (NASDAQ:NVDA), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), Apple (NASDAQ:AAPL), and Broadcom (NASDAQ:AVGO). The NEOS NASDAQ-100 High Income ETF is reshaping portfolios by eliminating the need to pick individual tech stocks while also providing monthly income. In addition, QQQI&#8217;s 14.65% annual distribution rate will undoubtedly make it attractive to yield hunters. In a similar vein to QQQI, the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ) focuses on stocks in the NASDAQ 100. This fund collects income from 108 stocks that are mainly in the technology sector, and like MSTY and QQQI, the JEPQ ETF utilizes options-trading strategies. Thus, it shouldn&#8217;t be too surprising that the JPMorgan Nasdaq Equity Premium Income ETF enables portfolio exposure to technology titans like NVIDIA, Apple, Microsoft (NASDAQ:MSFT), Amazon, Broadcom, and Netflix (NASDAQ:NFLX). With a 12-month rolling dividend yield of 11.52%, the JEPQ ETF should impress any passive income enthusiast yearning for monthly wealth-building opportunities. SPYI and DIVO for Multi-Sector Diversification There&#8217;s no denying that audacious ETFs like MSTY, QQQI, and JEPQ are taking passive income investing to the next level. But then, you might prefer funds that venture beyond the technology sector while still paying out distributions each month. On that topic, I&#8217;ve got a pair of potent funds offering instant multi-sector diversification. One of them is the NEOS S&amp;P 500 High Income ETF (BATS:SPYI). Instead of sticking to the NASDAQ 100, the SPYI ETF concentrates on the S&amp;P 500 and has around 500 stocks in its holdings. This fund can quickly diversify your portfolio across a wide variety of stocks and sectors. Within the SPYI ETF, you&#8217;ll see large-cap standouts like Bank of America (NYSE:BAC), Home Depot (NYSE:HD), Coca-Cola (NYSE:KO), and Occidental Petroleum (NYSE:OXY). Like the other funds on this list, the NEOS S&amp;P 500 High Income ETF relies on options-trading strategies to produce income. After you discover that SPYI features monthly cash payouts and a 12.15% annual distribution rate, you may find it hard to resist taking a share position. Rounding out this five-pack of passive income boundary breakers is the Amplify CWP Enhanced Dividend Income ETF (NYSEARCA:DIVO), which derives income from dividends and options-trading strategies based on 24 stocks. Those 24 stocks aren&#8217;t all tech stocks, mind you. Sure, you&#8217;ll find Microsoft stock in the Amplify CWP Enhanced Dividend Income ETF&#8217;s holdings. However, you&#8217;ll also find non-tech-focused firms like Home Depot, Visa (NYSE:V), RTX/Raytheon Technologies (NYSE:RTX), Caterpillar (NYSE:CAT), and Goldman Sachs (NYSE:GS). Maybe DIVO&#8217;s 4.73% annual distribution rate isn&#8217;t as mind-blowing as the other funds I&#8217;m highlighting today. Nevertheless, the Amplify CWP Enhanced Dividend Income ETF&#8217;s diversified basket features some rock-solid companies and the fund&#8217;s monthly payouts will add up over the long run. As you can see, there are similarities but also important distinctions between MSTY, QQQI, JEPQ, SPYI, and DIVO. All five of these ETFs are altering the landscape of passive income investing so, if you&#8217;re ready, feel free to try them out today.The post These 5 ETFs (MSTY, QQQI, JEPQ, SPYI, DIVO) Are Reshaping Passive Income Portfolios appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/14/these-5-etfs-msty-qqqi-jepq-spyi-divo-are-reshaping-passive-income-portfolios/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-15T14:00:09-04:00",
    "date_et": "2025-07-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-15 15:35:41",
    "publisher": "CNBC Television",
    "title": "Regional bank consolidation will heat up soon, says Commerce Street CEO Dory Wiley",
    "image": "https://images.financialmodelingprep.com/news/regional-bank-consolidation-will-heat-up-soon-says-commerce-20250715.jpg",
    "site": "youtube.com",
    "text": "CNBC's \"Power Lunch\" team breaks down what is moving markets during the day's trading session, including bank earnings, and more with Jay Woods, chief global strategist at Freedom Capital Markets, and Dory Wiley, CEO and president of Commerce Street Holdings.",
    "url": "https://www.youtube.com/watch?v=GUh0MEQkRrA",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-15T15:35:41-04:00",
    "date_et": "2025-07-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-15 16:30:29",
    "publisher": "Fox Business",
    "title": "Outlook remains positive for all the banks, expert says",
    "image": "https://images.financialmodelingprep.com/news/outlook-remains-positive-for-all-the-banks-expert-says-20250715.jpg",
    "site": "youtube.com",
    "text": "RBC Capital Markets Managing Director Gerard Cassidy discusses bank performance and investor positioning on 'The Claman Countdown.'",
    "url": "https://www.youtube.com/watch?v=McdJ5d2LS28",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-15T16:30:29-04:00",
    "date_et": "2025-07-15"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 06:15:01",
    "publisher": "CNBC",
    "title": "Bank of America is about to report earnings – here's what to expect",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-is-about-to-report-earnings-heres-20250716.jpg",
    "site": "cnbc.com",
    "text": "Bank of America is likely to have benefited from tailwinds during the quarter. Analysts expect net interest income, which is the difference in what banks pay depositors and what they earn on loans and investments, to have risen in the period.",
    "url": "https://www.cnbc.com/2025/07/16/bank-of-america-bac-earnings-q2-2025.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T06:15:01-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 06:45:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America Reports Second Quarter 2025 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-reports-second-quarter-2025-financial-results-20250716.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 16, 2025 /PRNewswire/ -- Bank of America reported its second quarter 2025 financial results today.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-reports-second-quarter-2025-financial-results-302506677.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T06:45:00-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 06:45:00",
    "publisher": "The Motley Fool",
    "title": "10 No-Brainer Warren Buffett Stocks to Buy Right Now",
    "image": "https://images.financialmodelingprep.com/news/10-nobrainer-warren-buffett-stocks-to-buy-right-now-20250716.jpg",
    "site": "fool.com",
    "text": "Warren Buffett -- one of the most highly esteemed investors of all time, if not the most -- has been a consistent source of investing insights for decades. In addition to his numerous pearls of wisdom, the stock purchases Buffett makes through his conglomerate, Berkshire Hathaway, are also closely followed.",
    "url": "https://www.fool.com/investing/2025/07/16/10-no-brainer-warren-buffett-stocks-to-buy-right/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T06:45:00-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 06:48:00",
    "publisher": "Reuters",
    "title": "Bank of America profit rises on trading",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-profit-rises-on-trading-20250716.jpg",
    "site": "reuters.com",
    "text": "Bank of America's profit rose in the second quarter as its traders brought in more revenue from tumultuous markets in the second quarter, it said on Wednesday.",
    "url": "https://www.reuters.com/business/finance/bank-america-profit-rises-trading-2025-07-16/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T06:48:00-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 06:49:00",
    "publisher": "Market Watch",
    "title": "Bank of America's Q2 profit of 89 cents a share tops analyst estimate",
    "image": "https://images.financialmodelingprep.com/news/bank-of-americas-q2-profit-of-89-cents-a-20250716.jpg",
    "site": "marketwatch.com",
    "text": "Bank of America Corp. on Wednesday reported second-quarter earnings of 89 cents a share, ahead of the FactSet consensus estimate of 86 cents a share in what the bank described as a “solid” performance.",
    "url": "https://www.marketwatch.com/story/bank-of-americas-q2-profit-of-89-cents-a-share-tops-analyst-estimate-77cb9069",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T06:49:00-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 07:20:42",
    "publisher": "Investopedia",
    "title": "Bank of America Posts Better Profits, But Lower Revenue, Than Expected",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-posts-better-profits-but-lower-revenue-20250716.jpg",
    "site": "investopedia.com",
    "text": "Bank of America (BAC) on Wednesday reported better second-quarter profits than analysts had projected, while revenue and net interest income fell just short.",
    "url": "https://www.investopedia.com/bank-of-america-posts-better-profits-lower-revenue-than-expected-net-interest-income-11770342",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T07:20:42-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 08:05:54",
    "publisher": "Investopedia",
    "title": "5 Things to Know Before the Stock Market Opens",
    "image": "https://images.financialmodelingprep.com/news/5-things-to-know-before-the-stock-market-opens-20250716.jpg",
    "site": "investopedia.com",
    "text": "Stock futures were making small moves early Wednesday, with investors watched more big-bank earnings after Bank of America (BAC) reported mixed results; bitcoin (BTCUSD) rose after legislators vowed to move cryptocurrency legislation forward; chipmakers' shares pointed lower after ASML Holding (ASML) warned that growth could stall in 2026; Johnson & Johnson (JNJ) rose after it lifted its full-year guidance and reported better-than-expected quarterly results.",
    "url": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-july-16-2025-11773146",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T08:05:54-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 08:56:05",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America (BAC) Beats Q2 Earnings Estimates",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-bac-beats-q2-earnings-estimates-20250716.jpg",
    "site": "zacks.com",
    "text": "Bank of America (BAC) came out with quarterly earnings of $0.89 per share, beating the Zacks Consensus Estimate of $0.86 per share. This compares to earnings of $0.83 per share a year ago.",
    "url": "https://www.zacks.com/stock/news/2584985/bank-of-america-bac-beats-q2-earnings-estimates?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_4-2584985",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T08:56:05-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 09:36:41",
    "publisher": "Yahoo Finance",
    "title": "Nvidia, AMD, and how to play the AI trade, Bank of America earnings",
    "image": "https://images.financialmodelingprep.com/news/nvidia-amd-and-how-to-play-the-ai-trade-20250716.jpg",
    "site": "youtube.com",
    "text": "Morning Brief: Market Sunrise anchor Josh Schafer breaks down the latest international news for July 16, 2025. Nvidia says the Trump administration has provided assurances that the company will be able to resume H20 AI chip sales in China.",
    "url": "https://www.youtube.com/watch?v=9VxkCISR4dE",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T09:36:41-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 10:01:18",
    "publisher": "Proactive Investors",
    "title": "Bank of America posts mixed results for second quarter",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-posts-mixed-results-for-second-quarter-20250716.jpg",
    "site": "proactiveinvestors.com",
    "text": "Bank of America Corp (NYSE:BAC) posted a mixed earnings report for the second quarter, with profit ahead of expectations while revenue fell short. Profit was up 3% year-over-year at $7.12 billion or $0.89 per share, ahead of the consensus of $0.86.",
    "url": "https://www.proactiveinvestors.com/companies/news/1074853",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T10:01:18-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 10:31:33",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America (BAC) Reports Q2 Earnings: What Key Metrics Have to Say",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-bac-reports-q2-earnings-what-key-20250716.jpg",
    "site": "zacks.com",
    "text": "Although the revenue and EPS for Bank of America (BAC) give a sense of how its business performed in the quarter ended June 2025, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers.",
    "url": "https://www.zacks.com/stock/news/2585293/bank-of-america-bac-reports-q2-earnings-what-key-metrics-have-to-say?cid=CS-STOCKNEWSAPI-FT-fundamental_analysis|nfm-2585293",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T10:31:33-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:06:45",
    "publisher": "247 Wallst",
    "title": "How to Turn $500K into $40,000 in Annual Passive Income Without Losing Sleep",
    "image": "https://images.financialmodelingprep.com/news/how-to-turn-500k-into-40000-in-annual-passive-20250716.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points The QDVO ETF offers a high annual yield and exposure to famous large-cap stocks. Meanwhile, the RSPA ETF is widely diversified but also pays big dividends. It’s hard to believe, but today there are credit cards offering up to 6% cash back, $200 statement credits, $0 annual fees, travel rewards, and more. See for yourself, I couldn’t believe it at first. Frankly, with rewards this good we don’t expect them to be available forever. But if you sign up today you can secure some of the best rewards we’ve ever seen. Click here to get started. If you&#8217;ve managed to save up $500,000 to invest in stocks and exchange traded funds (ETFs), pat yourself on the back. You&#8217;re in a great position to earn tens of thousands of dollars in worry-free income each and every year. Two passive income powerhouses are particularly well-suited for investors seeking relatively safe dividends/distributions. With these two high-yield funds, you could generate $40,000 per year from a half-a-million-dollar account. So, let&#8217;s look at a pair of ETFs that could help you grow your fortune while you sleep soundly at night. QDVO: Tech Exposure, Decent Diversification It might sound risky to take $500,000 and equally divide it among just two funds. However, this plan can make sense if the two funds provide good diversification across well-known stocks. The first ETF that fits this description is the Amplify CWP Growth &amp; Income ETF (NYSEARCA:QDVO). This ETF generates income from dividends and premium payments from writing/selling call options. Since the Amplify CWP Growth &amp; Income ETF includes 42 stocks in its holdings, you&#8217;ll achieve diversification with just this one fund. Plus, you&#8217;ll get portfolio exposure to highly established technology giants like Microsoft (NASDAQ:MSFT), NVIDIA (NASDAQ:NVDA), Amazon (NASDAQ:AMZN), and Apple (NASDAQ:AAPL). While the Amplify CWP Growth &amp; Income ETF emphasizes large-cap technology stocks, it also includes non-tech names such as Visa (NYSE:V), Home Depot (NYSE:HD), Costco Wholesale (NASDAQ:COST), and RTX/Raytheon Technologies (NYSE:RTX). Consequently, your $500,000 portfolio won&#8217;t be too tech-heavy with the QDVO ETF. An added bonus of the Amplify CWP Growth &amp; Income ETF is that it pays out its dividends/distributions on a monthly basis. Hence, there&#8217;s no need to wait three full months to start seeing the cash show up in your account. Getting down to the nitty-gritty, the Amplify CWP Growth &amp; Income ETF offers an annual distribution rate of 9.87%, but also deducts 0.55% worth of operating expenses. This means that QDVO&#8217;s expected annualized net yield for investors would be 9.87% &#8211; 0.55%, or 9.32%. RSPA: High Yield, Hundreds of Famous Names Even though the the Amplify CWP Growth &amp; Income ETF has plenty of benefits, you don&#8217;t have to pour an entire $500,000 account into one fund. Instead, you could allocate $250,000 toward QDVO and the remaining $250,000 into the Invesco S&amp;P 500 Equal Weight Income Advantage ETF (NYSEARCA:RSPA). Generally based on the S&amp;P 500 index, the Invesco S&amp;P 500 Equal Weight Income Advantage ETF has 524 stocks in its holdings. Moreover, it&#8217;s not too heavily allocated toward technology or any other sector, as the RSPA ETF places roughly equal weighting on each stock. Within the Invesco S&amp;P 500 Equal Weight Income Advantage ETF you&#8217;ll find technology luminaries like Microsoft, Apple, and Micron Technology (NASDAQ:MU). Yet, you&#8217;ll also discover non-technology-focused firms such as PepsiCo (NASDAQ:PEP), Walmart (NYSE:WMT), Chevron (NYSE:CVX), and Bank of America (NYSE:BAC). Hence, you can massively diversify your portfolio with the Invesco S&amp;P 500 Equal Weight Income Advantage ETF and sleep all night long worry-free. Furthermore, there&#8217;s an added benefit with this fund because, like QDVO, RSPA pays out its distributions every month. The annual distribution rate for the Invesco S&amp;P 500 Equal Weight Income Advantage ETF is 9.13%, which is quite impressive. When we subtract the operating fees of 0.29% per year, the RSPA ETF should provide an expected net annual yield of 9.13% &#8211; 0.29%, or 8.84%. Getting $40,000 Each Year From Two ETFs Now, let&#8217;s do the math with these two terrific funds. For extra-wide diversification, you could put $250,000 into the Amplify CWP Growth &amp; Income ETF and another $250,000 into the Invesco S&amp;P 500 Equal Weight Income Advantage ETF. Then, your average expected net annual yield would be (9.32% + 8.84%) / 2, or 9.08%. Actually, your yield could be even higher if you reinvest the cash distributions every month, but let&#8217;s keep it simple and assume a 9.08% yield for now. After one year, assuming the two funds don&#8217;t reduce their distribution rates, you could expect to receive cash distributions totaling $500,000 x 9.08%, or $45,400. This allows some room for error, as it easily beats your goal of earning $40,000 in dividends/distributions. Of course, you should monitor the share prices of the two ETFs and not only the distribution rates. After all, you&#8217;ll want to see some share-price appreciation to further build your $500,000 nest egg. There&#8217;s no need to lose sleep over this issue, though, since the QDVO and RSPA ETFs should gain value over the long run. These two funds hold a variety of blue-chip stocks so you can rest easy while collecting $40,000 in cash every 12 months.The post How to Turn $500K into $40,000 in Annual Passive Income Without Losing Sleep appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/15/how-to-turn-500k-into-40000-in-annual-passive-income-without-losing-sleep/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:06:45-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:06:45",
    "publisher": "247 Wallst",
    "title": "Live: Goldman Sachs (NYSE: GS) & PNC Financial Services (NYSE: PNC) Earnings Coverage",
    "image": "https://images.financialmodelingprep.com/news/live-goldman-sachs-nyse-gs-pnc-financial-services-nyse-20250716.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Updates appear automatically as they are published. Goldman Sachs Results Are out 7:54 am by Eric Bleeker Need-to-Know Numbers: Revenue: $14.58 billion (tops estimates of $13.58 billion) EPS: $10.91 (tops estimates of $9.62) Goldman Sachs reported its second quarter 2025 earnings, revealing net revenues of $14.58 billion and net earnings of $3.72 billion. The diluted earnings per share (EPS) for the quarter was $10.91, a notable increase from $8.62 in the same quarter last year, but a decrease from $14.12 in the previous quarter. The firm also announced an increase in its quarterly dividend to $4.00 per common share, effective in the third quarter. The annualized return on average common shareholders’ equity was 12.8% for the quarter. The company&#8217;s book value per common share rose by 1.6% during the quarter to $349.74. Despite a slight decline in net revenues compared to the first quarter of 2025, Goldman Sachs showed a strong performance in its Global Banking &amp; Markets division, which saw a 24% increase in net revenues year-over-year. PNC Beats on NII 7:52 am by Eric Bleeker As we highlighted in the prior update, PNC beat on net interest income which is helping fuel its premarket gains. The stock is still up 1.8% in premarket trading. PNC Results 7:50 am by Eric Bleeker PNC Financial Services Group reported a net income of $1.6 billion for Q2 2025, translating to a diluted EPS of $3.85, surpassing the estimated EPS of $3.56. The company experienced a 4% increase in total revenue to $5.7 billion, driven by growth in both noninterest and net interest income. The net interest income rose by 2% to $3.6 billion, supported by loan growth and the repricing of fixed-rate assets. Noninterest income increased by 7% to $2.1 billion, with notable contributions from card and cash management revenue. PNC&#8217;s credit quality remained stable, with a provision for credit losses of $254 million. The company also increased its quarterly dividend by 10 cents to $1.70 per share. PNC maintained a strong capital position with a CET1 capital ratio of 10.5%. Still no Goldman Sachs Earnings / PNC Is Up 1.8% Premarket 7:45 am by Eric Bleeker Goldman Sachs has yet to release its earnings but PNC is up 1.8%. The company&#8217;s NII came in especially strong which is fueling early gains. How Did Goldman Sachs Perform in Q1? 07/15/2025 7:15 am by Eric Bleeker Here&#8217;s a summary of how Goldman Sachs performed in Q1. As we noted below, analysts are expecting $13.581 billion in sales and a normalized EPS of $9.62 this quarter. The Goldman Sachs Group, Inc. Q1&#8217;25 Earnings Highlights: • Adj. EPS: $14.12 ; UP +22% YoY • Revenue: $15.06B ; UP +9% YoY • Adj. Gross Margin: 60.6% ; DOWN -30 bps YoY • Net Income: $4.74B ; UP +15% YoY Q1 Segment Performance: • Global Banking &amp; Markets Revenue: $10.71B ; UP +10% YoY • Asset &amp; Wealth Management Revenue: $3.68B ; DOWN -3% YoY • Platform Solutions Revenue: $676M ; DOWN -3% YoY Other Key Q1 Metrics: • Adj. Operating Income: $5.65B ; UP +7% YoY • Adj. Operating Expenses: $9.13B ; UP +5% YoY • Provision for Credit Losses: $287M; DOWN -10% YoY • Effective Tax Rate: 16.1% (vs. 22.4% YoY) • Book Value Per Share: $344.20; UP +2.2% YoY • Common Share Repurchases: 7.1 million shares for $4.36B • Declared Quarterly Dividend Per Common Share: $3.00 • Average Global Core Liquid Assets: $441B CEO Commentary: &#8211; David Solomon: &#8220;Our strong results this quarter have demonstrated that in times of great uncertainty, clients turn to Goldman Sachs for execution and insight. While we are entering the second quarter with a markedly different operating environment than earlier this year, we remain confident in our ability to continue to support our clients.&#8221; Strategic Updates: &#8211; The Board approved a share repurchase program authorizing repurchases of up to $40 billion of common stock, reflecting the firm’s commitment to returning capital to shareholders. Earnings season kicked off yesterday with major banks like Wells Fargo (NYSE: WFC) and JPMorgan Chase (NYSE: JPM) reporting. Financial companies are front and center once again this morning. Bank of America (NYSE: BAC), Morgan Stanley (NYSE: MS), and M&amp;T Bank Corporation (NYSE: MTB) are some of the biggest names reporting before the bell. In this live blog, we&#8217;ll be analyzing this morning&#8217;s earnings release from Goldman Sachs (NYSE: GS) and PNC Financial Services (NYSE: PNC). PNC Financial Services Q2 Expectations Here&#8217;s the key figures PNC is expected to post when it reports shortly. All figures are sourced from S&amp;P Capital IQ: Revenue: $5.603 billion EPS (normalized): $3.56 Book Value/Share: $131.19 Net Income (GAAP): $1.423 billion Goldman Sachs Q2 Expectations Revenue: $13.581 billion EPS (normalized): $9.62 Book Value/Share: $348.02 Net Income (GAAP): $3.119 billion Conference Call Times Both Goldman Sachs and PNC Financial Services will host conference calls after their earnings release. Goldman Sachs conference call is expected to begin at about 9:30 a.m. ET. PNC Financial Services conference call is expected to start at 10:00 a.m. ET. The post Live: Goldman Sachs (NYSE: GS) &#038; PNC Financial Services (NYSE: PNC) Earnings Coverage appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/16/live-goldman-sachs-nyse-gs-pnc-financial-services-nyse-pnc-earnings-coverage/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:06:45-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:06:45",
    "publisher": "247 Wallst",
    "title": "Live Earnings Updates: Morgan Stanley (NYSE: MS) Earnings Release Before the Bell",
    "image": "https://images.financialmodelingprep.com/news/live-earnings-updates-morgan-stanley-nyse-ms-earnings-release-20250716.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Updates appear automatically as they are published. Upgrades and Downgrades for Bank Stocks 9:23 am Ticker Company Analyst Firm Rating (Unchanged) New Price Target (Old) Reasons C Citigroup Barclays Overweight $100 ($95) Q2 earnings beat estimates; NII ahead, though fees worse; pointed to 2025 revenues at high-end of guidance, offset by slight expense increase. C Citigroup Morgan Stanley Overweight $107 ($103) High-quality EPS beat; raised guidance; doubled share repurchases to at least $4B in Q3; expects 10% ROTCE in 2026. C Citigroup Piper Sandler Overweight $104 ($84) Increasing EPS estimates post-Q2; story checks all right boxes as a winner this quarter. JPM JPMorgan Morgan Stanley Equal Weight $298 ($296) Strong 11% EPS beat vs. consensus; raised NII guidance; highlighted potential uses of excess capital, including inorganic opportunities (high bar). BK BNY Mellon Morgan Stanley Overweight $101 ($95) 11% EPS beat driven by fees and NII; sixth straight quarter of positive operating leverage; early success in platform&#8217;s operating model. HWC Hancock Whitney Piper Sandler Overweight $72 ($70) Strong Q2 driven by ~6% LQA loan growth, enhanced asset quality, and strategic progress with Sabal Trust acquisition. NIC Nicolet Bankshares Piper Sandler Neutral $140 ($122.50) Q2 exceeded expectations via stronger NII (7% PPNR upside); impressive profitability (1.5%+ ROA, mid-teens ROTCE); outlook for low-to-mid-single digit growth, NIM expansion, efficiencies, benign credit. VBTX Veritex Holdings Piper Sandler Overweight Neutral Upside realized with market&#8217;s positive reaction to merger announcement with Huntington Bancshares (HBAN). A look at Banks pre-market 8:23 am JP Morgan (JPM): Up .18% Goldman Sachs (GS): Up 1.07% CitiGroup (C): Up .39% Bank of America (BAC): Up 1.11% Wells Fargo (WFC): Down .20% Morgan Stanley Q2 Numbers 7:42 am by Eric Bleeker Morgan Stanley Q2&#8217;25 Earnings Highlights: • Adj. EPS: $2.13 ; UP +17% YoY • Revenue: $16.8B ; UP +12% YoY • Adj. Gross Margin: 28.0% ; UP +100 bps YoY • Net Income: $3.5B ; UP +15% YoY Q2 Segment Performance: • Institutional Securities Revenue: $7.6B ; UP +9% YoY • Wealth Management Revenue: $7.8B ; UP +14% YoY • Investment Management Revenue: $1.6B ; UP +12% YoY Other Key Q2 Metrics: • Adj. Operating Income: $4.6B ; UP +13% YoY • Adj. Operating Expenses: $11.9B ; UP +10% YoY • Effective Tax Rate: 22.7% (vs. 23.5% YoY) • Book Value per Share: $61.59; UP +8% YoY • Tangible Book Value per Share: $47.25; UP +12% YoY • Return on Equity: 13.9%; UP +90 bps YoY • Return on Tangible Common Equity: 18.2%; UP +70 bps YoY • Compensation Expense: $7.2B; UP +11% YoY • Non-compensation Expenses: $4.8B; UP +9% YoY • Common Stock Repurchases: $1.0B • Number of Shares Repurchased: 8M • Average Price of Shares Repurchased: $123.22 CEO Commentary: &#8211; Ted Pick: &#8220;Morgan Stanley delivered another strong quarter. Six sequential quarters of consistent earnings – $2.02, $1.82, $1.88, $2.22, $2.60 and $2.13 – reflect higher levels of performance in different market environments. Institutional Securities saw strength and balance across businesses and geographies. Wealth continues to deliver, adding $59 billion of net new assets and $43 billion of fee-based flows. Total client assets across Wealth and Investment Management reached $8.2 trillion. We announced an increase of our quarterly common stock dividend to $1.00 per share with flexibility to deploy incremental capital. The management team is executing across the Integrated Firm, acting as a trusted advisor to clients and driving durable growth and long-term returns for our shareholders.&#8221; Strategic Updates: &#8211; The Board of Directors reauthorized a multi-year common equity share repurchase program of up to $20 billion, without a set expiration date, beginning in the third quarter of 2025. Earnings Are Out 7:39 am by Eric Bleeker Morgan Stanley earnings are out &#8211; second quarter EPS is $2.13. That&#8217;s above Wall Street expectations of $1.98. We will continue providing analysis in this live article. Still No Morgan Stanley Earnings 7:20 am by Eric Bleeker We still don&#8217;t have Morgan Stanley&#8217;s earnings out, but Bank of America&#8217;s have been released. The company beat on the bottom line but slightly missed on revenue. Shares are up 1.5% in premarket trading. Before Today&#039;s Earnings: A Look Back at Q1 7:00 am by Eric Bleeker With Morgan Stanley about to report its Q2 earnings, let&#8217;s look back at some key figures from their Q1 report. $MS | Morgan Stanley Q1&#8217;25 Earnings Highlights: • Adj. EPS: $2.60 • Revenue: $17.7B Q1 Segment Performance: • Institutional Securities Revenue: $9.0B ; UP +28% YoY • Wealth Management Revenue: $7.3B ; UP +15% YoY • Investment Management Revenue: $1.6B ; UP +16% YoY Other Key Q1 Metrics: • Effective Tax Rate: 21% (vs. 22% YoY) • CET1 Ratio: 15.3% CEO Commentary: &#8211; Edward N. Pick: &#8220;The Firm delivered a very strong quarter with $17.7 billion in revenue, $2.60 in EPS and a 23% return on tangible. Wealth added $94 billion of net new assets, bringing the Firm total to $7.7 trillion. Equities had a record $4 billion-plus quarter, which led to strong results across institutional securities. Morgan Stanley delivered returns while supporting clients, buying back stock opportunistically and building $2 billion of capital.&#8221; CFO Commentary: &#8211; Sharon Yeshaya: &#8220;The firm produced record revenues of $17.7 billion and EPS of $2.60 with a strong ROTCE of 23%. The results demonstrate the power of advice and supporting clients as the intermediary of capital across products and geographies, particularly during periods of uncertainty.&#8221; Strategic Updates: &#8211; The firm continues to invest in technology and automation to enhance operational efficiency and client service capabilities, while maintaining a disciplined approach to capital allocation amidst market volatility. Morgan Stanley (NYSE: MS) reports before the bell today. Large financial companies struggled yesterday. Stocks in the Financials sector declined 1.71%. Both Wells Fargo (NYSE: WFC) and BlackRock (NYSE: BLK) saw particularly steep declines after reporting earnings. Will Morgan Stanley plummet as well? We&#8217;ll be updating this live article with analysis after the company&#8217;s earnings drop. Let&#8217;s take a look at the need-to-know figures Wall Street is watching. Q2 Earnings Expectations Here are the key figures Wall Street is expecting when Morgan Stanley&#8217;s earnings release: Revenue: $16.02 billion EPS (Normalized): $1.98 Book Value/Share: $61.38 Net Income (GAAP): $3.14 Billion Key Areas to That Could Drive Today&#8217;s Performance What areas will determine whether Morgan Stanley&#8217;s stock rises or falls after today&#8217;s earnings release and conference call (scheduled for 8:30 a.m. ET). Wealth Management Margins: Last quarter normalized pre-tax margins for Wealth Management came in below their target (30 to 32%). With net interest income (NII) on the decline and exepnse pressures, any continued margin pressure in this unit could cause Morgan Stanley&#8217;s stock to sell off today. How Significant is NII Pressure: Wells Fargo shares fell yesterday on NII pressure and Morgan Stanley came in below many peers last quarter. If the company sees NII continue to trend down, it could be the primary area Wall Street focuses on today. Investment Banking Rebound: Investment banking was a bright spot in the first quarter. If Morgan Stanley speaks bullishly about its pipeline headed into the second half of the year and 2026, that could be a share price catalyst today. The post Live Earnings Updates: Morgan Stanley (NYSE: MS) Earnings Release Before the Bell appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/16/live-earnings-updates-morgan-stanley-nyse-ms-earnings-release-before-the-bell/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:06:45-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:06:45",
    "publisher": "247 Wallst",
    "title": "Live: Will Bank of America (NYSE: BAC) Soar After Earnings?",
    "image": "https://images.financialmodelingprep.com/news/live-will-bank-of-america-nyse-bac-soar-after-20250716.jpg",
    "site": "https://247wallst.com",
    "text": "Live Updates Live Coverage Updates appear automatically as they are published. Today&#039;s Wall Street Updates on Bank Stocks 9:20 am Ticker Company Analyst Firm Rating (Unchanged) New Price Target (Old) Reasons C Citigroup Barclays Overweight $100 ($95) Q2 earnings beat estimates; NII ahead, though fees worse; pointed to 2025 revenues at high-end of guidance, offset by slight expense increase. C Citigroup Morgan Stanley Overweight $107 ($103) High-quality EPS beat; raised guidance; doubled share repurchases to at least $4B in Q3; expects 10% ROTCE in 2026. C Citigroup Piper Sandler Overweight $104 ($84) Increasing EPS estimates post-Q2; story checks all right boxes as a winner this quarter. JPM JPMorgan Morgan Stanley Equal Weight $298 ($296) Strong 11% EPS beat vs. consensus; raised NII guidance; highlighted potential uses of excess capital, including inorganic opportunities (high bar). BK BNY Mellon Morgan Stanley Overweight $101 ($95) 11% EPS beat driven by fees and NII; sixth straight quarter of positive operating leverage; early success in platform&#8217;s operating model. HWC Hancock Whitney Piper Sandler Overweight $72 ($70) Strong Q2 driven by ~6% LQA loan growth, enhanced asset quality, and strategic progress with Sabal Trust acquisition. NIC Nicolet Bankshares Piper Sandler Neutral $140 ($122.50) Q2 exceeded expectations via stronger NII (7% PPNR upside); impressive profitability (1.5%+ ROA, mid-teens ROTCE); outlook for low-to-mid-single digit growth, NIM expansion, efficiencies, benign credit. VBTX Veritex Holdings Piper Sandler Overweight Neutral Upside realized with market&#8217;s positive reaction to merger announcement with Huntington Bancshares (HBAN). NII Projected to $15.5B to $15.7B by Q4 7:25 am by Eric Bleeker This banking earnings season has been dominated by how banks are guiding net interest income, and Bank of America guided to $15.5B to $15.7B in Q4. That will likely be a number that analysts focus on in the company&#8217;s conference call which starts shortly. The Two Numbers to Watch 7:16 am by Eric Bleeker Bank of America just delivered $.89 in adjusted EPS versus estimates of $.86. Revenue came in at $26.5 billion, which is slightly below expectations of $26.73 billion in revenue. Shares are initially up 1.45% in premarket trading. BAC Earnings Are Out 7:10 am by Eric Bleeker We&#8217;ll continue digging through the numbers but here are the main highlights. Bank of America Q2&#8217;25 Earnings Highlights • Adj. EPS: $0.89 ; UP +7% YoY • Revenue: $26.5B ; UP +4% YoY • Adj. Gross Margin: 55.4% ; UP +20 bps YoY • Net Income: $7.1B ; UP +3% YoY • Provision for Credit Losses: $1.6B; UP +7% YoY • Noninterest Expense: $17.2B; UP +5% YoY • Average Deposits: $1.97T; UP +3% YoY • Average Loans and Leases: $1.13T; UP +7% YoY • Return on Average Common Shareholders&#8217; Equity: 10.0% • Book Value per Common Share: $37.13; UP +8% YoY • Tangible Book Value per Common Share: $27.71; UP +9% YoY Outlook: • Revenue: $27.0B ±2% &#8211; The outlook reflects continued growth in net interest income driven by deposit growth and loan demand, despite potential headwinds from lower interest rates. &#8211; Management expects to maintain strong asset quality and capitalize on market opportunities in investment banking and trading. **Q2 Segment Performance:** • Consumer Banking Revenue: $10.8B ; UP +6% YoY • Global Wealth and Investment Management Revenue: $5.9B ; UP +7% YoY • Global Banking Revenue: $5.7B ; DOWN -6% YoY • Global Markets Revenue: $6.0B ; UP +10% YoY **Other Key Q2 Metrics:** • Adj. Operating Income: $9.3B; UP +2% YoY • Adj. Operating Expenses: $17.2B; UP +5% YoY • Effective Tax Rate: 7% (vs. 9% YoY) • Total Assets: $3.44T; UP +6% YoY • Total Deposits: $2.01T; UP +5% YoY • Total Loans and Leases: $1.15T; UP +9% YoY **CEO Commentary:** &#8211; Brian Moynihan: &#8220;We delivered another solid quarter, with earnings per share up seven percent from last year. Net interest income grew for the fourth straight quarter, reflecting eight consecutive quarters of deposit growth and seven percent year-over-year loan growth. Consumers remained resilient, with healthy spending and asset quality, and commercial borrower utilization rates rose. In addition, we saw good momentum in our markets businesses. So far this year, we have supplied more capital to our businesses and returned 40 percent more capital to shareholders in the first half of this year than last year.&#8221; **CFO Commentary:** &#8211; Alastair Borthwick: &#8220;We believe our second quarter results underscore the strength of our balance sheet and help demonstrate that we are well-positioned to support the broader economy. Asset quality remained strong, with net charge-offs at $1.5 billion for the sixth consecutive quarter. Consumer delinquencies have been stabilizing, while card net charge-offs improved year-over-year and commercial nonperforming loans declined sequentially. In addition, we delivered strong loan and deposit growth and maintained our disciplined pricing.&#8221; **Strategic Updates:** &#8211; Continued investment in technology and digital platforms to enhance customer experience and operational efficiency. The bank aims to leverage its digital capabilities to drive growth in consumer and small business segments. A Look Back at Bank of America&#039;s First Quarter 6:50 am by Eric Bleeker Before Bank of America reports its second-quarter earnings, let&#8217;s look back at how they fared in the prior quarter. Bank of America Q1&#8217;25 Earnings Highlights: • Adj. EPS: $0.90 ; UP +18% YoY • Revenue: $27.5B ; UP +6% YoY • Net Income: $7.4B ; UP +11% YoY • Return on Assets: 0.89%; UP +3 bps YoY • Return on Tangible Common Equity: 14%; UP +100 bps YoY • Deposits: Nearly $2 trillion; UP +8% from mid-2023 low Outlook: &#8211; Expectation for continued growth in net interest income (NII) driven by fixed-rate asset repricing and loan growth. &#8211; Anticipate stable deposit growth despite potential economic headwinds. Q1 Segment Performance: • Consumer Banking Revenue: $10.5B ; UP +3% YoY • Wealth Management Revenue: $6B ; UP +8% YoY • Global Banking Revenue: $6B ; Flat YoY • Global Markets Revenue: $5.6B ; UP +9% YoY Other Key Q1 Metrics: • Adj. Operating Expenses: $17.8B; UP +3% YoY • Effective Tax Rate: 9% (vs. 9% YoY) • Net Charge-Offs: $1.45B; Charge-Off Ratio: 54 bps • Provision Expense: $1.5B; Matches net charge-offs • Tangible Book Value per Share: $27.12; UP +9% YoY • Share Repurchases: $4.5B; Common Dividends: $2B CEO Commentary: &#8211; Brian Moynihan: &#8220;Given the recent events, we want to provide a clear picture of how well the fundamentals of the company performed to produce another good quarter of earnings in the first quarter of 2025. We saw good organic client activity, good growth in revenue and earnings, and we continue to invest in the future growth of our company.&#8221; CFO Commentary: &#8211; Alastair M. Borthwick: &#8220;We generated $7.4 billion in net income or $0.90 per diluted share this quarter, and that represents good growth over both last quarter and the year earlier period. Noninterest expense was $17.8 billion, up from the fourth quarter, driven by seasonally elevated payroll taxes and markets revenue-related costs of processing and incentives.&#8221; Strategic Updates: &#8211; Continued investment in commercial banking and wealth management to drive organic growth. &#8211; Focus on enhancing digital capabilities and customer engagement, with significant growth in digital interactions and sales. Bank of America (NYSE: BAC) is reporting earnings this morning and we&#8217;ll be updating this article with live analysis once results hit. Yesterday, companies like Wells Fargo (NYSE: WFC) and BlackRock (NYSE: BLK) reported earnings that broadly beat expectations, but still saw their shares fall. One reason for the drops: financial stocks have generally seen a strong 2025 year-to-date. Wells Fargo was up more than 18% headed into earnings, so poor interest income guidance was enough to sink the stock. Bank of America has lagged many of its peers, with &#8216;just&#8217; a 4% return year-to-date. So, the stock may be able to see stronger performance if its results top Wall Street expectations. What Wall Street Expects When Bank of America Reports Here are the key figures to watch when Bank of America reports shortly: Revenue: $26.73 billion EPS (Normalized): $.86 Net Income (GAAP): $6.51 billion Book Value/Share: $36.85 3 Key Areas to Watch in Bank of America&#8217;s Conference Call Bank of America is hosting its conference call at 8 a.m. ET. Here are some key areas Wall Street will be watching: Net Interest Income Pressure: Wells Fargo&#8217;s shares fell today on NII pressure. It&#8217;s likely that Wall Street will be zeroed in on how much lower short-term rates could impact Bank of America&#8217;s net interest in the second half of the year. Revenue Growth and Expense Management: With sluggish growth projected in 2025, Bank of America can continue to grow profitability by keeping expense management in check and growing operating leverage. Investment Banking Trends: Bank of America saw stronger investment banking business last quarter. Was the bounce temporary or the beginning of sustained growth in the division? The post Live: Will Bank of America (NYSE: BAC) Soar After Earnings? appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/16/live-will-bank-of-america-nyse-bac-soar-after-earnings/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:06:45-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:19:35",
    "publisher": "Benzinga",
    "title": "US Stocks Mixed; Bank of America Earnings Top Views",
    "image": "https://images.financialmodelingprep.com/news/us-stocks-mixed-bank-of-america-earnings-top-views-20250716.jpg",
    "site": "benzinga.com",
    "text": "U.S. stocks traded mixed this morning, with the Nasdaq falling around 0.1% on Wednesday.",
    "url": "https://www.benzinga.com/markets/market-summary/25/07/46446288/us-stocks-mixed-bank-of-america-earnings-top-views",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:19:35-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 11:29:58",
    "publisher": "Benzinga",
    "title": "Bank Of America Contradicts Consumer Weakness, Stock Buying On PPI, Important Semiconductor Data",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-contradicts-consumer-weakness-stock-buying-on-20250716.jpg",
    "site": "benzinga.com",
    "text": "To gain an edge, this is what you need to know today.",
    "url": "https://www.benzinga.com/markets/equities/25/07/46446650/bank-of-america-contradicts-consumer-weakness-stock-buying-on-ppi-important-semiconductor-data",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T11:29:58-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 12:11:08",
    "publisher": "Zacks Investment Research",
    "title": "BAC Q2 Earnings Beat on Robust Trading & NII Growth, Stock Rises",
    "image": "https://images.financialmodelingprep.com/news/bac-q2-earnings-beat-on-robust-trading-nii-growth-20250716.jpg",
    "site": "zacks.com",
    "text": "Bank of America posts strong Q2 results with EPS of 89 cents, fueled by trading gains and NII growth.",
    "url": "https://www.zacks.com/stock/news/2585986/bac-q2-earnings-beat-on-robust-trading-nii-growth-stock-rises?cid=CS-STOCKNEWSAPI-FT-analyst_blog|earnings_article-2585986",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T12:11:08-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 12:21:04",
    "publisher": "Zacks Investment Research",
    "title": "PPI Remained Unchanged",
    "image": "https://images.financialmodelingprep.com/news/ppi-remained-unchanged-20250716.jpg",
    "site": "zacks.com",
    "text": "Pre-market futures are climbing into the green this morning, following a cooler-than-expected wholesale inflation report and better-than-expected financial Q2 earnings numbers out before the bell today. After starting off roughly -0.1% across the board, we're currently up +160 points on the Dow, +13 points on the S&P 500 and +14 on the Nasdaq.",
    "url": "https://www.zacks.com/stock/news/2585840/ppi-remained-unchanged?cid=CS-STOCKNEWSAPI-FT-economic_highlights-2585840",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T12:21:04-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 12:58:19",
    "publisher": "PYMNTS",
    "title": "Bank of America Says ‘Resilient' Consumers Help Boost Revenue",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-says-resilient-consumers-help-boost-revenue-20250716.jpg",
    "site": "pymnts.com",
    "text": "Healthy consumer spending helped buoy Bank of America's revenues in the second quarter. The banking giant reported quarterly earnings Wednesday (July 16) showing a consumer banking revenue of $10.8 billion, a 6% increase.",
    "url": "https://www.pymnts.com/news/banking/2025/bank-of-america-says-resilient-consumers-help-boost-revenue/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T12:58:19-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 13:02:55",
    "publisher": "Benzinga",
    "title": "Bank Of America's Q2 Results 'Better Than Feared', Says Analyst",
    "image": "https://images.financialmodelingprep.com/news/bank-of-americas-q2-results-better-than-feared-says-20250716.jpg",
    "site": "benzinga.com",
    "text": "Bank of America Corp. BAC delivered second-quarter fiscal 2025 results that largely surpassed expectations, with reported earnings per share aligning with consensus estimates.",
    "url": "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/07/46449955/bank-of-americas-q2-results-better-than-feared-says-analyst",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T13:02:55-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 13:22:55",
    "publisher": "The Motley Fool",
    "title": "Bank of America Posts Record Q2 Results",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-posts-record-q2-results-20250716.jpg",
    "site": "fool.com",
    "text": "Bank of America Corporation (BAC -1.10%) reported its Q2 2025 earnings on July 16, 2025, posting $26.6 billion in revenue (+4% year-over-year), $7.1 billion in net income, and $0.89 EPS (+7% year-over-year), accompanied by record quarterly net interest income (NII) of $14.8 billion (+7%).",
    "url": "https://www.fool.com/data-news/2025/07/16/bank-of-america-posts-record-q2-results/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T13:22:55-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 13:25:13",
    "publisher": "The Motley Fool",
    "title": "Bank of America: 8% Dividend Hike in Q2",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-8-dividend-hike-in-q2-20250716.jpg",
    "site": "fool.com",
    "text": "Bank of America (BAC -1.19%), the U.S. banking giant known for its vast retail, commercial, and investment banking operations, released its Q2 2025 earnings on July 16, 2025. The highlight of the announcement was earnings per share of $0.89 (GAAP), beating analyst expectations of $0.86 (GAAP).",
    "url": "https://www.fool.com/data-news/2025/07/16/bank-of-america-8-dividend-hike-in-q2/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T13:25:13-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 13:30:00",
    "publisher": "Seeking Alpha",
    "title": "Tariffs Reignited: Best Stocks To Buy Now",
    "image": "https://images.financialmodelingprep.com/news/tariffs-reignited-best-stocks-to-buy-now-20250716.jpg",
    "site": "seekingalpha.com",
    "text": "Aug. 1 tariff deadlines and a potential firing of Fed Chair Powell, according to reports, are reintroducing uncertainty for the markets, which have been volatile in both directions, despite major US indices notching new peaks. But who will bear the brunt of tariff increases? New tariff threats on the EU, Canada, and Mexico could impact consumer spending, which accounts for roughly two-thirds of US GDP. The recent passage of Trump's tax bill could boost consumer spending in the US, help incentivize companies to bring back profits held overseas, and aid job creation in the US.",
    "url": "https://seekingalpha.com/article/4801688-tariffs-reignited-best-stocks-to-buy-now",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T13:30:00-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 14:31:15",
    "publisher": "CNBC Television",
    "title": "A stable central bank is important to the U.S., says Bank of America CEO Brian Moynihan",
    "image": "https://images.financialmodelingprep.com/news/a-stable-central-bank-is-important-to-the-us-20250716.jpg",
    "site": "youtube.com",
    "text": "CNBC's Leslie Picker with Bank of America CEO Brian Moynihan, join 'The Exchange' to discuss the banks quarterly results, Fed independence and his interest rate outlook.",
    "url": "https://www.youtube.com/watch?v=2oUOuc7Fkmw",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T14:31:15-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 15:15:38",
    "publisher": "Bloomberg Markets and Finance",
    "title": "Bank of America's Moynihan on US Consumers, Fed Policy and AI",
    "image": "https://images.financialmodelingprep.com/news/bank-of-americas-moynihan-on-us-consumers-fed-policy-and-20250716.jpg",
    "site": "youtube.com",
    "text": "Bank of America Chair and CEO Brian Moynihan discusses the state of the US consumer, Federal Reserve monetary policy and the bank's second-quarter earnings. Speaking with David Westin on Bloomberg Television, Moynihan also discusses the bank's utilization of artificial intelligence.",
    "url": "https://www.youtube.com/watch?v=IgGqVO5xRk0",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T15:15:38-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 16:07:03",
    "publisher": "247 Wallst",
    "title": "Retiring in 3 Years and Need $5,000/Month—Here’s the Portfolio to Build Now",
    "image": "https://images.financialmodelingprep.com/news/retiring-in-3-years-and-need-5000monthheres-the-portfolio-20250716.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points You can use diversified ETFs (QQQI, SPYI) to generate the bulk of your passive income in retirement. To boost your monthly income potential, try a few high-yield funds that focus on single stocks (APLY, GOOY, AMZY, NVDY). It’s hard to believe, but today there are credit cards offering up to 6% cash back, $200 statement credits, $0 annual fees, travel rewards, and more. See for yourself, I couldn’t believe it at first. Frankly, with rewards this good we don’t expect them to be available forever. But if you sign up today you can secure some of the best rewards we’ve ever seen. Click here to get started. Retirement is almost here? No need to fear! Even if your monthly goal of earning $5,000 in dividends starts in just three months, it&#8217;s possible to achieve this by carefully investing in high-yield exchange traded funds (ETFs). To get dividends/distributions totaling $5,000 per month or $60,000 per year, you can use a combination of diversified income-producing ETFs and single-stock-focused funds. Assuming you&#8217;ll have saved up $500,000 for retirement three years from now, you will need to achieve a 12% average annual yield to get $60,000 worth of income per year. The plan is to allocate 80% of your investable capital toward a pair a diversified ETFs that offer annual yields of around 12% to 15%. Then, to put you decisively above the $5,000-per-month threshold, you could invest the remaining 20% of your retirement funds in a few ETFs that derive high yields from single stocks. So, let&#8217;s dive right in and see how this powerful plan works. 2 Diversified ETFs With High Yields The first part of the plan is to devote 80% of your investable retirement savings toward two diversified ETFs. More specifically you can allocate 40% of your capital toward the NEOS NASDAQ-100 High Income ETF (NASDAQ:QQQI) and other 40% toward the NEOS S&amp;P 500 High Income ETF (BATS:SPYI). To earn passive income of $5,000 per month when you retire in three years, you&#8217;ll need to achieve at least 12% average annual yield on a $500,000 investment. The NEOS NASDAQ-100 High Income ETF exceeds the 12% objective with an annual distribution rate of 14.65%. You&#8217;ll end up paying annualized operating fees of 0.68%, but even after subtracting that, QQQI&#8217;s yield would still be above 12%. There&#8217;s still the question of whether this is safe yield, though. I would assess the NEOS NASDAQ-100 High Income ETF as reasonably safe because this diversified fund invests in approximately 100 well-known technology firms. Based on the NASDAQ 100 index, the QQQI ETF&#8217;s holdings include tech leaders like Apple (NASDAQ:AAPL), NVIDIA (NASDAQ:NVDA), Broadcom (NASDAQ:AVGO), and Meta Platforms (NASDAQ:META). Furthermore, the NEOS NASDAQ-100 High Income ETF pays out its cash distributions each and every month. Consequently, you may be able to take advantage of the compounding effect by reinvesting the distributions. For even more diversification, you can match your QQQI allocation with an equal-sized investment in the NEOS S&amp;P 500 High Income ETF. Centered around the prestigious S&amp;P 500 large-cap stock index, the SPYI ETF includes around 500 stocks in its list of holdings. You&#8217;ll probably recognize many of the names on that holdings list, such as Coca-Cola (NYSE:KO), Bank of America (NYSE:BAC), Occidental Petroleum (NYSE:OXY), and Home Depot (NYSE:HD). Since the fund includes so many famous names across multiple market sectors, you can invest in the NEOS S&amp;P 500 High Income ETF with confidence. Like QQQI, the SPYI ETF pays its distributions on a monthly basis, so that&#8217;s a nice benefit. Will the NEOS S&amp;P 500 High Income ETF achieve a 12% yield, though? The fund currently advertises an annual distribution rate of 12.15%, but you&#8217;ll have to pay operating fees totaling 0.68%. Remember, though, that you can invest equally in the NEOS NASDAQ-100 High Income ETF and the NEOS S&amp;P 500 High Income ETF. That way, you should average 12% yield or more (assuming there are no distribution cuts) with 80% of your portfolio. Boost Your Yield With Single-Stock Funds Just to make sure that you&#8217;ll achieve at least $5,000 of monthly passive income, you can dedicate the remaining 20% of your portfolio toward a handful of single-stock funds. These ETFs are riskier because they&#8217;re not diversified, but their annual yields are quite impressive. I&#8217;m referring to four ETFs which all pay their distributions on a monthly basis. You can go here for detailed explanation of the four funds, but I&#8217;ll provide a quick summary right now. The YieldMax AAPL Option Income Strategy ETF (NYSEARCA:APLY) indirectly derives income from Apple stock. It advertises an annual distribution rate of 26.97% but you&#8217;ll have to deduct operating expenses of 1.06%. That still leaves you with an expected net yield of 26.97% &#8211; 1.06%, or 25.91%, which is nothing to sneeze at. Here are three similar ETFs to consider: The YieldMax GOOGL Option Income Strategy ETF (NYSEARCA:GOOY); based on the stock of Google parent company Alphabet (NASDAQ:GOOGL); annual distribution rate of 33.14% &#8211; 1.2% worth of operating expenses = expected net yield of 31.94%. The YieldMax AMZN Option Income Strategy ETF (NYSEARCA:AMZY); based on Amazon (NASDAQ:AMZN) stock; annual distribution rate of 47.52% &#8211; 1.17% worth of operating expenses = expected net yield of 46.35%. The YieldMax NVDA Option Income Strategy ETF (NYSEARCA:NVDY); based on NVIDIA stock; annual distribution rate of 50.19% &#8211; 1.27% worth of operating expenses = expected net yield of 48.92%. Balancing Safety and Risk Since they involve more risk, you wouldn&#8217;t want to invest too much of your retirement money in APLY, GOOY, AMZY, and NVDY. However, it&#8217;s not excessive to allocate 5% toward each ETF for a total of 20%. After all, these are four gigantic technology firms and the huge yields will quickly boost your portfolio&#8217;s total yield above 12%. Besides, 80% of your investment account would be invested in the NEOS S&amp;P 500 High Income ETF and the NEOS S&amp;P 500 High Income ETF, which are safer because they&#8217;re more diversified. If you get started today, you can use these ETFs to build a safety-and-risk-balanced retirement portfolio generating $5,000 per month or more.The post Retiring in 3 Years and Need $5,000/Month—Here’s the Portfolio to Build Now appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/16/retiring-in-3-years-and-need-5000-month-heres-the-portfolio-to-build-now/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T16:07:03-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 18:45:38",
    "publisher": "Investopedia",
    "title": "BofA Is Looking for ‘Legal Clarity,' as It Explores Stablecoin Initiatives, CEO Says",
    "image": "https://images.financialmodelingprep.com/news/bofa-is-looking-for-legal-clarity-as-it-explores-20250716.jpg",
    "site": "investopedia.com",
    "text": "Bank of America (BAC) CEO Brian Moynihan on Wednesday said the bank is exploring stablecoin intiatives, as Congress considers a bill that would allow private companies to issue their own.",
    "url": "https://www.investopedia.com/bofa-is-looking-for-legal-clarity-as-it-explores-stablecoin-initiatives-ceo-says-11773695",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T18:45:38-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 21:16:38",
    "publisher": "Zacks Investment Research",
    "title": "Q2 Earnings Season Kicks Off Positively: A Closer Look",
    "image": "https://images.financialmodelingprep.com/news/q2-earnings-season-kicks-off-positively-a-closer-look-20250716.jpg",
    "site": "zacks.com",
    "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>",
    "url": "https://www.zacks.com/commentary/2586972/q2-earnings-season-kicks-off-positively-a-closer-look?cid=CS-STOCKNEWSAPI-FT-earnings_outlook-2586972",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T21:16:38-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-16 21:21:04",
    "publisher": "Zacks Investment Research",
    "title": "Q2 Earnings Season Kicks Off Positively: A Closer Look",
    "image": "https://images.financialmodelingprep.com/news/q2-earnings-season-kicks-off-positively-a-closer-look-20250716.jpg",
    "site": "zacks.com",
    "text": "Note: The following is an excerpt from this week's Earnings Trends report. You can access the full report that contains detailed historical actual and estimates for the current and following periods, please click here>>>",
    "url": "https://www.zacks.com/commentary/2586943/q2-earnings-season-kicks-off-positively-a-closer-look?cid=CS-STOCKNEWSAPI-FT-earnings_trends-2586943",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-16T21:21:04-04:00",
    "date_et": "2025-07-16"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 01:37:07",
    "publisher": "Seeking Alpha",
    "title": "Bank of America Corporation (BAC) Q2 2025 Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-corporation-bac-q2-2025-earnings-call-transcript-20250717.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America Corporation (NYSE:BAC ) Q2 2025 Earnings Conference Call July 16, 2025 8:00 AM ET Company Participants Alastair M. Borthwick - Chief Financial Officer Brian Thomas Moynihan - Chairman, CEO & President E.",
    "url": "https://seekingalpha.com/article/4801795-bank-of-america-corporation-bac-q2-2025-earnings-call-transcript",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T01:37:07-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 06:00:00",
    "publisher": "The Motley Fool",
    "title": "Here Are My Top 2 Buffett Stocks to Buy Now",
    "image": "https://images.financialmodelingprep.com/news/here-are-my-top-2-buffett-stocks-to-buy-20250717.jpg",
    "site": "fool.com",
    "text": "The market is rebounding after plunging earlier this year, continuing its bull run and reaching new highs. Legendary investor Warren Buffett has made it clear many times what he thinks about bull markets: He's a contrarian investor who prefers to buy stocks when they're in bargain territory.",
    "url": "https://www.fool.com/investing/2025/07/17/here-are-my-top-x-industrycategory-stocks-to-buy-n/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T06:00:00-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 06:55:00",
    "publisher": "Seeking Alpha",
    "title": "Two Quality Stocks Whose Price Declines May Be Long-Term Buying Opportunities",
    "image": "https://images.financialmodelingprep.com/news/two-quality-stocks-whose-price-declines-may-be-longterm-buying-20250717.jpg",
    "site": "seekingalpha.com",
    "text": "Recent stock price pullbacks in two companies present potential buying opportunities for long-term investors, despite no obvious negative news. I emphasize the importance of distinguishing between temporary dips and fundamental business issues, referencing Warren Buffett's advice. T-Mobile's pullback offers a buying opportunity due to strong earnings growth, robust free cash flow, aggressive buybacks, and double-digit dividend increases.",
    "url": "https://seekingalpha.com/article/4801334-two-quality-stocks-price-declines-long-term-buying-opportunities",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T06:55:00-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 09:36:59",
    "publisher": "CNBC Television",
    "title": "Bank of America CEO Brian Moynihan on interest rates",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-ceo-brian-moynihan-on-interest-rates-20250717.jpg",
    "site": "youtube.com",
    "text": "Bank of America CEO Brian Moynihan on Wednesday said higher interest rates on small- and medium-size businesses have slowed down economic activity even as unemployment remains below 4% and the inflation rate has fallen.",
    "url": "https://www.youtube.com/shorts/lec0TpgHhKw",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T09:36:59-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 09:51:08",
    "publisher": "Zacks Investment Research",
    "title": "Why Investors Need to Take Advantage of These 2 Finance Stocks Now",
    "image": "https://images.financialmodelingprep.com/news/why-investors-need-to-take-advantage-of-these-2-20250717.jpg",
    "site": "zacks.com",
    "text": "Finding stocks expected to beat quarterly earnings estimates becomes an easier task with our Zacks Earnings ESP.",
    "url": "https://www.zacks.com/stock/news/2588183/why-investors-need-to-take-advantage-of-these-2-finance-stocks-now?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|zacks_education_earnings_esp-2588183",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T09:51:08-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-17 10:01:30",
    "publisher": "CNBC Television",
    "title": "Bank of America CEO Brian Moynihan: Fed independence is critical for the economy",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-ceo-brian-moynihan-fed-independence-is-20250717.jpg",
    "site": "youtube.com",
    "text": "Bank of America CEO Brian Moynihan on Wednesday said an independent Federal Reserve is \"critical to the operating of a great global economy like the United States.\"",
    "url": "https://www.youtube.com/shorts/urmWaHfBRXw",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-17T10:01:30-04:00",
    "date_et": "2025-07-17"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-18 03:51:00",
    "publisher": "The Motley Fool",
    "title": "58% of Warren Buffett's $292 Billion Portfolio Is Being Wagered on 4 Unstoppable Stocks",
    "image": "https://images.financialmodelingprep.com/news/58-of-warren-buffetts-292-billion-portfolio-is-being-20250718.jpg",
    "site": "fool.com",
    "text": "There isn't a money manager on Wall Street who commands more attention than Berkshire Hathaway (BRK.A 0.30%) (BRK.B 0.59%) CEO Warren Buffett -- and there's a good reason why.",
    "url": "https://www.fool.com/investing/2025/07/18/58-warren-buffett-portfolio-invested-in-4-stocks/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-18T03:51:00-04:00",
    "date_et": "2025-07-18"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-18 12:41:56",
    "publisher": "Invezz",
    "title": "Bank of America reveals trades investors can do if Trump fires Jerome Powell",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-reveals-trades-investors-can-do-if-20250718.jpg",
    "site": "invezz.com",
    "text": "Bank of America pointed out trade setups investors can do if US President Donald Trump fires US Federal Reserve Chair Jerome Powell. The long-simmering tensions between Trump and Powell reached a new level this week, with reports suggesting Trump had moved closer to attempting Powell's removal.",
    "url": "https://invezz.com/news/2025/07/18/bank-of-america-reveals-trades-investors-can-do-if-trump-fires-jerome-powell/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-18T12:41:56-04:00",
    "date_et": "2025-07-18"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-18 12:46:11",
    "publisher": "Zacks Investment Research",
    "title": "Are You Looking for a High-Growth Dividend Stock?",
    "image": "https://images.financialmodelingprep.com/news/are-you-looking-for-a-highgrowth-dividend-stock-20250718.jpg",
    "site": "zacks.com",
    "text": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Bank of America (BAC) have what it takes?",
    "url": "https://www.zacks.com/stock/news/2592181/are-you-looking-for-a-high-growth-dividend-stock?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|yseop_template_5-2592181",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-18T12:46:11-04:00",
    "date_et": "2025-07-18"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-18 16:15:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America Declares Preferred Stock Dividends Payable in August and September 2025",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-declares-preferred-stock-dividends-payable-in-20250718.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 18, 2025 /PRNewswire/ -- Bank of America Corporation today announced the Board of Directors has authorized regular cash dividends on the outstanding shares or depositary shares of the following series of preferred stock:  Series of Preferred Stock Dividend per Share or Depositary Share 1 Record Date Payment Date Floating Rate Non-Cumulative Preferred Stock, Series E $0.31548 July 31 August 15 Floating Rate Non-Cumulative Preferred Stock, Series F $1,272.68711 August 29 September 15 Adjustable Rate Non-Cumulative Preferred Stock, Series G $1,272.68711 August 29 September 15 Floating Rate Non-Cumulative Preferred Stock, Series 1 $0.33385 August 15 August 28 Floating Rate Non-Cumulative Preferred Stock, Series 2 $0.33488 August 15 August 28 Floating Rate Non-Cumulative Preferred Stock, Series 4 $0.34127 August 15 August 28 Floating Rate Non-Cumulative Preferred Stock, Series 5 $0.32475 August 1 August 21 Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series DD $31.50000 August 15 September 10 Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series FF $29.3750000 September 1 September 15 6.000% Non-Cumulative Preferred Stock, Series GG $0.3750000 August 1 August 18 5.375% Non-Cumulative Preferred Stock, Series KK $0.3359375 September 1 September 25 5.000% Non-Cumulative Preferred Stock, Series LL $0.3125000 September 1 September 17 4.250% Non-Cumulative Preferred Stock, Series QQ $0.2656250 August 1 August 18 4.750% Non-Cumulative Preferred Stock, Series SS $0.2968750 August 1 August 18 1  Each series of preferred stock, other than Series F and Series G, is represented by depositary shares.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-declares-preferred-stock-dividends-payable-in-august-and-september-2025-302508879.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-18T16:15:00-04:00",
    "date_et": "2025-07-18"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-20 23:31:22",
    "publisher": "Seeking Alpha",
    "title": "Bank Of America: CPI Report, Robust Q2 Earnings, Moderate Valuation",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-cpi-report-robust-q2-earnings-moderate-20250720.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America delivered robust 2Q25 earnings, driven by strong lending, trading, and a 7% YoY increase in net interest income. A higher-for-longer interest rate environment, supported by rising inflation, is bullish for BAC's floating-rate loan portfolio and net interest income outlook. The stock trades at a 17% discount to peers on book value, offering re-rating potential given consistent profitability and reaffirmed 2025 net interest income guidance.",
    "url": "https://seekingalpha.com/article/4802555-bank-of-america-cpi-report-robust-q2-earnings-moderate-valuation",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-20T23:31:22-04:00",
    "date_et": "2025-07-20"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-21 10:50:14",
    "publisher": "Seeking Alpha",
    "title": "Bank Of America: A Top Bank Buy For 2025",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-a-top-bank-buy-for-2025-20250721.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America delivered strong Q2'25 earnings last week, driven by higher net interest income and robust capital markets activity (trading). The Wall Street bank confirmed its 2025 net interest income outlook, despite expecting fewer rate cuts, and maintains solid balance sheet quality. Bank of America grew its NII sequentially to $14.8B, leading the bank to report its fourth quarter of consecutive growth.",
    "url": "https://seekingalpha.com/article/4802698-bank-of-america-a-top-bank-buy-for-2025",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-21T10:50:14-04:00",
    "date_et": "2025-07-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-21 16:20:13",
    "publisher": "MarketBeat",
    "title": "Goldman, Morgan Stanley, & BofA: Diverging Paths After Earnings",
    "image": "https://images.financialmodelingprep.com/news/goldman-morgan-stanley-bofa-diverging-paths-after-earnings-20250721.jpg",
    "site": "marketbeat.com",
    "text": "Wall Street just wrapped up a big week for earnings in the financial sector, and if there's one clear thing, it's that not all banks are built the same right now. With rising interest rates no longer the tailwind they once were, and margin pressure becoming a theme, investors are quickly drawing lines between the winners and the also-rans.",
    "url": "https://www.marketbeat.com/stock-ideas/goldman-morgan-stanley-and-bofa-diverging-paths-after-earnings/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-21T16:20:13-04:00",
    "date_et": "2025-07-21"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-22 15:00:00",
    "publisher": "Seeking Alpha",
    "title": "3 Tariff Resistant Stocks From Steven Cress",
    "image": "https://images.financialmodelingprep.com/news/3-tariff-resistant-stocks-from-steven-cress-20250722.jpg",
    "site": "seekingalpha.com",
    "text": "Tariffs are back in focus, creating inflation and stagflation risks; investors should seek US-centric, tariff-resistant stocks for protection. Steven Cress' top three picks to hedge against tariff pressure are ATI Inc., Sterling Infrastructure, and Bank of America, all with strong US revenue and Quant Strong Buy ratings.",
    "url": "https://seekingalpha.com/article/4803191-3-tariff-resistant-stocks-from-steven-cress",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-22T15:00:00-04:00",
    "date_et": "2025-07-22"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 10:01:26",
    "publisher": "Zacks Investment Research",
    "title": "Investors Heavily Search Bank of America Corporation (BAC): Here is What You Need to Know",
    "image": "https://images.financialmodelingprep.com/news/investors-heavily-search-bank-of-america-corporation-bac-here-20250723.jpg",
    "site": "zacks.com",
    "text": "Zacks.com users have recently been watching Bank of America (BAC) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
    "url": "https://www.zacks.com/stock/news/2607285/investors-heavily-search-bank-of-america-corporation-bac-here-is-what-you-need-to-know?cid=CS-STOCKNEWSAPI-FT-tale_of_the_tape|most_searched_stocks-2607285",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T10:01:26-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 16:10:37",
    "publisher": "247 Wallst",
    "title": "How to Build a Super Low Cost Passive Income Fund for Only $25,000",
    "image": "https://images.financialmodelingprep.com/news/how-to-build-a-super-low-cost-passive-income-20250723.jpg",
    "site": "https://247wallst.com",
    "text": "Key Points The RSPA ETF will immediately turn the bulk of your $25,000 account into a diversified income machine. Smaller allocations into SCHD, JEPQ, and FDVV will help you build a low-fee passive income foundation. Are you ahead, or behind on retirement? SmartAsset’s free tool can match you with a financial advisor in minutes to help you answer that today. Each advisor has been carefully vetted, and must act in your best interests. Don’t waste another minute; get started by clicking here.(Sponsor) How far can $25,000 get you? If you have a well-considered plan in place, you can actually turn your small account into a passive income factory. This can be done with a carefully selected group of high-yield, low-fee exchange traded funds (ETFs). With just $25,000, you can build a super-low-cost portfolio that consistently pays you cash dividends/distributions. Plus, you can de-risk your portfolio through multi-sector diversification and investment in famous large-cap companies. So, let&#8217;s start right now with a smart-money plan to extract sizable cash payouts from a small but growing account. Start With RSPA for Extra Diversification Out of a $25,000 account, you can confidently put $10,000 into just one ETF. That&#8217;s because the Invesco S&amp;P 500 Equal Weight Income Advantage ETF (NYSEARCA:RSPA) checks all of the right boxes for a small-sized high-growth portfolio. To populate a small-sized portfolio, I would want to use funds that invest in successful, blue-chip business. I would also insist that the ETFs should be diversified and need to have annual operating expenses below 0.5%. With a focus on companies in the prestigious S&amp;P 500 index, the Invesco S&amp;P 500 Equal Weight Income Advantage ETF has 525 stocks in its holdings. Suffice it to say, then, that the RSPA ETF is widely diversified. When you examine the fund&#8217;s holdings list, you&#8217;ll find established large-cap leaders across multiple economic sectors. Some examples are Coca-Cola (NYSE:KO), Johnson &amp; Johnson (NYSE:JNJ), JPMorgan Chase (NYSE:JPM), and Consolidated Edison (NYSE:ED). An interesting feature of the Invesco S&amp;P 500 Equal Weight Income Advantage ETF is that each of the holdings has a small, roughly equal weighing to the other stocks in the fund. That way, you won&#8217;t over-invest in any single stock. In addition, the RSPA ETF is low-cost as it only deducts annualized operating fees of 0.29%. And for all of you yield hunters out there, the Invesco S&amp;P 500 Equal Weight Income Advantage ETF currently features a 12-month distribution rate of 9.42%. All in all, this ultra-diversified fund is ideal for a $25,000 account and I would feel comfortable dedicating $10,000 toward RSPA. Expand Your Portfolio With SCHD and JEPQ Even though the RSPA ETF would already expose you to 500+ stocks, you still probably wouldn&#8217;t want to toss your entire $25,000 into just one fund. Consequently, we will now explore three more ETFs and, after conducting your own due diligence, you could invest $5,000 in each one of them. The first of these three intriguing funds is the Schwab U.S. Dividend Equity ETF (NYSEARCA:SCHD). This ETF tracks the Dow Jones U.S. Dividend 100 Index and has a portfolio comprising 103 stocks. Again, we&#8217;re looking for famous large-cap names and multi-sector diversification. The Schwab U.S. Dividend Equity ETF meets these expectations with recognizable stocks like Home Depot (NYSE:HD), Merck (NYSE:MRK), Lockheed Martin (NYSE:LMT), and Chevron (NYSE:CVX). Moreover, the Schwab U.S. Dividend Equity ETF serves up a trailing 12-month distribution yield of 3.87% but only deducts 0.06% worth of annual operating expenses. Therefore, investors should have no objections to allocating $5,000 toward the SCHD ETF. Next up is the JPMorgan Nasdaq Equity Premium Income ETF (NASDAQ:JEPQ), which is centered around the technology-focused NASDAQ 100 index. This fund includes 107 stocks so you can participate in the growth of tech&#8217;s heavy hitters, such as NVIDIA (NASDAQ:NVDA), Microsoft (NASDAQ:MSFT), Apple (NASDAQ:AAPL), and Amazon (NASDAQ:AMZN). Committing $5,000 of your $25,000 portfolio to the JEPQ ETF will unlock extra share-price appreciation potential from a variety of top tech firms. You&#8217;ll also get access to substantial cash distributions as the JPMorgan Nasdaq Equity Premium Income ETF features an impressive 11.52% annual yield. We&#8217;re still sticking to the low-cost theme here since JEPQ only deducts operating fees of 0.35% per year. So, why not add some technology-fueled firepower to your small portfolio with the JPMorgan Nasdaq Equity Premium Income ETF? Round It Out With FDVV To round out your $25,000 passive-income plan, you could assign $5,000 toward the Fidelity High Dividend ETF (NYSEARCA:FDVV). Instead of concentrating on the Dow Jones Industrial Average, S&amp;P 500, or NASDAQ 100, the FVDD ETF corresponds to the Fidelity High Dividend Index. Among the holdings list of the Fidelity High Dividend ETF, you&#8217;ll find large-cap superstars like Exxon Mobil (NYSE:XOM), Visa (NYSE:V), Procter &amp; Gamble (NYSE:PG), and Bank of America (NYSE:BAC). Overall, you&#8217;ll get exposure to plenty of consistent dividend deliverers with FDVV. The other need-to-know stats are that the Fidelity High Dividend ETF offers a trailing 12-month distribution yield of 3.07% but only deducts 0.16% in annualized operating expenses. With all of those benefits in mind, you can proudly add $5,000 worth of FDVV shares to your $25,000 account. Now, you&#8217;ve got a four-pack of funds with RSPA as your anchor as well as SCHD, JEPQ, and FDVV for extra diversification. That&#8217;s a savvy plan to keep the fees to a minimum while turning your $25,000 account into a low-risk regular income producer.The post How to Build a Super Low Cost Passive Income Fund for Only $25,000 appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/07/23/how-to-build-a-super-low-cost-passive-income-fund-for-only-25000/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T16:10:37-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 16:15:00",
    "publisher": "PRNewsWire",
    "title": "Bank of America Increases Common Stock Dividend 8% to $0.28 Per Share, Authorizes $40 Billion Stock Repurchase Program",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-increases-common-stock-dividend-8-to-20250723.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 23, 2025 /PRNewswire/ -- Bank of America Corporation today announced the Board of Directors declared a regular quarterly cash dividend on Bank of America common stock of $0.28 per share, up $0.02 from the prior quarter.",
    "url": "https://www.prnewswire.com/news-releases/bank-of-america-increases-common-stock-dividend-8-to-0-28-per-share-authorizes-40-billion-stock-repurchase-program-302512292.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T16:15:00-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 17:09:03",
    "publisher": "Reuters",
    "title": "Bank of America authorizes $40 billion stock repurchase plan",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-authorizes-40-billion-stock-repurchase-plan-20250723.jpg",
    "site": "reuters.com",
    "text": "Bank of America said on Wednesday its board has authorized a $40 billion stock repurchase program.",
    "url": "https://www.reuters.com/business/finance/bank-america-authorizes-40-billion-stock-repurchase-plan-2025-07-23/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T17:09:03-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 17:13:37",
    "publisher": "CNBC Television",
    "title": "Bank of America authorizes $40 billion stock repurchase program",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-authorizes-40-billion-stock-repurchase-program-20250723.jpg",
    "site": "youtube.com",
    "text": "CNBC's Leslie Picker joins 'Closing Bell Overtime' to talk breaking news from Bank of America.",
    "url": "https://www.youtube.com/watch?v=Kv1p4TI1vrc",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T17:13:37-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-23 17:14:00",
    "publisher": "WSJ",
    "title": "Lawmakers Subpoena JPMorgan and BofA Over IPO of Chinese Battery Startup",
    "image": "https://images.financialmodelingprep.com/news/lawmakers-subpoena-jpmorgan-and-bofa-over-ipo-of-chinese-20250723.jpg",
    "site": "wsj.com",
    "text": "A House committee focused on national security had previously urged banks to stop work on CATL's initial public offering.",
    "url": "https://www.wsj.com/finance/banking/lawmakers-subpoena-jpmorgan-and-bofa-over-ipo-of-chinese-battery-startup-83f20c0d",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-23T17:14:00-04:00",
    "date_et": "2025-07-23"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-24 12:45:38",
    "publisher": "CNBC Television",
    "title": "U.S. House Committee issues subpoenas to Big Bank CEOs over IPO concerns",
    "image": "https://images.financialmodelingprep.com/news/us-house-committee-issues-subpoenas-to-big-bank-ceos-20250724.jpg",
    "site": "youtube.com",
    "text": "CNBC's Emily Wilkins joins 'Money Movers' to discuss the House China Committee issuing subpoenas for JPMorgan CEO Jamie Dimon and Bank of America CEO Brian Moynihan.",
    "url": "https://www.youtube.com/watch?v=GmeJd9VE-ho",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-24T12:45:38-04:00",
    "date_et": "2025-07-24"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-26 11:40:00",
    "publisher": "Seeking Alpha",
    "title": "Bank of America: Higher Yielding Preferred Stock Is Still Attractive",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-higher-yielding-preferred-stock-is-still-20250726.jpg",
    "site": "seekingalpha.com",
    "text": "Bank of America's preferred dividends remain well-covered, with less than 5% of net profit needed to service them, ensuring strong income security. The Series GG preferred shares offer a nearly 6% yield, and post ex-dividend, the effective yield rises above 6%, making them attractive for income investors. Despite call risk, BAC has not redeemed these preferreds, suggesting they may remain outstanding due to the reasonable cost of equity for the bank.",
    "url": "https://seekingalpha.com/article/4804706-bank-of-america-higher-yielding-preferred-stock-is-still-attractive",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-26T11:40:00-04:00",
    "date_et": "2025-07-26"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-27 09:00:00",
    "publisher": "24/7 Wall Street",
    "title": "Bank of America (NYSE: BAC) Stock Price Prediction and Forecast 2025-2030 (July 2025)",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-nyse-bac-stock-price-prediction-and-20250727.jpg",
    "site": "247wallst.com",
    "text": "Shares of Bank of America (NYSE: BAC) gained 2.33% over the past month, bringing its year-to-date gain to 15.02%.",
    "url": "https://247wallst.com/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-27T09:00:00-04:00",
    "date_et": "2025-07-27"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-28 06:48:00",
    "publisher": "The Motley Fool",
    "title": "There's a Massive Stock Market Opportunity Right Now, and It Isn't AI: Here Are 3 Great Ways to Play It",
    "image": "https://images.financialmodelingprep.com/news/theres-a-massive-stock-market-opportunity-right-now-and-20250728.jpg",
    "site": "fool.com",
    "text": "Most of the trillion-dollar investment opportunity headlines have to do with artificial intelligence, autonomous vehicles, Internet of Things, or other tech trends. And there's certainly a good reason they're getting so much attention.",
    "url": "https://www.fool.com/investing/2025/07/28/theres-a-massive-stock-market-opportunity-right-no/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-28T06:48:00-04:00",
    "date_et": "2025-07-28"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-28 14:02:24",
    "publisher": "247 Wallst",
    "title": "Bank of America (NYSE: BAC) Stock Price Prediction and Forecast 2025-2030 (July 2025)",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-nyse-bac-stock-price-prediction-and-20250728.jpg",
    "site": "https://247wallst.com",
    "text": "Shares of Bank of America (NYSE: BAC) gained 2.33% over the past month, bringing its year-to-date gain to 15.02%. Since hitting its 2025 low on April 4, the stock is up nearly 40%. When the company reported Q2 earnings earlier in July, it announced mixed results with EPS of 89 cents versus analysts&#8217; expectations of 86 cents, and revenues of $26.61 billion versus expectations of $26.72 billion. It was the only major U.S. bank to fall short on revenue for the quarter. Since its Depression-era roots in San Francisco, Bank of America has weathered close to a century of wars and financial upheavals to rise as one of the top financial institutions in the US, ranking #2 behind JP Morgan Chase by asset size. Bank of America’s massive AUM heft made it a $45 billion “too big to fail” TARP bailout recipient during the 2008 subprime banking meltdown. It also acquired Wall Street investment banking stalwart Merrill-Lynch as a kicker. CEO Brian Moynihan has ruthlessly slashed operations to focus on growing assets under management with lower overhead. 24/7 Wall St. has analyzed the stock, industry, sector and the macro environment to forecast where shares of Bank of America could be heading over the next five years. Bank of American (BAC) Recent Stock Success After reaching its five-year high of $49.18 per share in January 2022, Bank of America has struggled to attain that level again. Efforts to climb higher had been thwarted, but after bottoming in late October 2023, the stock has rallied back gaining nearly 84% by the end of January 2025. Regardless, investors are much more concerned with future stock&#8217;s performance over the next one, five and 10 years. While most Wall Street analysts will calculate 12-month forward projections, it’s clear that nobody has a consistent crystal ball, and plenty of unforeseen circumstances can render even near-term projections irrelevant. 24/7 Wall St. aims to present some farther-looking insights based on Bank of America’s own numbers, along with business and market development information that may be of help to our readers’ own research. Year Price Revenues Net Income 2015 $13.99 $79.804B $15.910B 2016 $18.67 $80.104B $17.822B 2017 $25.50 $83.730B $18.232B 2018 $21.53 $87.738B $28.147B 2019 $31.47 $85.582B $27.430B 2020 $27.81 $74.208B $17.894B 2021 $41.61 $93.707B $31.978B 2022 $31.70 $92.407B $27.528B 2023 $33.23 $94.187B $26.515B LTM $40.75 $93.156B $24.517B Key Drivers for Bank of America’s Stock in the Future 1. Interest Sensitive Balance Sheet: The Federal Reserve&#8217;s Fed Funds rate hikes have boosted BAC&#8217;s net interest income (NII), but negatively impacted the stock price. Rate cuts might temporarily help lending and mortgage finance, but any renewed inflation signs will be red flags and could trigger further problems. 2. Net Interest Income: The rise in NII due to higher interest rates and corresponding robust loan interest rate growth has been a critical factor for that segment, but at the cost of higher default rates and lower transaction volumes. 3. Branch Growth: Expanding financial centers and branches into currently untapped demographic markets is a part of Bank of America’s “local” growth strategy. Its Branch Expansion agenda aims to have a presence in every state. The physical presence results in a 100% increase in digital sales, and looks to expand its 3,800 branches. 4. Technology: Improved digital offerings and the use of AI and other customer service tools, can boost customer satisfaction and fees that could boost earnings. 5. Capital Deployment Strategies: Bank of America&#8217;s dividend increases and share repurchase plans reflect a strong capital position, attractive to dividend hawk-oriented investors. Bank of America (BAC) Stock Prediction for 2025 The current Wall Street consensus, median one-year price target for Bank of America is $52.24, which represents 8.96% potential upside from today’s share price. BAC receives a consensus &#8220;Strong Buy&#8221; rating from the 19 analysts covering the stock, with 16 assigning it as a &#8220;Buy,&#8221; three assigning it as a &#8220;Hold&#8221; and none assigning it as a &#8220;Sell.&#8221; 24/7 Wall St.&#8216;s 12-month forecast for Bank of America is more conservative. We see BAC ending 2025 at a price of $47.20, or 1.54% lower than today&#8217;s share price. Bank of America (BAC) Stock Forecast 2025–2030 By 2030, the Branch Expansion program should have met its targeted location goals, and all of them would be primed for using the latest and most sophisticated Bank of America digital financial tools. Bank of America Erica(c) digital assistant, Zelle, Venmo, proprietary digital payment systems, online brokerage and other virtual platforms would be fully implemented and income generating. 24/7 Wall St.’s price target for 2030 is $63.96 per share, representing a potential gain of 33.41% from the current share price. Year EPS Price %Change From Current Price 2025 $4.17 $47.20 -1.54% 2026 $4.14 $54.60 13.89% 2027 $4.14 $60.72 26.65% 2028 $4.58 $53.95 12.53% 2029 $4.58 $59.15 23.38% 2030 $5.00 $63.96 33.41% The post Bank of America (NYSE: BAC) Stock Price Prediction and Forecast 2025-2030 (July 2025) appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/forecasts/2025/07/27/bank-of-america-bac-price-prediction-and-forecast/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-28T14:02:24-04:00",
    "date_et": "2025-07-28"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-28 16:11:58",
    "publisher": "MarketBeat",
    "title": "4 Stocks Planning to Substantially Boost Buybacks After Solid Q2",
    "image": "https://images.financialmodelingprep.com/news/4-stocks-planning-to-substantially-boost-buybacks-after-solid-20250728.jpg",
    "site": "marketbeat.com",
    "text": "With Q2 earnings season now in full swing, hundreds of companies have reported financial results over the past several weeks. However, only a few big names have announced something many investors want: increasing buybacks.",
    "url": "https://www.marketbeat.com/stock-ideas/4-stocks-planning-to-substantially-boost-buybacks-after-solid-q2/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-28T16:11:58-04:00",
    "date_et": "2025-07-28"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-29 11:11:06",
    "publisher": "Zacks Investment Research",
    "title": "Bank of America vs. PNC Financial: Which Bank Stock Has More Upside?",
    "image": "https://images.financialmodelingprep.com/news/bank-of-america-vs-pnc-financial-which-bank-stock-20250729.jpg",
    "site": "zacks.com",
    "text": "Bank of America BAC and PNC Financial Services PNC are two prominent U.S. banks with broad national reach. BAC leverages its massive scale and diversified financial services, while PNC is distinguished by its prudent growth strategy and targeted regional expansion.",
    "url": "https://www.zacks.com/stock/news/2633915/bank-of-america-vs-pnc-financial-which-bank-stock-has-more-upside?cid=CS-STOCKNEWSAPI-FT-analyst_blog|most_popular_stocks-2633915",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-29T11:11:06-04:00",
    "date_et": "2025-07-29"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-29 13:17:56",
    "publisher": "Proactive Investors",
    "title": "AMD set to deliver Q2 beat on CPU and GPU strength: Bank of America",
    "image": "https://images.financialmodelingprep.com/news/amd-set-to-deliver-q2-beat-on-cpu-and-gpu-20250729.jpg",
    "site": "proactiveinvestors.com",
    "text": "Advanced Micro Devices Inc (NASDAQ:AMD, ETR:AMD) will report its second quarter earnings next week, and Bank of America analysts expect the chipmaker to deliver results ahead of consensus, driven by strength in its core CPU and GPU businesses and favorable pricing dynamics in AI products. The bank's analysts repeated their ‘Buy' rating on AMD shares and raised their price objective to $200 from $175, citing a stronger AI CPU and GPU environment.",
    "url": "https://www.proactiveinvestors.com/companies/news/1075666",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-29T13:17:56-04:00",
    "date_et": "2025-07-29"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-30 07:35:00",
    "publisher": "Seeking Alpha",
    "title": "Ignore The Fed-Trump Drama, Invest With 10% Yields",
    "image": "https://images.financialmodelingprep.com/news/ignore-the-fedtrump-drama-invest-with-10-yields-20250730.jpg",
    "site": "seekingalpha.com",
    "text": "Political drama between Trump and Powell over interest rates is entertaining, but I avoid letting it influence my investment decisions. The Income Method focuses on building a diversified income portfolio that generates reliable cash flow regardless of political or monetary policy shifts. Use your portfolio to create a lasting legacy of income, like great leaders aspiring to leave behind a powerful legacy.",
    "url": "https://seekingalpha.com/article/4805629-ignore-the-fed-trump-drama-invest-with-10-percent-yields",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-30T07:35:00-04:00",
    "date_et": "2025-07-30"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-30 10:32:00",
    "publisher": "PRNewsWire",
    "title": "Confronted with Higher Living Costs, 72% of Young Adults Take Action to Improve their Financial Health, finds BofA Better Money Habits Study",
    "image": "https://images.financialmodelingprep.com/news/confronted-with-higher-living-costs-72-of-young-adults-20250730.jpg",
    "site": "prnewswire.com",
    "text": "CHARLOTTE, N.C. , July 30, 2025 /PRNewswire/ -- Gen Z (ages 18-28) is finding adulthood more expensive than expected.",
    "url": "https://www.prnewswire.com/news-releases/confronted-with-higher-living-costs-72-of-young-adults-take-action-to-improve-their-financial-health-finds-bofa-better-money-habits-study-302517478.html",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-30T10:32:00-04:00",
    "date_et": "2025-07-30"
  },
  {
    "symbol": "BAC",
    "publishedDate": "2025-07-30 13:00:40",
    "publisher": "247 Wallst",
    "title": "Credit card companies no longer value a $50k monthly spend",
    "image": "https://images.financialmodelingprep.com/news/credit-card-companies-no-longer-value-a-50k-monthly-20250730.jpg",
    "site": "https://247wallst.com",
    "text": "Credit card companies offer various perks to attract and retain customers. You may get a good welcome bonus if you spend enough money within a few months, and you will also likely receive points or cash back on every purchase. However, a Fat FIRE advocate recently expressed dissatisfaction with Amex Platinum. This individual no longer feels valued by the company despite spending $50,000 each month. Other Redditors jumped into the comments to share their thoughts about this trend and recommend some ways to maximize credit card benefits. Key Points Some credit card companies don&#8217;t have the same reward structures that made them so popular. A Redditor who spends more than $50,000 per month is looking for alternatives after AMEX fell below their expectations. It’s hard to believe, but today there are credit cards offering up to 6% cash back, $200 statement credits, $0 annual fees, travel rewards, and more. See for yourself, I couldn’t believe it at first. Frankly, with rewards this good we don’t expect them to be available forever. But if you sign up today you can secure some of the best rewards we’ve ever seen. Click here to get started. Use Bank Of America The top commenter suggested putting $100,000 into a Merrill Lynch or Bank of America account and then using the company&#8217;s Visa card for maximum benefits. This setup will net you 3.5% cashback on travel and dining, plus 2.625% cashback on everything else. The recommendation came from someone who was fed up with using different credit cards for different categories and opening a bunch of cards just for their bonuses. This route can save you a lot of time while allowing you to secure top-tier rewards. Bank of America also doesn&#8217;t have an annual membership fee that is tied to those benefits. To top it all off, there are a lot of expenses that count as travel and dining, even if it&#8217;s not obvious. &#8220;They are *extremely* generous about how they code for travel and dining. For example, I pay monthly maintenance expenses on several rental properties with the card. Magically, that&#8217;s counted as lodging, so I get 3.5% back,&#8221; the top commenter stated. Fees Add Up The original poster isn&#8217;t the only one who&#8217;s fed up with Amex cards. One Redditor commented that the Amex Centurion card isn&#8217;t as good as it used to be, despite paying roughly $5,000 in fees. The Redditor got plenty of upvotes from that comment. You can choose from many credit cards that do not have annual fees. If you don&#8217;t have to contend with an annual fee, all of your rewards are pure profit as long as you pay off your credit card balance at the end of each month. Plenty of credit cards offer unlimited 2% cashback on every purchase, and that may be enough to edge out some of the credit cards with annual fees. While big spenders may be able to justify the high annual fee, it isn&#8217;t worth it for everyone. Travelers Benefit The Most From High-End Credit Cards Another Redditor mentioned that most of the top-tier credit cards only serve people who travel often. While this setup benefits regular travelers, it&#8217;s important to keep this distinction in mind if you do not travel. It&#8217;s important to view each credit card while considering how you spend your money and what you want out of life. Some people enjoy traveling, but opting for a simple cashback credit card may be the better choice for others. However, that doesn&#8217;t mean you&#8217;re getting the deal of a lifetime if you enjoy boarding airplanes and going to new destinations. Some Redditors criticized the travel portals of various credit cards. They said that hotel and car prices include travel agent markups and are not competitive. It&#8217;s always good to review the numbers before opening a card or making any big travel purchases to ensure you are getting the best deal. The post Credit card companies no longer value a $50k monthly spend appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/personal-finance/2025/07/29/credit-card-companies-no-longer-value-a-50k-monthly-spend/",
    "ticker": "BAC",
    "event_date": "2025-07-16",
    "window_start": "2025-07-09",
    "window_end": "2025-07-30",
    "publishedDateET": "2025-07-30T13:00:40-04:00",
    "date_et": "2025-07-30"
  }
]