{
  "symbol": "PLTR",
  "quarter": 4,
  "year": 2020,
  "date": "2021-02-16 08:00:00",
  "content": "Rodney Nelson: Good afternoon. Welcome to Palantir’s Fourth Quarter 2020 Earnings Call. We’ll be discussing the results announced in our press release issued prior to the market open and posted on our Investor Relations website. During the call, we will make statements regarding our business that may be considered forward-looking within applicable securities laws, including statements regarding our first quarter 2021 and multi-year outlook, management’s expectations for our future financial and operational performance and other statements regarding our plans, prospects and expectations. These statements are not promises or guarantees and are subject to risks and uncertainties, which could cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed after market close today and in our SEC filings. We undertake no obligation to update forward-looking statements, except as required by law. Further, during the course of today’s call, we will refer to certain adjusted financial measures. These non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, GAAP measures. Additional information about these non-GAAP measures, including a reconciliation of non-GAAP to comparable GAAP measures, is included in our press release and investor presentation provided today. Our press release, investor presentation and SEC filings are available on our Investor Relations website at investors.palantir.com. [Technical Difficulty]\nAlex Karp: Welcome, Palantir had a very strong year, last year and then because of the strength year, it might be worth taking a second and asking, well, what do the numbers actually mean? Obviously, on the face of them they’re strong and even curiously strong. We believe, I believe that Palantir’s numbers are a lagging indicator of several macro trends that we got right. First is the obvious macro trend that is almost become venality that the world is becoming a software world and the institutions that survive and thrive and provide benefits to their citizens, both in terms of actual output, but also real output, meaning output that includes data protection that make sure that the data is actually preserved in a way that guarantees its veracity that gives comfort to its citizens that make sure the citizens aren’t merely a product to be monetized. And second that as diverse as the institutions are that we work in from clandestine services to providing AI in the most sensitive military context to working with oil and gas companies to airlines to pharmaceutical research took all aspects of helping to ameliorate the plague that is COVID. There’s one trend; institutions, countries, individuals that can assess the value of software that can work now are the institutions that survive and provide value both in the government, commercial and even moral context, moral as defined by they increase the legitimacy of institutions. One of the primary issues we have in the West is the dearth of legitimacy of commercial and government institutions of experts. And this makes it very impossible to navigate issues around how do you rebuild your company internally and externally to conform and thrive in a very difficult context, where there’s COVID rebuilding the supply chain, political volatility, uncertainty in general skepticism about anything you say. That is a software problem. How do you actually look at the data? Understand that the data is actually true. Understand the veracity of the model? How do you understand – how can you prove to people that their data is not being be abused, monetized, used to discriminate against them? Were the people listening to you have a great deal of skepticism? How do people, who are on this call presumably, trying to evaluate the actual value and meaning of our numbers? It’s very hard for them to do – to understand this without understanding what is the actual background of the numbers? Are they afford indicator or a lagging indicator of a macro trend that you either got it right or wrong? One of the interesting things about philosophy, history and software is that when something becomes crucial to a society, absolutely determinative, it sets off a dialectic of learning. So that the – what we understand about what it means to procure software, use software, integrate into a world that is defined by software, is very different than what we would have thought about it when it was a luxury product. And that’s largely how software has been viewed here before. It’s something that can augment your enterprise, your government; it can make your enterprise slightly better than your competitor in a myriad of context. It can make you a military slightly more efficacious, slightly more transparent, or in some contexts, less transparent. It can make things more cost-effective, but that’s not the context we’re in now. We’re in a context where it is basically binary, institutions and societies, which implement software effectively, will dramatically outperform. In every context, in the military context, in the clandestine context, in the COVID context, in the context of every commercial entity that we’re involved in, everyone I’ve ever seen and everyone you’ve seen. And then the real questions like, well, what does it mean to survive in a COVID like context or how do you stop the next pandemic? In a Western constellation, where civil liberties data protection is crucial, you can’t just, re-orchestrate the society and re-orchestrate the data without having buy-in from the people that nominally, or hopefully completely control the society. Those are software problems. And then the people who are in charge have to – are going to learn and will learn over time. What does it mean when someone says that software works? What does it mean for software to be implemented effectively? What is the actual alpha, is the alpha adjust the output, or is it the output also measured against the moral context, the moral imperatives that allow us to unify in a society? There’s a very famous quote from Wittgenstein [Foreign Language] which means roughly paraphrase to believe you’re following the rule isn’t to fall a rule. This is typically used to explain important trend in language philosophy. But you could also look at this as like to use software, it doesn’t mean to actually use software. If software is absolutely determinative of the current condition, just like language was, it’s like in a philosophical sense, you could say we’ve had a shift from the language imperative or language is actually what determines meaning; two, a software context where it’s actually software is determining meaning value and legitimacy. Why do commercial and government institutions struggle with legitimacy? Because in many cases, it’s very hard to understand what is the output? How did it happen under what context? What was paid for it? What did we get? And then the structures we’ve built are treating software as a cosmetic, augmentative attribute when in fact software is the language of our time and a mastery of software will determine what works and what doesn’t. The numbers that you’ve seen our reflection of our bet that this would happen, they are a lagging indicator. And we believe that the transformation, which is happening in the world now, will accelerate. And that the way in which we’re providing software, both a Foundry/Gotham, and our ability to scale this through Apollo will be the way that everyone at some point will actually try to build software. And the way in which institutions will procure software, because of a dialectic of macro and micro conditioned, a dialectic, which will force change, because the winners will figure this out. [Technical Difficulty]\nRodney Nelson: On today’s call, you’ll hear from Alex Karp, Founder, and Chief Executive Officer; Shyam Sankar, Chief Operating Officer’; Dave Glazer, Chief Financial Officer, and Kevin Kawasaki, Global Head of Business Development. With that, I’ll turn it over to Shyam.\nShyam Sankar: Thank you, Rodney. First, I’d like to congratulate the NHS and the UK for a stunningly successful vaccine rollout. The NHS is truly a national treasure. I’d also like to congratulate HHS protect on winning Gartner’s Eye on Innovation Awards for Government in 2020. And finally, I’d like to congratulate U.S. Space Force’s Kobayashi Maru, their cutting edge software factory for winning the Software Innovation Team and Gears of Government Awards. To 2020 results. 2020 was a seminal year for Palantir. We helped 100 commercial organizations and 10 national governments respond to the COVID crisis. We were able to solve incredibly complex problems in three days and enabled our customers to reinvent themselves amidst these continuums shocks. But of course, that’s not just three days. It’s 15 years of product development, more than $2 billion on R&D and three days. And for many of those customers, in a short period, we became their default operating system – we became critical to the core functioning of their operations. In meeting that moment our business grew significantly in 2020 resulting in 47% revenue growth on a full year. And we created and continued to create substantial opportunities for growth over the next year and beyond. Last week, we announced a groundbreaking partnership with IBM, where IBM or OEM, a number of foundry modules and its Cloud Pak for data offering enabling commercial customers to easily build AI-infused applications, leveraging a trusted data foundation and enterprise AI. This partnership dramatically expands our distribution capabilities, leveraging IBM’s data and AI’s 2,500 sellers. For context, that is a sales force that is larger than all of Palantir. Along with an already large installed base of Cloud Pak customers. We were very excited about what this partnership means for our go-to-market in 2021 and beyond. The response, since the announcement from prospective customers has been incredibly strong. There’s a lot of momentum, a lot of energy. And we will continue you to pursue channel partnerships to enhance our distribution. The product driven momentum is clear and building across both segments of our business. We invested in technologies that would help our customers get value fast and create enduring operational value that compounds. Continuously delivered upgrades to our software become upgrades to our customer’s businesses. Our Foundry 21 Launch represents the culmination of that work, but software defined data integration we’re automating away the complexity of integrating systems with a drag and drop interface frontline business users can build production grade AI-infused applications. Modularity allows customers to take what they need and build on what they have. Archetypes bring point and click use cases to accelerate outcomes, all part of how upgrading our software upgrades their business. As we move into 2021, these innovations are not only helping our customers generate value much faster. They’re also allowing us to broaden our go-to-market. We expect to add triple digit head count to our sales function this year. In our commercial segment, we generated greater than a 100% U.S. revenue growth in 2020 on the back of investments and our direct sales force. And in the fourth quarter, we signed several large deals with customers across a variety of sectors, including automotive, energy, healthcare, insurance, mining, and shipping. We signed a multi-year enterprise agreement with Rio Tinto in the fourth quarter. This partnership is the culmination of several Foundry deployments integrating data from across Rio Tinto’s operations, spanning 90 plus systems, including machines, sensors, and instruments. These initiatives helped Rio Tinto transform bore rates into a digital business across the value chain to increase production and enhance profitability and connect people in Rio Tinto’s underground operations with data. Foundry will be both a single source of truth, combining operational and transactional data and a digital twin that will enable Rio Tinto’s employees to make data-driven decisions and take action from headquarters to the mind face. We signed a multi-year contract with Pacific Gas and Electric to help it streamline operations across the company. PG&E collects 10 billion data points every day, spanning both structured and unstructured data, which feeds the digital twin of PG&E’s network within Foundry to enable root cause analysis and upgrade monitoring. We expect this will allow them to improve their electric operations and asset management resulting in enhanced safety and grid reliability. PG&E will have a single integrated platform providing a complete operating picture to make fast effective data-driven decisions and its public safety power shutoff program, which will help mitigate future wild fire risks. And this is just the beginning of our joint enterprise vision. In addition, we signed a significant expansion with the Fortune 50 healthcare company in the fourth quarter. Across the healthcare industry, there are increasing market pressures ranging from reimbursements that are becoming tied to value-based care, increasing costs of pharmaceuticals, as well as an expanding number of competitors. Managing unit profitability at a granular level becomes much more important in this environment. And this customer was facing the inability to model their complex contract and pricing models in order to make actionable decisions for the negotiations and payments management. This issue is wildly complex, as it involves managing the balance between revenue and cost of goods sold models that are managing the network of suppliers, supply chain, labor, payers, and regulatory coefficients. By integrating these disparate sources into Foundry, the customer now has a contract management solution that automates away this complexity, allowing the company to focus on operational decision-making and outcomes. And this has already led to $50 million of annual as value. We continue to deepen our partnership with BP. And in the fourth quarter, we signed a five-year, nine figure enterprise renewal. We have worked with BP since 2014. Our software is the backbone of BP’s digital twin applications, which has generated over a $1 billion of value in 2020. As part of our ongoing partnership, our software will help BP continue its transformation as they work towards their net zero ambition. These applications will accelerate BP’s initiatives in wind power, electric charging network, solar power generation, and other initiatives to deliver energy more safely and efficiently for years to come. We’re also deepening our work with the Fortune 200 industrials manufacturing customer, and our relationship rapidly evolved over the course of 2020 to incorporate several use cases within Foundry. As a manufacturer of personal protective equipment this customer faced substantial supply and demand shocks into the onset of COVID, accentuating the need to re-imagine the firm’s supply chain management and order processing practices. After integrating its baseline supply chain performance models and order fulfillment records, the customer was able to move away from its first-in first-out order fulfillment and deliver PPE to those, who were most in dire need all in under a couple of weeks. The customer is using our software to address enduring challenges, including modeling, supply chain scenarios, and conducting forecasting and demand sensing to alert users to future bottlenecks and inventory risks. The net result is a decision-making engine at the intersection of a connected supply chain with connected manufacturing. Turning to our government segment. Our Gotham 21 Launch underscores both our ongoing vision to provide the central operating platform for government, as well as our focus on the near-peer fight in the defense context. We made extraordinary progress on these initiatives in 2020 overall. The full-year government revenue rose 77%, led by ongoing momentum in the U.S. which grew 91%. As tremendous of a year as 2020 was for the government segment we believe we were just at the tip of the iceberg and we are well positioned to capture significant new opportunities in 2021 and beyond. Our intensive product investments in developing an end-to-end sensor-to-shooter and space to mud capability are paying off. We were creating unique opportunities to enable the warfighter with AI superiority and that technology is starting to create large program of record opportunities across the services. Our partnership with the U.S. army continues to expand. Vantage is a critical asset for the army to support both readiness and financial management. Vantage helps the army free up $3.3 billion for reinvestment. In December, the army exercised its first option year. And we are excited to continue this work with army vantage. We recently won a pair of new contracts with the army to accelerate its modernization efforts. In November, Palantir was selected to provide a prototype for the Army’s common data fabric and data security solution to support capabilities at 2023. This is yet another opportunity for our software to be used in the mission command space, operating at the intersection of intelligence, mission planning, and execution. It is a true honor to have the opportunity to aid the army in its efforts to provide an integrated solution that will ultimately improve access to critical data for commanders and soldiers deliver efficient use of networks and denied and degraded environments, in increase the collaboration with joint and allied partners. In January, we were down selected to deliver a prototype as part of army’s ground station modernization in support of the Titan program. Under the $8.5 million Phase 1 contract Palantir will collaborate with the army to demonstrate a solution that integrates space high out, aerial and terrestrial sensors for using intelligence command and control. The overall solution, which carries a total potential contract value of a $0.25 billion across all phases we’ll provide operators down range with shortened targeting timelines by incorporating data integration, sensor fusion, and advanced analytic capabilities using AI. We were built for this. those years of product investments, I was just mentioning, that’s this. We are looking forward to continuing our work in this area with the army, as well as pursuing similar programs with other services. And while a lot of new 2020 U.S. defense opportunities started as crisis response to COVID, almost all of it is relevant to enduring problems and needs. For example, we started working with the Air Force in may of 2020 to support their COVID response. The engagement has supported COVID-19 testing, PPE availability, helping plan vaccine distribution, and personnel availability. but it’s also clear to the Air Force, how it can see all the fleet availability, combat readiness and equipment readiness. In the UK, Palantir’s software is powering three of the country’s most important national priorities, PPE, vaccines, and managing trade post-Brexit. In December, we signed a two-year contract with the NHS, worth up to $31 million, where a Foundry will serve as the core platform for secure, reliable, and timely data processing to enable decision-makers to efficiently plan and distribute resources, improve patient care and protect patient privacy. Additionally, the highly successful UK’s vaccines program ordered, allocated, tracked and delivered their vaccines in Foundry. While we continue to partner with the world’s leading healthcare institutions to come back COVID-19, we closed deals that are focused on supporting their ongoing transformation in a post-COVID world. In the fourth quarter, we expanded our relationship with the FDA with a three-year $44 million contract. Our partnership with the FDA began in 2017 to aid the oncology center of excellence in regulatory research across clinical trial data. Our relationship evolved over time to include the Center for Drug Evaluation and Research, CDER, which we assisted in the fight against the opioid crisis and supported regulatory review activities. This new agreement will continue our work with the FDA in mission critical enduring workflows, such as ensuring manufacturers are complying with agency rules and regulations and enhancing drug reviews. This speed up time to market while maintaining the highest safety standards and there is significant opportunity for further expansion as our work today touches on just two of 16 centers and offices at the FDA. we closed out the year with strong momentum. In the fourth quarter, we signed many significant deals, 21 deals worth $5 million or more including 12 deals, each worth $10 million or more. in aggregate, we generated 47% annual revenue growth. We saw customer concentration and revenue concentration decrease even as the number of significant deals grew. our pipeline is substantial and growing. These deals, they start in the acquired phase of our three-phase model and with new customers, who are acquired in year that have yet to even join a phase, both of these groups performed exceptionally, a very positive forward-looking indicator. Additionally, the intensive growth of existing customers continued with average revenue per customer growing 41% to $7.9 million. We grew the number of accounts with $10 million of annual revenue or more by 50%. We’re continuing to demonstrate our ability to grow customer relationships at scale, as we add ever increasing value to our customers’ enterprises. And it’s still very clear that we’re just at the beginning. Our customers include only eight of the Fortune 100, 12 of the global 100 and only 24 of the global 300. The opportunity in front of us is immense and growing. And finally, I’d like to thank each and every habit for their exceptional efforts in 2020. You went where you were needed most from the front lines of the vaccine to the factory floors at PPE manufacturers from the briefing rooms of prime ministers to the war rooms, where the nitty-gritty work actually got done. You built the products that met their moment, and you did all of this while driving the operational changes and support functions that executed the business. You supported each other through the ongoing trials and tribulations of the pandemic. You are all a constant reminder that not all who wander are lost. I am proud of what you accomplished. And I’m so very honored to call you coworkers. And I’m very grateful and often in disbelief for the joint opportunities that we have for impact. This truly is only the beginning. Thank you. to kick off the discussion on financial results, I’ll now pass it off to Karp.\nAlex Karp: There are many insights; indeed, some secrets that have powered Palantir and got us from a company that in the beginning no one believe would succeed, because we’re heavily focused on strengthening the west through a near fanatical fixation on data integration and data protection. When we transferred to the commercial world, people didn’t believe that would succeed, because there’s no history of anybody going from government to commercial. When we went, we became a global company, people didn’t believe that would succeed, because the global – typically companies that started with in the American government or in America do not succeed or thrive abroad. When we went and did our DPO people thought we should IPO, because that is the best and quickest way to transfer money to Wall Street. But we believe we should be focused on allowing the average person to participate and therefore absorb that risk. And now, as we’ve had a pretty sublime year based on any conventional metric, and as you’ve seen the results, we want to underscore this relentless focus, what you could call an insight secret, it would – should be a venality of business, have a long-term focus on the health of what we believe is, and will be continued to be one of and will become the most important software business in the world. And to do that, we’re providing long-term guidance pretty radical in the sense that we are committing to keeping a growth threshold of above 30% for the next five years, but not focused on the day-to-day, quarter-to-quarter near-term focus that quite frankly destroys businesses is one of the main reasons why so many of our businesses, especially in tech are actually only serving Wall Street and not serving their clients and not serving an everyday investor and generate suboptimal returns over time, because they too are lacking indicator of the suboptimal performance. near-term, my optimism [ph] of running a business, and at Palantir, obviously, we have rejected this in every way, both from the way we’ve produced software, from the way we interact with clients from the best we’ve made, that tend to be vets that come to our vision years after a very, very significant investment, any case, we hope those of you on this call, who are a current investors stay with us. And those of you who prefer a more short-term focus that you choose companies that are more appropriate for you.\nDave Glazer: Thanks, Karp. I’ll review our fourth quarter and full year 2020 performance followed by our outlook. Full year 2020 revenue was $1.93 billion, up 47% year-over-year. Fourth-quarter revenue was $322 million, up 40% year-over-year, and roughly $21 million above the high end of our prior guidance range. In addition, for the full year 2020, the average revenue per customer was $7.9 million, up 41% year-over-year. Average revenue from the top 20 customers was $33 million, up 34% year-over-year with our top 20 customers representing roughly 61% of our total 2020 revenue, down from roughly 67% in 2019 as we continue to broaden our revenue and customer base. For the full year 2020, 43% of our revenue was generated from new customers in 2018 or later exemplifying our improving ability to rapidly onboard customers to our software and realized compounding value as their data assets grow and used cases develop. We see this scaling taking place across our customer base. In 2020, the number of customers generating more than $1 million in revenue annually grew 32% year-over-year. Customers generating more than $5 million annually grew 54% year-over-year. And customers generating more than $10 million annually grew 50% year-over-year. In the fourth quarter alone, we closed 21 deals of $5 million or more in total contract value including 12 deals worth $10 million or more. Looking at revenue by segment. Government revenue accelerated in the fourth quarter growing 85% year-over-year to $190 million. We signed several large deals in the quarter including a three-year $44 million expansion with the U.S. Food and Drug Administration and a two-year $31 million agreement with the NHS. In addition, we announced that the U.S. Army executed its first option year with approximately $114 million as part of our partnership on the Army Vantage program. For the full year 2020, government segment revenue grew 77% year-over-year to $610 million and represented roughly 56% of our total revenue. Fourth quarter commercial segment revenue totaled $132 million, up 4% year-over-year, while full year commercial segment revenue grew 22% year-over-year to $482 million, and we continue to see strong momentum in our U.S. commercial business heading into 2021. U.S. commercial revenue rose 107% year-over-year in fiscal 2020 aided by our ongoing investments in our account-based sales force and channel partnerships. In the fourth quarter, we signed several large deals including a nine-figure renewal with BP, exemplifying our software’s enduring impact and value even in a sector that has been fundamentally challenged as of late. Also in the fourth quarter, we signed eight additional deals with at least $10 million in our commercial segment. I’ll next discuss our margins and expenses on an adjusted basis, which includes stock-based compensation. Fourth quarter adjusted gross margin was 84%, up 1,200 basis points versus the year-ago period, and full-year adjusted gross margin was 81%, up 1,000 basis points, compared with full year 2019. The year-over-year improvement in gross margin was driven by increased automation and efficiency in the delivery of our software. Contribution margin with 62% in the fourth quarter, nearly double the contribution margin of 33% in the year-ago quarter, which highlights the efficiencies we have generated in customer acquisition and contract execution. Turning to our operating expenses. Total fourth quarter adjusted operating expenses were $186 million, which includes approximately $19 million in employer payroll taxes related to stock-based compensation. Excluding these expenses, total fourth quarter adjusted operating expenses would have been $167 million. Fourth quarter operating income excluding stock-based compensation and related employer payroll taxes was $104 million representing an adjusted operating margin of 32%. The outperformance in adjusted operating income was primarily driven by a higher than expected revenue quarter, continued efficiencies in our go-to-market, and delivery in main server software as well as reductions in cloud hosting costs. Full year 2020 adjusted operating income, which excludes stock-based compensation, related employer payroll taxes, and non-recurring expenses related to our direct listing was $190 million, representing a margin of 17%. As we noted last quarter, we have historically pursued multi-year upfront payments from our customers, which has led to significant growth in contract liabilities in prior periods such as billings and cash collections often exceeded revenue. Over the course of 2020, we’ve moved away from our practice of collecting multiple years of upfront payments which have led to lower 2020 cash collections and a greater portion of our revenue coming from the recognition of such contract liabilities. We expect this to begin to normalize over the course of 2021 with cash collections and revenue moving more in parallel over time, which will drive positive cash flow from operations for the year. We measure revenue visibility across several metrics. First, we ended 2020 with a total deal value across the business of $2.8 billion while the year-end dollar-weighted average contract duration was 3.6 years. This growth rate is particularly strong when considering government customers entered into shorter than usual contracts in 2020 to accelerate procurement as they responded to the COVID crisis and move quickly on various monetization efforts across both defense and civilian agencies. We expect a tailwind for the government as these customers renew and expand. Second, our remaining performance obligations as of December 31, 2020 was $597 million, up 124% year-over-year, while the current RPO increased 114% year-over-year. Although RPO provides a limited view into our business as many of our contracts across our government and commercial segments feature termination for convenience clauses, the growth in these metrics is representative of the ongoing and momentum we are seeing in our business. Third, we look at the annual contract value booked in year on a dollar-weighted duration basis. In 2020, the dollar-weighted annualized contract value we closed increased 49% t year-over-year, providing a strong foundation for fueling growth in 2021 and beyond across both our commercial and government segments. Looking at the business through the lens of our three-phase model, we ended the year with strong performance across all three cohorts. Our Acquire phase customers ended 2020 generating $77 million in revenue with a 17% contribution margin with nearly half of the revenue from these customers coming in the fourth quarter. This rapid scaling and expanding contribution margin demonstrates the increasing efficiency of our customer acquisition and onboarding process, which we believe will help fuel an expanding pipeline into 2021 and beyond. Expand phase customers continue to see increasing value in our software platforms yielding consistent upsell and cross-sell opportunities. These customers generated $360 million in revenue for the full year 2020 with a contribution margin of 47%. This represents over 100% year-over-year growth for this customer cohort and this growth was extremely efficient as these customers generated a contribution margin of negative 43% in fiscal year 2019. Finally, our scale-phase customers continue to demonstrate a strong combination of growth and profitability as these customers generated $613 million in revenue and 70% contribution margin in 2020, representing 8% year-over-year growth and a 1,500 basis points expansion in contribution margin compared with the same customers in fiscal year 2019. In addition, for the full-year 2020, we generated $42 million in revenue from new customers we acquired in year of which $19 million was recognized in the fourth quarter. This compares with $4 million in the fourth quarter fiscal year 2019 and represents 375% growth year-over-year. You heard from Karp about our long-term orientation. As we move into the future, we believe our investments will help us sustain elevated growth rates for the next five years and beyond as we pursue a broad range of opportunities across our commercial and government segments. For our five-year outlook, we expect greater than $4 billion in revenue in 2025. Starting in 2021, we expect greater than 30% annual revenue growth each year for the next five years. And in Q1 of this year, we expect revenue growth of 45% or $332 million at the midpoint and we expect adjusted operating margin of 23% for the quarter. With that, I’ll turn the call over to Rodney to open up Q&A.\nA - Rodney Nelson: Thanks, Dave. John, Dave and Kevin will join me for Q&A today. And we’ll begin with some shareholder questions from say, Shyam; I’ll start with you on this first question. Palantir is guiding for double-digit percentage growth this year. Can Palantir sustain such a compound growth rate, barring any unforeseen negative economic impacts or should investors expect choppy yearly growth numbers. Can you comment on a long-term expected growth rate?\nShyam Sankar: I’ll build on what Karp said earlier in the call on long-term guidance. We are very much at the beginning here. We just did 45% growth in 2020. We expect to do – sorry, 47% growth in 2020. We expect to do 45% growth in Q1 of 2021 and we are only in 24 of the global 300. But I think looking at that kind of misses the point around the TAM expansion, that’s currently happening. Look at the channel partnership with Fujitsu and IBM among others, where we’re not just distributing to the top 300 or the top 1,000, but really, we have the ability now to distribute to the entire market, potentially tens of thousands of customers. And with our investments in the end-to-end, sensor-to-shooter workflows from space to mud, we’re not just going after the roughly, $60 billion of government IT spend anymore, we’re talking about the quarter-trillion dollars of U.S. DoD weapons system spend in 2020. And our product investments mean that we are uniquely positioned to seize those opportunities. Broadening the market is not about Palantir life, it’s about Palantir Automated. It’s about the power of Apollo, it’s about software that manages itself. Look – look at our archetypes investments like this means with a few clicks, you can deploy end-to-end powerful use case. Use cases that would have cost millions of dollars and taken many months can now be deployed in minutes. It’s about software-defined data integration and modularity. That means that you get 100% of the power of Palantir, but with the ease of self-managing software. And these are examples of why we’re confident in our long-term growth of being greater than $4 billion in 2025.\nRodney Nelson: Great. So, the next question is on Demo Day and I’ll stick with you, Shyam. Could you – can you please share how Demo Day was received by potential customers and would the Palantir experience a surge of interest in its products specifically on the commercial side of the business?\nShyam Sankar: Yes. Demo Day was a hit with potential customers. We were very excited by the marked uptick in inbound inquiries. And – and these have led to some great generative conversations with prospective customers. Demo Day really helped customers understand if they had a problem that Palantir can solve, and it kept our growing sales force pretty busy. But it really underscores the tremendous opportunity in front of us and how much we are at the beginning. One of the reflections that I had about Demo Day is that we tried to do an all-purpose Foundry demo. But the truth is that Foundry can solve so many, many problems. So, we’re going to be hosting a – another event in April, Demo Day DoubleClick. We’re going to spend more time on Foundry, focused on more use cases across more industries. So, stay tuned for that formal announcement and registration details.\nRodney Nelson: Great. Kevin, I’ll come to you on this next one. Will big company deals such as the IBM announcement become more common as Foundry’s price become more apparent to the public? Also, is there any timeframe or chance for widely available, bullet-technical medium-sized businesses or consumer-level software?\nKevin Kawasaki: Thank you, Rodney. So, yes, we’re excited about this partnership as well. I’ll start with the small and medium-sized businesses. In short, yes, Shyam just talked about how our TAM is expanding that we’re automating the delivery of Foundry. This means you can have full end-to-end use cases with no code, just drag, and drop. And the result of this is that we can deliver the full power of our products to small, medium, and of course, large institutions. And it’s important to note here that the unit economics really allow for us to do this, 84% adjusted gross margin in Q4 last year, 62% contribution margin in Q4. So, of course, partnerships like IBM adding salespeople to scale and distribution just made a lot of sense, right.\nRodney Nelson: Great. Shyam, I’ll come at – I’ll come back to you on this next one. It seems like the bulk of your channel partnerships are focused on the enterprise of the commercial segment. What are the near-term opportunities to broaden the channel that government side overall growth there need to be directly sourced?\nShyam Sankar: We are aggressively pursuing partnerships with large primes. But these partnerships, they’re specifically focused on partnering with the divisions that build hardware platforms. The folks that build aircraft, submarine, land vehicles, space-based platforms, drone, ship, and other weapons systems. And the focus of these partnerships is to explore putting Palantir’s unique AI capabilities, capabilities that have already been proven in the field and retrofitting them onto existing programs of record and taking them in from inception into future programs. And so this is going to manifest in something that looks like Palantir inside of every missile, inside of every drone, Palantir of the edge inside of every sensor in every shooter. And we’re approaching these partnerships in a unique way with the commercial item. So, that means, of course, we get to leverage the commercial item preference 2377. But I think much more importantly, this creates a massive opportunity for the primes themselves to generate high-margin, recurring software revenue businesses by partnering with us against their installed base. And in talking with them, it seems like one of the reasons that they’re most excited about it this is that they see this in the face of shrinking defense budgets as a way of driving their own multiple expansion and growing their market cap. This is massively TAM-expanding for Palantir. As I mentioned earlier, this is us not just going after government IT spend, but actually, we’re now entering into – enable to address the roughly $0.25 trillion of DoD weapons system spend. And I think this represents a revolutionary opportunity for our joint customers in terms of capabilities that they can get.\nRodney Nelson: Great. Dave, I’ll come to you on this next one. In terms of profitability, when does Palantir expect to achieve a level, where it can repeatedly and continually achieve profitability? Does Palantir need to hit the targeted 6,000 Foundry clients along with other revenue sources from other platforms to become meaningfully profitable?\nDave Glazer: On profitability, and Kevin just briefly touched on it. but I’d point you to our margins today. 84% adjusted gross margin in Q4, 81% for full-year 2020, 62% contribution margin in Q4, 54% for full-year 2020, 32% adjusted operating margin in Q4, 17% for the full year. We have proven the unit economics this year and we did it in a year, where we did 47% growth. And this is why we’re going to continue investing in that growth. And it’s just really, really like a massive opportunity ahead of us.\nRodney Nelson: Great. Shyam, I’ll come back to you before we open the call for – for more Q&A. While the IBM announcement is great, their public cloud share is relatively small. Can you commit to expanding managed offerings to other cloud providers such as – such as Microsoft, Azure, AWS, Google Cloud, et cetera?\nShyam Sankar: Let’s start with Apollo, because it – it’s crucial technology. Apollo means that we can run our software efficiently anywhere. In your cloud, in my cloud, and their cloud, you know, in space, on a drone, on a Humvee. The customer of the future should not have to worry about this. It will run wherever you need it to seamlessly. It’s also important to understand that the vast majority of our new customers are taking advantage of the speed, security, and reliability of our SaaS offering and we have committed to spending over $1 billion on cloud providers. So, we’re operating these offerings that scales with the providers. And I mean, just to give you a – a sense of that, it turns out actually there are limits to how Elastic Compute actually is. We got a call we never thought we’d get, one of the providers calling us to let us know that they were out of servers. So, of course, we’re working with all these providers in all of these places. But maybe, more interestingly is to think about how do we think about these providers to us, their channels. Our offering is an end-to-end solution that: one, delivers a rapid amount of value to our customers; but two, it drives a massive amount of cloud consumption for these providers. And so we’re going to continue focusing on working with the providers that generate the most growth for us, where we have a joint go-to-market. So, it’s worth watching the space.\nRodney Nelson: Great. Operator, we’ll turn it over to you for our next question.\nOperator: Certainly. [Operator instructions] Your first question comes from the line of Brent Thill from Jefferies. Your line is open.\nBrent Thill: Good morning. The $4 billion revenue target for 2025, can you just walk through the assumptions that – that you are making to achieve that target, and what gives you the confidence to achieve this? This is obviously a – a pretty big target and few companies in the industry give this type of target. Maybe if you could just talk to that. Thank you.\nShyam Sankar: You bet. Thanks, Brent. So, just kind of starting off reiterating some of the numbers that we gave here. Yes, 47% revenue growth last year, expected 45% growth in Q1. What’s driving this? And that gives us the confidence looking forward. So, yes, the product investments that we’ve made, along with direct sales force, now channel partnerships, really fuels the distribution. And you can see this in the data, 110% revenue growth in our U.S. commercial market, 91% revenue growth in U.S. government, both last year. Revenues from new accounts as Dave mentioned in Q4 grew 375%. Our acquirer-phase customers grew over 200% in the second half of 2020 alone. The expand-phase customers were 100%. So, that’s showing a lot about the strength of our new account pipeline and how we land and expand? Our average revenue per customer grew 41% to $7.9 million. And I think we – we talked about this already but probably worth reiterating, we did our 47% growth last year while increasing our margin. 84% adjusted gross margin, 62% contribution margin, up from 33% last year that nearly doubling in one year.\nOperator: Your next question comes from the line of Keith Weiss from Morgan Stanley. Your line is open.\nKeith Weiss: Thanks, everyone. Thank you, guys, for taking the question, and very nice quarter. I think it was probably a question for Dave. And just kind of helping us better understand in the income statement. On one side of the equation, can you help us better understand kind of – some of the volatility we see in revenue growth? Commercial revenue growth slowed down a lot into Q4 versus Q3. Sounds like, over the full year, you did really well. So, can you explain to us how we see that volatility? Because I think software investors are used to seeing a lot of recurring revenues and pretty smooth revenue trends there. So, one, could help us understand kind of that bouncing around the revenue growth. And two, on the OpEx side of the equation. OpEx for the quarter was down – the adjusted OpEx was down almost 30% year-on-year, for the full year, it’s down 20%. I know T&E is a big chunk of that probably about half of it. But given like the huge opportunity, still very early days, you guys have such a lead in terms of technology, why are you investing in it so low? Like why is OpEx down on a year-on-year basis versus really aggressively investing for it if it’s an opportunity on a go-forward basis?\nShyam Sankar: Well, I’ll start with things, Keith, this is Shyam, and I’m jumping in on the OpEx one. Really what you’re seeing there is the payoff of our long-term investments in the product. So, last year, Apollo delivered a massive step-change in terms of both cost of revenue and the efficiency around sales and marketing and how we acquired customers in our three-phase model. On top of that, with the software-defined data integration and the investments in archetypes allowing us to capture business, shrinking the duration of pilots, shrinking the investment that was required which drove down sales and marketing. And that reduced, of course, on the other end, the cost of revenue. And then the second component that you’re seeing outside of product is the investment in the direct sales force, which for us has paradoxically reduced the unit cost around sales and marketing. It’s cheaper for us to acquire customers by building out the direct sales force. So, you should expect to see, of course, a very significant investment in that going forward. But if invested on a much more efficient base and you’ll see that spend go up here. Now, in terms of commercial customers there, I – it was a big year for commercial customers. A lot of expansion, the right way to look at this from our perspective is the amount of growth that we had in U.S. commercial, the place that we have invested significantly in our direct sales force here. And that resulted in 107% growth. And then when you look at the investments that we’re making with channel partnerships, Fujitsu in Japan, IBM Worldwide, distribution in 180 countries, adding as many folks and effectively a week to our sales forces we have, employees at Palantir, we’re feeling really good about what we should be expecting from commercial going forward.\nOperator: Your next question comes from the line of Christopher Merwin from Goldman Sachs. Your line is open.\nChristopher Merwin: Okay. Thanks very much for taking my question. I wanted to ask about the modularization of Foundry. Obviously, it’s a very powerful platform, and your pre-packaging need solutions, which just sounds like you need so much more easily that way. Can you talk a bit about how that might change the competitive set for you if at all? Are you mainly focused on use cases that are generally not served by other horizontal DoD spenders today? Thanks.\nShyam Sankar: Thanks, Chris. It’s a great question. We’re very much focused on modularizing of Foundry in a way that creates a unique set of offerings underneath it. I’ve personally been talking with customers and prospective customers around these modules and there’s a huge amount of excitement from them around it because really it allows them to leverage their existing investments, things that they spent many years building that they’re quite happy with that are core components of their business. But it also allows them to accelerate their modernization journey by leveraging components that we offer that are completely unique. And we’re going to continue to be focused on offering modules that we perceive as being unique, the market perceives as being unique and that allow us to meet the customers where they are.\nOperator: Your final question comes from the line of Brad Zelnick from Credit Suisse. Your line is open.\nBrad Zelnick: Great. Thank you so much and congrats. Really strong results, guys. I guess, I wanted to ask more about the triple-digit growth in sales headcount that you mentioned. Can you just maybe remind us how much of demand in Q4 or perhaps in 2020 was captured explicitly by sales heads versus forward-deployed engineers? How does that progress and how should we think about the hiring cadence and productivity ramp of these reps that you intend to hire?\nShyam Sankar: Yes. So, I think, roughly, I could think of good way thinking about this is about half of incremental growth is now being driven by our investments in the direct sales force and channel partnerships and we expect that can grow pretty substantially here. But the places where we’ve had the most growth, U.S. government, U.S. commercial, that is way more than half. In terms of productivity ramp, I think we’ll be ready to comment in that in future periods, but what we’re seeing is a marked compression in how long it’s taking to ramp our reps and get them to be productive. And we’re also seeing – this is happening at a time where there’s just a lot more demand in the market, there’s a lot more inbound coming to us. So, we’re pretty excited about ramping the reps and ramping the hiring as quickly as possible to meet that demand.\nOperator: That concludes the Q&A. And I would like to take this time to thank everybody for joining and you may now disconnect. Have a wonderful day, everybody."
}