[
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa Deepens Global Commitment to Environmental Sustainability with Pledge to Reach Net-zero Emissions by 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-deepens-global-commitment-to-environmental-sustainability-with-pledge-20210421.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), a leading global payments technology company, announced today a new global commitment to reach net-zero emissions by 2040, and that the company achieved carbon neutrality across its operations in 2020.i Visa also outlined plans to become a climate positive company through new partnerships and expanded initiatives to support sustainable commerce and the transition to a low-carbon economy beyond the company's own footprint. “Visa is committed to cre",
    "url": "https://www.businesswire.com/news/home/20210421005395/en/Visa-Deepens-Global-Commitment-to-Environmental-Sustainability-with-Pledge-to-Reach-Net-zero-Emissions-by-2040/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T07:00:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa Deepens Global Commitment to Environmental Sustainability with Pledge to Reach Net-zero Emissions by 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-deepens-global-commitment-to-environmental-sustainability-with-pledge-20210421.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), a leading global payments technology company, announced today a new global commitment to reach net-zero emissions by 2040, and that the company achieved carbon neutrality across its operations in 2020.i Visa also outlined plans to become a climate positive company through new partnerships and expanded initiatives to support sustainable commerce and the transition to a low-carbon economy beyond the company’s own footprint. “Visa is committed to creating a more sustainable future,” said Al Kelly, chairman and chief executive officer of Visa. “Our new net-zero commitment and enhanced efforts across our network in support of sustainable initiatives are immediate ways we will achieve our goals to help build a better future for our planet.” Net-zero by 2040 – 10 years ahead of Paris Climate Agreement goal As part of the commitment to reach net-zero emissions by 2040, Visa announced it is a new signatory of The Climate Pledge, an initiative co-founded by Amazon and Global Optimism, as well as a new member of the Climate Business Network, a World Wildlife Fund (WWF) initiative to accelerate action toward a net-zero future. Visa’s net-zero commitment is aligned with emerging global standards and definitions and will include efforts with suppliers to abate a significant portion of the greenhouse gas footprint of the company’s purchased goods and services. Visa also has committed to set science-based targets through the Science Based Target initiative at the 1.5 degree Celsius ambition level. These new commitments join Visa’s existing sustainability leadership, including its transition to 100 percent renewable electricity usage in 2020. “This Earth Month Visa is using the power of our network to accelerate transformation in sustainability and economic recovery, while helping ensure that the planet and economies around the world thrive,” said Douglas Sabo, chief sustainability officer of Visa. “By prioritizing clean energy and sustainable practices, investing in environmentally innovative initiatives and engaging with corporate and civil society leaders on climate, we are committed to being a part of the global solution to climate change.” Supporting Sustainable Commerce Visa is expanding its initiatives to use its products, services, network, data, payments expertise and brand to support sustainable commerce and the transition to a low-carbon economy. Today, Visa announced its collaboration with the Cambridge Institute for Sustainability Leadership (CISL) to work together to identify new opportunities to apply electronic payments capabilities and the Visa network toward realizing a sustainable future. Results of the collaboration are anticipated in Summer 2021. Visa’s collaboration with CISL complements the company’s efforts to work across its network to support a low-carbon future, including: Partnerships advancing sustainable payment cards and accounts Global initiatives supporting sustainable behaviors, such as in mobility and travel Developing sustainable insights to support stakeholders in commerce in understanding consumer barriers and drivers of sustainable living behaviors Using the brand’s platforms to inspire sustainable living among millions of consumers Visa’s new goals and efforts to support sustainable commerce build upon the company’s existing recognized industry leadership in sustainability, including inclusion on the following: Dow Jones Sustainability North American Index, America’s Most Responsible Companies, 100 Best Corporate Citizens and 100 Most Just Companies. For more information, please visit: https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html. About Visa Inc. Visa is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network – enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of connected commerce on any device. As the world moves from analogue to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information visit usa.visa.com/about-visa.html, usa.visa.com/visa-everywhere/blog.html and @VisaNews. This release contains forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements generally are identified by words such as “will,” “plans,” “is expected,” and other similar expressions. Examples of forward-looking statements include, but are not limited to, statements we make regarding the timing and likelihood of taking actions related to our strategy, plans for future climate initiatives and goals, and the potential impact of our actions. By their nature, forward-looking statements: (i) speak only as of the date they are made; (ii) are not statements of historical fact or guarantees of future performance; and (iii) are subject to risks, uncertainties, assumptions or changes in circumstances that are difficult to predict or quantify. Therefore, actual results could differ materially and adversely from Visa’s forward-looking statements due to a variety of factors, including those contained in our Annual Report on Form 10-K for the fiscal year ended September 30, 2020, and our other filings with the U.S. Securities and Exchange Commission. You should not place undue reliance on such statements. Except as required by law, we do not intend to update or revise any forward-looking statements as a result of new information, future developments or otherwise. i This carbon neutrality achievement covers greenhouse gas emissions footprint from Visa’s Scope 1 (owned source), Scope 2 (purchased electricity) and business travel and employee commuting elements of Scope 3 (value chain) emissions. Scopes 1, 2 and 3 are as defined by the Greenhouse Gas Protocol of the World Resources Institute (WRI) and the World Business Council for Sustainable Development (WBCSD).",
    "url": "https://www.businesswire.com/news/home/20210421005395/en/Visa-Deepens-Global-Commitment-to-Environmental-Sustainability-with-Pledge-to-Reach-Net-zero-Emissions-by-2040",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T07:00:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa Refuerza su Compromiso Global con la Sustentabilidad Medioambiental con la Promesa de Alcanzar Emisiones Netas Cero para el 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-refuerza-su-compromiso-global-con-la-sustentabilidad-medioambiental-20210421.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), compañía líder mundial en tecnología de pagos, anunció hoy un nuevo compromiso global para alcanzar emisiones netas cero para el 2040, y que logró la neutralidad de carbono en todas sus operaciones en el 2020.i Visa también esbozó planes para convertirse en una compañía positiva para el clima a través de nuevas alianzas e iniciativas ampliadas para apoyar un comercio sustentable y la transición a una economía baja en carbono más allá de la propia huella de la compañía. “En Visa tenemos el compromiso de crear un futuro más sustentable”, dijo Al Kelly, CEO y presidente de la junta directiva de Visa Inc. “Nuestra nueva meta de emisiones netas cero y la mejora de los esfuerzos en toda nuestra red en apoyo de iniciativas sustentables son formas inmediatas de alcanzar nuestros objetivos para ayudar a construir un futuro mejor para nuestro planeta”. Emisiones Netas Cero para el 2040 - 10 años antes del objetivo del Acuerdo Climático de París Como parte del compromiso de alcanzar emisiones netas cero para el 2040, Visa anunció que es un nuevo firmante de The Climate Pledge, una iniciativa cofundada por Amazon y Global Optimism, así como un nuevo miembro de Climate Business Network, una iniciativa del Fondo Mundial para la Naturaleza (WWF, por sus siglas en inglés) para acelerar la acción hacia un futuro de emisiones netas cero. El compromiso de Visa de alcanzar emisiones netas cero está en consonancia con las normas y definiciones globales emergentes e incluirá iniciativas junto con proveedores para reducir una parte significativa de la huella de gases de efecto invernadero de los bienes y servicios adquiridos por la compañía. Visa también se ha comprometido a establecer objetivos basados en la ciencia a través de la iniciativa Science Based Target en el nivel de ambición de 1,5 grados Celsius. Estos nuevos compromisos se añaden al actual liderazgo de Visa en cuanto a sustentabilidad, incluyendo su transición al uso de electricidad 100 por ciento renovable en el 2020. “Este Mes de la Tierra, Visa está utilizando el poder de nuestra red para acelerar la transformación en la sustentabilidad y la recuperación económica, y al mismo tiempo ayudar a asegurar que el planeta y las economías de todo el mundo prosperen”, dijo Douglas Sabo, jefe de sustentabilidad de Visa. “Al priorizar una energía limpia y prácticas sustentables, invertir en iniciativas innovadoras desde el punto de vista medioambiental y participar con líderes corporativos y de la sociedad civil en temas relacionados con el clima, nos comprometemos a formar parte de la solución global al cambio climático”. Apoyar un Comercio Sustentable Visa está ampliando sus iniciativas para utilizar sus productos, servicios, red, datos, experiencia en pagos y marca para apoyar un comercio sustentable y la transición a una economía con bajas emisiones de carbono. Hoy Visa ha anunciado nuestra nueva colaboración con el Cambridge Institute for Sustainability Leadership (CISL) para trabajar en conjunto con el fin de identificar nuevas oportunidades de aplicar las capacidades de pagos electrónicos y la red de Visa para lograr un futuro sustentable. Se prevé que resultados de la colaboración estarán disponibles para el verano boreal del 2021. La colaboración de Visa con CISL complementa los esfuerzos de la compañía por trabajar en toda su red para apoyar un futuro con bajas emisiones de carbono, incluyendo: Alianzas que promuevan cuentas y tarjetas de pago sustentables Iniciativas globales que apoyen comportamientos sustentables, por ejemplo en la movilidad y los viajes Desarrollar perspectivas sustentables para apoyar a las partes interesadas en el comercio y ayudarles a comprender las barreras que enfrentan los consumidores y los impulsores de los comportamientos de vida sustentables Utilizar las plataformas de la marca para inspirar una vida sustentable entre millones de consumidores Los nuevos objetivos y esfuerzos de Visa para apoyar un comercio sustentable se basan en su actual liderazgo reconocido en la industria en materia de sustentabilidad, incluyendo su inclusión en las siguientes listas: Índice Dow Jones de Sustentabilidad de América del Norte, Empresas más Responsables de Estados Unidos, 100 Mejores Ciudadanos Corporativos y 100 Empresas Más Justas. Para obtener más información, visite: https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html Acerca de Visa Inc. Visa Inc. (NYSE: V) es la compañía líder mundial en pagos digitales. Nuestra misión es conectar al mundo por medio de la red de pagos más innovadora, confiable y segura, que habilita a las personas, a las empresas y a las economías para prosperar. Nuestra avanzada red de procesamiento global, VisaNet, proporciona pagos seguros y confiables en todo el mundo y es capaz de procesar más de 65,000 mensajes de transacción por segundo. La continua concentración de la compañía en la innovación es un catalizador para el rápido crecimiento del comercio digital en cualquier dispositivo, para todos, en todo lugar. Mientras el mundo se mueve de lo analógico a lo digital, Visa aplica su marca, sus productos, su personal, su red y su escala a la tarea de moldear el nuevo futuro del comercio. Para obtener más información, visite Acerca de Visa, visa.com/blog y @VisaNews. Este comunicado contiene declaraciones con miras al futuro conforme al significado establecido en la Ley de Reforma de Litigios sobre Valores Privados de EE. UU. (U.S. Private Securities Litigation Reform Act) de 1995. Las declaraciones con miras al futuro generalmente se identifican con el uso de verbos en tiempo futuro, palabras como “planea”, “se espera” y otras expresiones similares. Entre los ejemplos de tales declaraciones con miras al futuro se encuentran, a título enunciativo, pero no limitativo, declaraciones que hacemos sobre los plazos y las probabilidades de tomar acciones relacionadas con nuestra estrategia, planes de futuras iniciativas y metas climáticas, y el impacto potencial de nuestras acciones. Por su naturaleza, las declaraciones con miras al futuro: (i) hablan solamente a partir de la fecha en que se hacen; (ii) no son declaraciones de hecho histórico ni garantías de desempeño futuro y (iii) están sujetas a riesgos, incertidumbres, suposiciones y cambios en circunstancias que son difíciles de predecir o cuantificar. Por consiguiente, los resultados reales podrían diferir sustancial y negativamente de las declaraciones con miras al futuro de Visa, debido a diversos factores, incluyendo los contenidos en nuestro Informe Anual en el Formulario 10-K correspondiente al año fiscal finalizado el 30 de septiembre del 2020, y nuestros otros informes presentados ante la Comisión de Bolsa y Valores de Estados Unidos. Usted no debe depositar una confianza excesiva en dichas declaraciones. A menos que sea requerido por ley, no tenemos intención de actualizar ni revisar ninguna declaración con miras al futuro, debido a nuevas informaciones o acontecimientos futuros o de otro modo. i Este logro de la neutralidad de carbono cubre la huella de las emisiones de gases de efecto invernadero, es decir, las emisiones de Visa de Alcance 1 (fuente propia), Alcance 2 (electricidad comprada) y los elementos de viajes de negocios y desplazamientos de los empleados de Alcance 3 (cadena de valor). Los Alcances 1, 2 y 3 son los definidos por el Protocolo de Gases de Efecto Invernadero del Instituto de Recursos Mundiales (WRI, por sus siglas en inglés) y el Consejo Empresarial Mundial para el Desarrollo Sustentable (WBCSD, por sus siglas en inglés).",
    "url": "https://www.businesswire.com/news/home/20210421005396/es/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T07:00:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 08:45:00",
    "publisher": "Business Wire",
    "title": "Visa verdiept wereldwijde toewijding aan milieuduurzaamheid met de belofte om tegen 2040 een nettovrije uitstoot te bereiken",
    "image": "https://images.financialmodelingprep.com/news/visa-verdiept-wereldwijde-toewijding-aan-milieuduurzaamheid-met-de-belofte-20210421.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), een toonaangevend wereldwijd bedrijf op het gebied van betalingstechnologie, kondigde vandaag een nieuwe wereldwijde toezegging aan om tegen 2040 een netto-nuluitstoot te bereiken en dat het bedrijf in 2020 koolstofneutraliteit heeft bereikt in zijn activiteiten. Visa schetste ook plannen om een klimaatpositief bedrijf te worden door middel van nieuwe partnerschappen en uitgebreide initiatieven ter ondersteuning van duurzame handel en de overgang naar een koolstofarme economie buiten de eigen voetafdruk van het bedrijf. “Visa streeft naar een duurzamere toekomst”, aldus Al Kelly, voorzitter en CEO van Visa. “Onze nieuwe ‘net-zero’-verbintenis en verbeterde inspanningen in ons netwerk ter ondersteuning van duurzame initiatieven zijn directe manieren waarop we onze doelen zullen bereiken om te helpen bouwen aan een betere toekomst voor onze planeet.” Deze bekendmaking is officieel geldend in de originele brontaal. Vertalingen zijn slechts als leeshulp bedoeld en moeten worden vergeleken met de tekst in de brontaal, die als enige rechtsgeldig is.",
    "url": "https://www.businesswire.com/news/home/20210421005625/nl/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T08:45:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 10:11:00",
    "publisher": "Business Wire",
    "title": "Visa rafforza il proprio impegno globale per la sostenibilità ambientale con l’obiettivo di azzeramento delle emissioni nette entro il 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-rafforza-il-proprio-impegno-globale-per-la-sostenibilit-20210421.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), prestigiosa società di portata globale di tecnologie per pagamenti, ha annunciato oggi un nuovo impegno globale per l’azzeramento delle emissioni nette entro il 2040, confermando di avere raggiunto nel 2020 la neutralità carbonica nelle proprie attività.i Visa ha inoltre delineato i piani per diventare un’azienda orientata alla tutela del clima attraverso nuove partnership e iniziative allargate a favore di un commercio sostenibile, unitamente al proprio impegno alla transizione verso un’economia a basse emissioni di carbonio che travalichi i confini della sola presenza aziendale. “Visa si impegna per creare un futuro più sostenibile”, ha dichiarato Al Kelly, presidente e amministratore delegato di Visa. Il testo originale del presente annuncio, redatto nella lingua di partenza, è la versione ufficiale che fa fede. Le traduzioni sono offerte unicamente per comodità del lettore e devono rinviare al testo in lingua originale, che è l'unico giuridicamente valido.",
    "url": "https://www.businesswire.com/news/home/20210421005709/it/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T10:11:00-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-21 11:19:03",
    "publisher": "Seeking Alpha",
    "title": "Hingham Is The Best Bank Stock",
    "image": "https://images.financialmodelingprep.com/news/hingham-is-the-best-bank-stock-20210421.jpg",
    "site": "seekingalpha.com",
    "text": "Hingham Is The Best Bank Stock",
    "url": "https://seekingalpha.com/article/4420261-hingham-is-best-bank-stock",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-21T11:19:03-04:00",
    "date_et": "2021-04-21"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-22 02:11:00",
    "publisher": "Business Wire",
    "title": "Visa renforce son engagement mondial en faveur de la durabilité environnementale en visant l’objectif zéro émission nette d’ici 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-renforce-son-engagement-mondial-en-faveur-de-la-20210422.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE : V), une société leader mondiale dans le secteur des technologies de paiement, a annoncé aujourd’hui un nouvel engagement mondial consistant à atteindre zéro émission nette d’ici 2040, et a affirmé que la société avait atteint la neutralité carbone pour ses opérations en 2020.i Visa a également souligné sa volonté de devenir une société à impact positif sur le climat via de nouveaux partenariats, et a renforcé ses initiatives visant à soutenir le commerce durable ainsi que la transition vers une économie à faible empreinte carbone, au-delà de la propre empreinte de la société. « Visa s’engage à créer un avenir plus durable », a déclaré Al Kelly, président-directeur général de Visa. « Notre nouvel engagement zéro émission nette, ainsi que nos efforts accrus sur l’ensemble de notre réseau en soutien à des initiatives durables, nous permettront immédiatement d’atteindre nos objectifs consistant à bâtir un avenir meilleur pour notre planète. » Zéro émission nette d’ici 2040 – avec 10 années d’avance sur l’objectif de l’Accord de Paris sur le climat Dans le cadre de son engagement consistant à atteindre zéro émission nette d’ici 2040, Visa a annoncé faire partie des signataires de l’Engagement climat, initiative cofondée par Amazon et Global Optimism, et compter parmi les nouveaux membres du Climate Business Network, initiative du World Wildlife Fund (WWF) visant à accélérer les actions menées en direction d’un avenir à zéro émission nette. L’engagement zéro émission nette de Visa s’inscrit en phase avec les normes et définitions mondiales émergentes, et inclura des efforts aux côtés de ses fournisseurs, afin de diminuer une part significative de l’empreinte en termes de gaz à effet de serre des biens et services achetés par la société. Visa s’engage également à fixer des objectifs fondés sur des données scientifiques via l’initiative Science Based Target, avec un niveau d’ambition de 1,5 degré Celsius. Ces nouveaux engagements s’ajoutent au leadership existant de Visa en matière de durabilité, notamment sa transition vers l’utilisation d’électricité 100 pour cent renouvelable en 2020. « En ce Mois de la Terre, Visa utilise la puissance de son réseau pour accélérer la transformation vers la durabilité et la reprise économique, tout en contribuant à veiller à ce que la planète et les économies du monde entier prospèrent », a déclaré Douglas Sabo, directeur de la durabilité chez Visa. « En accordant la priorité aux énergies propres ainsi qu’aux pratiques durables, en investissant dans des initiatives innovantes d’un point de vue environnemental, ainsi qu’en s’engageant en faveur du climat auprès de dirigeants d’entreprise et de la société civile, nous entendons participer à la solution mondiale contre le changement climatique. » Soutien du commerce durable Visa renforce ses initiatives visant à utiliser ses produits, services, réseaux, données, ainsi que son expertise dans le domaine des paiements et sa marque, pour soutenir le commerce durable et la transition vers une économie à faible empreinte carbone. Aujourd’hui, Visa a annoncé sa collaboration avec le Cambridge Institute for Sustainability Leadership (CISL) afin de travailler ensemble pour identifier les nouvelles opportunités d’application des capacités de paiement électronique et du réseau de Visa en vue de bâtir un avenir durable. Les résultats de cette collaboration devraient être disponibles au cours de l’été 2021. La collaboration de Visa avec le CISL vient compléter les efforts de la société consistant à travailler avec son réseau pour soutenir un avenir à faible empreinte carbone, parmi lesquels : Des partenariats qui promeuvent les cartes de paiement et les comptes durables Des initiatives mondiales qui soutiennent les comportements durables, notamment dans les domaines de la mobilité et des voyages Le développement de renseignements durables pour aider les parties prenantes du secteur commercial à comprendre les obstacles des consommateurs ainsi que les moteurs de comportements durables L’utilisation des plateformes de la marque pour inciter un mode de vie durable parmi les millions de consommateurs Les nouveaux objectifs et efforts de Visa afin de soutenir le commerce durable s’appuient sur le leadership sectoriel reconnu et existant de la société en matière de durabilité, notamment son inclusion dans les classements suivants : Indice nord-américain de durabilité Dow Jones, Sociétés les plus responsables d’Amérique, 100 meilleures entreprises citoyennes, et 100 entreprises les plus justes. Pour en savoir plus, rendez-vous sur : https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html. À propos de Visa Inc. Visa est le leader mondial des paiements numériques. Notre mission est de relier le monde grâce au réseau de paiement le plus innovant, le plus fiable et le plus sûr, et, ce faisant, de permettre aux individus, aux entreprises et aux économies de prospérer. Notre réseau de traitement global de pointe, VisaNet, fournit des paiements sécurisés et fiables dans le monde entier, et est capable de gérer plus de 65 000 messages de transaction par seconde. La focalisation incessante de la société sur l’innovation est un catalyseur pour la croissance rapide du commerce connecté sur tout type d’appareil. À l’heure où le monde est en train de passer de l’analogique au numérique, Visa met à disposition sa marque, ses produits, ses employés, son réseau et son envergure pour remodeler l’avenir du commerce. Pour en savoir plus, rendez-vous sur usa.visa.com/about-visa.html, usa.visa.com/visa-everywhere/blog.html et @VisaNews. Le présent communiqué de presse contient des déclarations prévisionnelles au sens de la loi américaine « Private Securities Litigation Reform Act » de 1995. Ces déclarations prévisionnelles sont généralement identifiées par l’usage du futur ou du conditionnel, ainsi que par des expressions telles que « prévoit de », « s’attendre à », et autres expressions similaires. Parmi les exemples de déclarations prévisionnelles figurent, sans toutefois s’y limiter, les déclarations que nous formulons concernant le calendrier et la probabilité de prendre des mesures liées à notre stratégie, nos projets et nos initiatives et objectifs climatiques futurs, ainsi que l’impact potentiel de nos actions. Par nature, les déclarations prévisionnelles : (i) n’ont de valeur qu’à la date où elles sont formulées, (ii) ne sont ni des énoncés de faits historiques, ni des garanties de performance future et (iii) sont assujetties à des risques, incertitudes, hypothèses et changements de circonstances qui sont difficiles à prévoir ou à quantifier. C'est pourquoi, les résultats réels pourraient différer sensiblement et défavorablement des déclarations prévisionnelles de Visa en raison d'une variété de facteurs, notamment ceux qui figurent dans notre Rapport annuel sur formulaire 10-K pour l'exercice financier clos le 30 septembre 2020 et nos autres rapports déposés auprès de la Securities and Exchange Commission des États-Unis. Le lecteur est donc prié de ne pas se fier outre mesure aux dites déclarations prévisionnelles. Sauf dans les cas où la loi l’exigerait, Visa Inc. ne prévoit nullement de mettre à jour ou de réviser ses déclarations prévisionnelles quelles qu’elles soient, en réponse à de nouvelles informations, à des événements futurs ou pour d’autres raisons. i L’accomplissement de cet objectif de neutralité carbone couvre l’empreinte des émissions de gaz à effet de serre concernant les émissions du Scope 1 (sources propres), du Scope 2 (électricité acquise), ainsi que plusieurs éléments liés aux voyages d’affaires et déplacements quotidiens des employés concernant les émissions du Scope 3 (chaîne de valeur) de Visa. Les Scopes 1, 2 et 3 sont définis par le Protocole des gaz à effet de serre du World Resources Institute (WRI) et du World Business Council for Sustainable Development (WBCSD). Le texte du communiqué issu d’une traduction ne doit d’aucune manière être considéré comme officiel. La seule version du communiqué qui fasse foi est celle du communiqué dans sa langue d’origine. La traduction devra toujours être confrontée au texte source, qui fera jurisprudence.",
    "url": "https://www.businesswire.com/news/home/20210421006146/fr/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-22T02:11:00-04:00",
    "date_et": "2021-04-22"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-22 04:41:00",
    "publisher": "Business Wire",
    "title": "Visa vertieft das weltweite Engagement für ökologische Nachhaltigkeit mit der Zusage, bis 2040 Netto-Null-Emissionen zu erreichen",
    "image": "https://images.financialmodelingprep.com/news/visa-vertieft-das-weltweite-engagement-fr-kologische-nachhaltigkeit-mit-20210422.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), ein weltweit führendes Unternehmen für Zahlungstechnologie, gab heute eine neue globale Verpflichtung bekannt, bis 2040 Netto-Null-Emissionen zu erreichen, und dass das Unternehmen im Jahr 2020 eine CO2-Neutralität in allen Geschäftsbereichen erreicht hat.i Visa skizzierte auch Pläne, durch neue Partnerschaften und erweiterte Initiativen zur Unterstützung eines nachhaltigen Handels und des Übergangs zu einer kohlenstoffarmen Wirtschaft über den eigenen Fußabdruck hinaus ein klimapositives Unternehmen zu werden. „Visa setzt sich für eine nachhaltigere Zukunft ein“, sagte Al Kelly, Vorsitzender und CEO von Visa. „Unser neues Netto-Null-Engagement und die verstärkten Anstrengungen in unserem Netzwerk zur Unterstützung nachhaltiger Initiativen sind unmittelbare Wege, um unsere Ziele zu erreichen und eine bessere Zukunft für unseren Planeten aufzubauen.“ Netto-Null bis 2040 – 10 Jahre vor dem Ziel des Pariser Klimaabkommens Im Rahmen der Verpflichtung, bis 2040 Netto-Null-Emissionen zu erreichen, gab Visa bekannt, dass es ein neuer Unterzeichner des Klimaschutzversprechens ist, einer Initiative, die von Amazon und Global Optimism gemeinsam gegründet wurde, sowie ein neues Mitglied des Climate Business Network, einer Initiative des World Wildlife Fund (WWF), um Maßnahmen für eine Netto-Null-Zukunft zu beschleunigen. Das Netto-Null-Engagement von Visa richtet sich nach neuen globalen Standards und Definitionen und umfasst Bemühungen der Anbieter, einen erheblichen Teil des Treibhausgas-Fußabdrucks der gekauften Waren und Dienstleistungen des Unternehmens zu verringern. Visa hat sich außerdem verpflichtet, wissenschaftlich fundierte Ziele im Rahmen der Initiative „Science Based Target“ auf dem Anspruchsniveau von 1,5 Grad Celsius festzulegen. Diese neuen Verpflichtungen ergänzen die bestehende Nachhaltigkeitsführerschaft von Visa, einschließlich des Übergangs zu 100 Prozent erneuerbarem Strom im Jahr 2020. „In diesem Erdmonat nutzt Visa die Kraft unseres Netzwerks, um die Transformation in Bezug auf Nachhaltigkeit und wirtschaftliche Erholung zu beschleunigen und gleichzeitig sicherzustellen, dass der Planet und die Volkswirtschaften auf der ganzen Welt gedeihen“, sagte Douglas Sabo, Chief Sustainability Officer von Visa. „Indem wir saubere Energie und nachhaltige Praktiken priorisieren, in umweltinnovative Initiativen investieren und mit Führungskräften der Unternehmen und der Zivilgesellschaft in Bezug auf das Klima zusammenarbeiten, setzen wir uns dafür ein, Teil der globalen Lösung für den Klimawandel zu sein.“ Unterstützung des nachhaltigen Handels Visa erweitert seine Initiativen, um seine Produkte, Dienstleistungen, Netzwerke, Daten, Zahlungskompetenz und Marke zu nutzen, um einen nachhaltigen Handel und den Übergang zu einer kohlenstoffarmen Wirtschaft zu unterstützen. Heute gab Visa seine Zusammenarbeit mit dem Cambridge Institute for Sustainability Leadership (CISL) bekannt, um gemeinsam neue Möglichkeiten für die Anwendung elektronischer Zahlungsfunktionen und das Visa Netzwerk zur Verwirklichung einer nachhaltigen Zukunft zu ermitteln. Die Ergebnisse der Zusammenarbeit werden im Sommer 2021 erwartet. Die Zusammenarbeit von Visa mit CISL ergänzt die Bemühungen des Unternehmens, über sein Netzwerk hinweg für eine kohlenstoffarme Zukunft zu arbeiten, einschließlich: Partnerschaften zur Förderung nachhaltiger Zahlungskarten und -konten Globalen Initiativen zur Unterstützung nachhaltiger Verhaltensweisen wie Mobilität und Reisen Entwicklungen nachhaltiger Erkenntnisse zur Unterstützung von Akteuren im Handel beim Verständnis von Verbraucherbarrieren und Treibern für ein nachhaltiges Lebensverhalten Nutzung der Plattformen der Marke, um ein nachhaltiges Leben bei Millionen von Verbrauchern zu fördern Die neuen Ziele und Bemühungen von Visa zur Unterstützung eines nachhaltigen Handels bauen auf der bestehenden anerkannten Branchenführerschaft des Unternehmens im Bereich Nachhaltigkeit auf, einschließlich der Einbeziehung folgender Punkte: Dow Jones Sustainability North American Index, America’s Most Responsible Companies, 100 Best Corporate Citizens und 100 Most Just Companies. Für weitere Informationen, besuchen Sie bitte: https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html. Über Visa Inc. Visa ist der weltweite Marktführer im digitalen Zahlungsverkehr. Es ist unser Auftrag, die Welt durch das innovativste, zuverlässigste und sicherste Zahlungsnetzwerk zu verbinden und so Einzelpersonen, Unternehmen und Volkswirtschaften zum Erfolg zu verhelfen. Unser fortschrittliches Transaktionsverarbeitungsnetzwerk VisaNet gewährleistet sicheres und zuverlässiges Bezahlen rund um die Welt und bietet Kapazitäten zur Verarbeitung von mehr als 65.000 Transaktionsmeldungen pro Sekunde. Der unermüdliche Fokus des Unternehmens auf Innovationen ist ein Motor für das schnelle Wachstum des vernetzten Handels über alle Geräte. So wie sich die Welt zunehmend von analog zu digital entwickelt, setzt Visa unsere Marke, Produkte, Mitarbeiter, unser Netzwerk und unsere breite Präsenz dafür ein, die Zukunft des Handels neu zu gestalten. Weitere Informationen finden Sie unter usa.visa.com/about-visa.html, usa.visa.com/visa-everywhere/blog.html und @VisaNews. Diese Pressemitteilung enthält zukunftsgerichtete Aussagen im Sinne des US-amerikanischen Private Securities Litigation Reform Act von 1995. Zukunftsgerichtete Aussagen erkennt man generell an Ausdrücken wie „werden“, „planen“, „wird erwartet“ und anderen, ähnlichen Begriffen. Beispiele für zukunftsgerichtete Aussagen sind unter anderem Aussagen zum Zeitpunkt und zur Wahrscheinlichkeit von Maßnahmen im Zusammenhang mit unserer Strategie, zu Plänen für künftige Klimaschutzinitiativen und -ziele sowie zu den möglichen Auswirkungen unserer Maßnahmen. Zukunftsgerichtete Aussagen sind durch folgende Merkmale gekennzeichnet: (i) Sie gelten nur zum Zeitpunkt ihrer Veröffentlichung, (ii) sie stellen weder historische Tatsachen noch Gewährleistungen für zukünftige Leistungen dar und (iii) sie unterliegen Risiken, Ungewissheiten, Annahmen und Veränderungen der Umstände, die sich nur schwer abschätzen oder in Zahlen ausdrücken lassen. Daher können die tatsächlichen Ergebnisse erheblich und nachteilig von den zukunftsgerichteten Aussagen von Visa abweichen. Dies ist auf eine Reihe von Faktoren zurückzuführen, darunter die in unserem Jahresbericht auf Formular 10-K für das am 30. September 2020 endenden Geschäftsjahr enthaltenen und unsere anderen bei der US-amerikanischen Börsenaufsichtsbehörde eingereichten Unterlagen. Bitte vertrauen Sie nicht in unangemessener Weise auf diese zukunftsgerichteten Aussagen. Wir beabsichtigen nicht, zukunftsgerichtete Aussagen aufgrund neuer Informationen, zukünftiger Geschehnisse oder anderer Gegebenheiten zu aktualisieren oder zu ändern, sofern dies vom Gesetzgeber nicht ausdrücklich vorgeschrieben wird. i Diese Errungenschaft in Bezug auf die CO2-Neutralität deckt den Fußabdruck der Treibhausgasemissionen von Visa Bereich 1 (eigene Quelle), Bereich 2 (gekaufter Strom) sowie Geschäftsreisen und Pendlerelemente der Bereich 3-Emissionen (Wertschöpfungskette) ab. Die Bereiche 1, 2 und 3 sind im Treibhausgasprotokoll des World Resources Institute (WRI) und des World Business Council für nachhaltige Entwicklung (WBCSD) definiert. Die Ausgangssprache, in der der Originaltext veröffentlicht wird, ist die offizielle und autorisierte Version. Übersetzungen werden zur besseren Verständigung mitgeliefert. Nur die Sprachversion, die im Original veröffentlicht wurde, ist rechtsgültig. Gleichen Sie deshalb Übersetzungen mit der originalen Sprachversion der Veröffentlichung ab.",
    "url": "https://www.businesswire.com/news/home/20210422005477/de/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-22T04:41:00-04:00",
    "date_et": "2021-04-22"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-22 08:07:53",
    "publisher": "24/7 Wall Street",
    "title": "Handicapping the Biden climate summit; plus the OECD's dire 2050 outlook",
    "image": "https://images.financialmodelingprep.com/news/handicapping-the-biden-climate-summit-plus-the-oecds-dire-20210422.jpg",
    "site": "247wallst.com",
    "text": "By David Callaway, Callaway Climate Insights The corporate pledges are lining up for Earth Day.",
    "url": "https://247wallst.com/investing/2021/04/22/handicapping-the-biden-climate-summit-plus-the-oecds-dire-2050-outlook/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-22T08:07:53-04:00",
    "date_et": "2021-04-22"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-23 02:54:00",
    "publisher": "Business Wire",
    "title": "ビザ、2040年までに排出量ネットゼロ到達を誓約し、環境の持続可能性への世界的な取組みを深める",
    "image": "https://images.financialmodelingprep.com/news/2040-20210423.png",
    "site": "businesswire.com",
    "text": "サンフランシスコ--(BUSINESS WIRE)--（ビジネスワイヤ） -- 世界をリードする決済テクノロジー企業のビザ（NYSE：V）は本日、2040年までに排出量ネットゼロに到達するという新たな世界的取組みを発表し、2020年に事業全体でカーボン・ニュートラルを達成したことを明らかにしましたi。ビザはまた、自社のフットプリントを超え、持続可能な商取引と低炭素経済への移行をサポートする新たなパートナーシップと拡大されたイニシアチブを通じて、気候にプラスの影響をもたらす企業になるための計画の概要を明らかにしました。 ビザの会長兼最高経営責任者のアル・ケリーは、次のように述べています。「ビザは、より持続可能な未来を創ることに力を注いでいます。私たちの新しいネットゼロの取組みと、持続可能なイニシアチブをサポートするネットワークを通じた一層の努力は、地球のより良い未来を築くことに貢献するという私たちの目標を達成するための直接的な手段です。」 パリ気候協定の目標に10年先駆け－2040年までにネットゼロ 2040年までに排出量ネットゼロに到達するという取組みの一環として、ビザは、アマゾンとグローバル・オプティミズムが共同で立ち上げたイニシアチブ「クライメート・プレッジ」の新しい署名企業になり、ネットゼロの未来に向けた行動を加速するための世界自然保護基金（WWF）のイニシアチブ「クライメート・ビジネス・ネットワーク」の新メンバーとなったことを発表しました。ビザのネットゼロへの取組みは、新しい世界的基準と定義に沿っており、当社が購入する物品やサービスの温室効果ガスのフットプリントの大部分を削減するためのサプライヤーとの努力が含まれます。ビザはまた、科学に基づく目標イニシアチブを通じて、摂氏1.5度の野心的レベルで、科学的根拠に基づいた目標を設定することを約束しています。これらの新しい取組みが、2020年の100パーセント再生可能電力使用への移行など、ビザの既存の持続可能性リーダーシップに加わります。 ビザの最高持続可能性責任者のダグラス・サボは、次のように述べています。「このアース月間に、ビザはネットワークの力を利用して、持続可能性と経済回復における変革を加速すると同時に、地球と世界中の経済が確実に繁栄することに貢献しています。クリーンエネルギーと持続可能な慣行の優先や、環境面で革新的なイニシアチブへの投資、気候に関する企業や市民社会のリーダーとの協働によって、私たちは気候変動に対する世界的なソリューションの一部となることに全力で取組んでいます。」 持続可能な商取引のサポート ビザは、その製品、サービス、ネットワーク、データ、決済の専門知識、ブランドを活用して持続可能な商取引と低炭素経済への移行をサポートするイニシアチブを拡大しています。本日ビザは、ケンブリッジ・サステナビリティー・リーダーシップ研究所（CISL）との協働を発表しました。これは、持続可能な未来の実現に向けて、電子決済機能とビザのネットワークを適用する新たな機会を特定するための協力を目的としています。この協働の結果は、2021年夏に得られることが予定されています。 ビザとCISLの協働は、低炭素未来のサポートにネットワーク全体で取り組むための当社の以下を含む努力を補完します。 持続可能な決済カードおよび口座を促進するパートナーシップ 移動や旅行などにおける持続可能な行動をサポートする世界的なイニシアチブ 商業のステークホルダーが、消費者の持続可能な生活行動の障壁と推進力を理解する助けとなる持続可能な洞察の開発 何百万人の消費者の持続可能な生活を奨励するためのブランドのプラットフォームの活用 持続可能な商取引のサポートに向けたビザの新しい目標と努力は、持続可能性における当社の既存の広く認められた業界リーダーシップを基盤として構築されており、当社は、ダウ・ジョーンズ・サステナビリティ北米指数、米国で最も責任ある企業、企業市民ベスト100社、最も公正な企業100社に含まれています。 詳細情報については、こちらをご覧ください：https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html ビザについて ビザは、デジタル決済で世界をリードしています。その使命は、安全で信頼のおける革新的な決済ネットワークで世界を結び、消費者、企業、経済全体に利便性をもたらすことです。当社の高度な世界的処理ネットワークのVisaNetは、安全で信頼性の高い決済手段を世界で提供し、毎秒6万5000件を超える取引を処理する能力を備えています。当社の技術革新に対する献身は、端末を問わず利用できるコネクテッド・コマースの急速な成長を推進しています。世界規模でアナログからデジタルへの移行が進む今、ビザは当社のブランド、商品、人材、ネットワーク、スケールを活用して、商取引の新たな未来を切り開きます。詳細情報については、usa.visa.com/about-visa.html、usa.visa.com/visa-everywhere/blog.html、@VisaNewsをご覧ください。 本リリースには、1995年米国民事証券訴訟改革法の意味における将来見通しに関する記述が含まれています。将来見通しに関する記述は一般に、「予定である」、「計画する」、「見込まれる」といった文言や、その他の同様の表現によって特定されます。将来見通しに関する記述の例には、当社が戦略に関連した行動を取る時期と可能性、将来の気候イニシアチブの計画および目標、当社の行動の潜在的な影響に関する記述が含まれますが、これらに限定されません。その性質上、将来見通しに関する記述は、（i）その記述がなされた日付時点での記述であり、（ii）過去の事実に関する記述または将来の業績を保証するものではなく、（iii）予想や定量化が難しいリスク、不確実性、前提および環境変化の影響を受けます。したがって、実際の結果は、フォーム10-Kによる2020年9月30日締めの会計年度の当社の年次報告書および米証券取引委員会への当社のその他の提出書類に記載されたものを含むさまざまな要因によって、ビザの将来見通しに関する記述と大幅に悪い方向に異なるものとなる可能性があります。このような記述に過度の信頼を置かないようご注意ください。法律で義務付けられる場合を除き、当社は新たな情報、将来の展開、またはその他の結果として、いかなる将来見通しに関する記述も更新または改定する意図はありません。 i このカーボン・ニュートラルの達成は、ビザのスコープ1（所有する排出源）とスコープ2（購入電力）に加えて、スコープ3（バリューチェーン）排出量のうち出張と従業員の通勤の要素からの温室効果ガス排出量フットプリントについてのものです。スコープ1、2、3は、世界資源研究所（WRI）と持続可能な開発のための世界経済人会議（WBCSD）の温室効果ガス・プロトコルによって定義されています。 本記者発表文の公式バージョンはオリジナル言語版です。翻訳言語版は、読者の便宜を図る目的で提供されたものであり、法的効力を持ちません。翻訳言語版を資料としてご利用になる際には、法的効力を有する唯一のバージョンであるオリジナル言語版と照らし合わせて頂くようお願い致します。",
    "url": "https://www.businesswire.com/news/home/20210422006220/ja/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-23T02:54:00-04:00",
    "date_et": "2021-04-23"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-23 12:46:19",
    "publisher": "Zacks Investment Research",
    "title": "Will Visa's (V) Beat Streak be Sustained in Q2 Earnings?",
    "image": "https://images.financialmodelingprep.com/news/will-visas-v-beat-streak-be-sustained-in-q2-earnings-20210423.jpg",
    "site": "zacks.com",
    "text": "Visas (V) fiscal Q2 results are likely to reflect higher data processing, services and other revenue growth, partly offset by lower international transaction services revenues.",
    "url": "https://www.zacks.com/stock/news/1442352/will-visas-v-beat-streak-be-sustained-in-q2-earnings",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-23T12:46:19-04:00",
    "date_et": "2021-04-23"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-26 09:46:30",
    "publisher": "Zacks Investment Research",
    "title": "Should You Buy Visa (V) Ahead of Earnings?",
    "image": "https://images.financialmodelingprep.com/news/should-you-buy-visa-v-ahead-of-earnings-20210426.jpg",
    "site": "zacks.com",
    "text": "Visa (V) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season.",
    "url": "https://www.zacks.com/stock/news/1455815/should-you-buy-visa-v-ahead-of-earnings",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-26T09:46:30-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-26 10:47:24",
    "publisher": "Benzinga",
    "title": "Visa Earnings Preview",
    "image": "https://images.financialmodelingprep.com/news/visa-earnings-preview-20210426.jpg",
    "site": "benzinga.com",
    "text": "On Tuesday, April 27, Visa (NYSE:V) will release its latest earnings report. Here is Benzinga's outlook for the company.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20792459/visa-earnings-preview",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-26T10:47:24-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-26 10:49:02",
    "publisher": "PYMNTS",
    "title": "Visa, Mastercard Earnings To Anticipate Credit Rebound And Contactless Surge",
    "image": "https://images.financialmodelingprep.com/news/visa-mastercard-earnings-to-anticipate-credit-rebound-and-contactless-20210426.jpg",
    "site": "pymnts.com",
    "text": "The big banks have reported – and now come the payment networks (and, by extension, the cards). This week, the earnings deluge continues, where a number of payments-focused companies will report their first-quarter results, giving insight into where consumers have been spending – and where they have not.",
    "url": "https://www.pymnts.com/earnings/2021/visa-mastercard-earnings-to-anticipate-credit-rebound-contactless-surge/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-26T10:49:02-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-26 11:43:49",
    "publisher": "GuruFocus",
    "title": "A Trio of Stocks With a Record of Operating Income Margin Growth",
    "image": "https://images.financialmodelingprep.com/news/a-trio-of-stocks-with-a-record-of-operating-20210426.jpg",
    "site": "gurufocus.com",
    "text": "When the operating income margin keeps on expanding, it typically means that the company is successful in implementing policies that keep expenses well below profits.",
    "url": "https://www.gurufocus.com/news/1406307/a-trio-of-stocks-with-a-record-of-operating-income-margin-growth",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-26T11:43:49-04:00",
    "date_et": "2021-04-26"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 04:35:31",
    "publisher": "Benzinga",
    "title": "7 Stocks To Watch For April 27, 2021",
    "image": "https://images.financialmodelingprep.com/news/7-stocks-to-watch-for-april-27-2021-20210427.jpg",
    "site": "benzinga.com",
    "text": "Some of the stocks that may grab investor focus today are: Wall Street expects General Electric Company (NYSE: GE) to report quarterly earnings at $0.01 per share on revenue of $17.52 billion before the opening bell. GE shares gained 0.2% to close at $13.57 on Monday.",
    "url": "https://www.benzinga.com/news/earnings/21/04/20806387/7-stocks-to-watch-for-april-27-2021",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T04:35:31-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 10:10:00",
    "publisher": "Forbes",
    "title": "Earnings Beat On The Cards For Visa?",
    "image": "https://images.financialmodelingprep.com/news/earnings-beat-on-the-cards-for-visa-20210427.jpg",
    "site": "forbes.com",
    "text": "Visa is scheduled to report its fiscal Q2 2021 results after the market closes on Tuesday, April 27. We expect Visa to beat the consensus estimates for revenues and earnings.",
    "url": "https://www.forbes.com/sites/greatspeculations/2021/04/27/earnings-beat-on-the-cards-for-visa/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T10:10:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 11:30:34",
    "publisher": "Investor's Business Daily",
    "title": "Visa, Mastercard Earnings On Tap With Payment Archrivals At Buy Points",
    "image": "https://images.financialmodelingprep.com/news/visa-mastercard-earnings-on-tap-with-payment-archrivals-at-20210427.jpg",
    "site": "investors.com",
    "text": "Visa earnings are on tap as the U.S. economy reopens amid the vaccine rollout. Mastercard earnings are early Thursday.",
    "url": "https://www.investors.com/news/visa-stock-visa-mastercard-earnings/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T11:30:34-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 16:08:00",
    "publisher": "Business Wire",
    "title": "Visa Inc. Fiscal Second Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/visa-inc-fiscal-second-quarter-2021-financial-results-20210427.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa Inc. (NYSE: V) today announced its fiscal second quarter 2021 financial results through an earnings release that will be furnished with the Securities and Exchange Commission on a Form 8-K and will be available on its Investor Relations website at http://investor.visa.com/sec-filings/default.aspx. Visa will host a live audio webcast at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time) to discuss these financial results. The webcast and all related materials can also be accessed through Visa’s Investor Relations website at http://investor.visa.com/financial-information/quarterly-earnings/default.aspx. About Visa Inc. Visa Inc. (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network – enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews.",
    "url": "https://www.businesswire.com/news/home/20210427006119/en/Visa-Inc.-Fiscal-Second-Quarter-2021-Financial-Results",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T16:08:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 16:08:00",
    "publisher": "Business Wire",
    "title": "Visa Inc. Fiscal Second Quarter 2021 Financial Results",
    "image": "https://images.financialmodelingprep.com/news/visa-inc-fiscal-second-quarter-2021-financial-results-20210427.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa Inc. (NYSE: V) today announced its fiscal second quarter 2021 financial results through an earnings release that will be furnished with the Securities and Exchange Commission on a Form 8-K and will be available on its Investor Relations website at http://investor.visa.com/sec-filings/default.aspx. Visa will host a live audio webcast at 2:00 p.m. Pacific Time (5:00 p.m. Eastern Time) to discuss these financial results. The webcast and all related materials ca",
    "url": "https://www.businesswire.com/news/home/20210427006119/en/Visa-Inc.-Fiscal-Second-Quarter-2021-Financial-Results/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T16:08:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 16:42:00",
    "publisher": "Market Watch",
    "title": "Earnings Results: Visa stock gains after earnings beat, return to growth for credit transactions",
    "image": "https://images.financialmodelingprep.com/news/earnings-results-visa-stock-gains-after-earnings-beat-return-to-20210427.jpg",
    "site": "marketwatch.com",
    "text": "Shares of Visa Inc. were up more than 1% in after-hours trading Wednesday after the company topped expectations with its latest results and saw a return to growth for credit transactions.",
    "url": "https://www.marketwatch.com/story/visa-stock-gains-after-earnings-beat-return-to-growth-for-credit-transactions-11619556175",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T16:42:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 17:17:16",
    "publisher": "Zacks Investment Research",
    "title": "5 Spectacularly Perfect Earnings Charts",
    "image": "https://images.financialmodelingprep.com/news/5-spectacularly-perfect-earnings-charts-20210427.jpg",
    "site": "zacks.com",
    "text": "These 5 companies haven't missed on earnings in 5 years. Amazing.",
    "url": "https://www.zacks.com/stock/news/1463255/5-spectacularly-perfect-earnings-charts",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T17:17:16-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-27 23:58:00",
    "publisher": "PYMNTS",
    "title": "Visa Direct Transactions Surge Almost 60 Pct YoY",
    "image": "https://images.financialmodelingprep.com/news/visa-direct-transactions-surge-almost-60-pct-yoy-20210427.jpg",
    "site": "pymnts.com",
    "text": "Visa posted second quarter fiscal year earnings results that showed continued momentum in debit spending and tap to pay, some lessening of the headwinds in cross-border payments — and green shoots emerging in credit. Revenues of $5.7 billion were down 2 percent year over year but were better than the $5.5 billion analysts expected.",
    "url": "https://www.pymnts.com/earnings/2021/visa-direct-transactions-surge-almost-60-percent/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-27T23:58:00-04:00",
    "date_et": "2021-04-27"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 00:18:03",
    "publisher": "Seeking Alpha",
    "title": "Visa's (V) CEO Al Kelly on Q2 2021 Results - Earnings Call Transcript",
    "image": "https://images.financialmodelingprep.com/news/visas-v-ceo-al-kelly-on-q2-2021-results-earnings-20210428.jpg",
    "site": "seekingalpha.com",
    "text": "Visa's (V) CEO Al Kelly on Q2 2021 Results - Earnings Call Transcript",
    "url": "https://seekingalpha.com/article/4421837-visas-v-ceo-al-kelly-on-q2-2021-results-earnings-call-transcript",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T00:18:03-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 00:19:10",
    "publisher": "The Motley Fool",
    "title": "Visa Rises After Hours on Q1 Beats",
    "image": "https://images.financialmodelingprep.com/news/visa-rises-after-hours-on-q1-beats-20210428.jpg",
    "site": "fool.com",
    "text": "The payment card giant isn't struggling as badly as other big companies in the later stages of the coronavirus pandemic.",
    "url": "https://www.fool.com/investing/2021/04/28/visa-rises-after-hours-on-q1-beats/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T00:19:10-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 05:41:41",
    "publisher": "TechCrunch",
    "title": "Ivorian startup Afrikrea partners with DHL and Visa to launch SaaS e-commerce platform ANKA",
    "image": "https://images.financialmodelingprep.com/news/ivorian-startup-afrikrea-partners-with-dhl-and-visa-to-20210428.jpg",
    "site": "techcrunch.com",
    "text": "In 2016, Ivorian e-commerce startup Afrikrea started as a marketplace for African-based and inspired clothing, accessories, arts, and crafts. Over the past five years, Afrikrea has served more than 7,000 sellers from 47 African countries and buyers from 170 countries.",
    "url": "https://techcrunch.com/2021/04/28/ivorian-startup-afrikrea-partners-with-dhl-and-visa-to-launch-saas-e-commerce-platform-anka/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T05:41:41-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa and Airbnb Partner To Get Hosts Paid Faster With Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-and-airbnb-partner-to-get-hosts-paid-faster-with-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE:V), the world’s leader in digital payments, and Airbnb (NASDAQ: ABNB), a leading online marketplace for lodging and experiences, today announced Airbnb Hosts in select markets will be able to access their earnings more quickly. Through Airbnb’s use of Visa Direct[1], Visa’s real-time[2] push payments platform, Hosts will have an option to move money from Airbnb to a bank account associated with an eligible Visa debit card. “Giving people access to money they’ve earned when they earn it is a powerful driver to support communities and the recovery of the global economy,” said Ruben Salazar, SVP and Global Head of Visa Direct. “Visa Direct capabilities on the Airbnb platform can help improve cashflow for Hosts, allowing them to focus on welcoming travelers eager to explore the world again.” Despite a challenging year, the future is looking brighter as people plan safe getaways in the months and years to come. In fact, more than 60% of US consumers say they’re now ready to travel[3]. The enhanced payouts experience with Visa Direct can help give hosts better control of their finances so they can continue providing more guests with unique and memorable experiences. “As one of the first travel platforms to enable Visa Direct, this new functionality will help our Host community access their earnings more quickly,” said Sam Shrauger, Vice President of Payments at Airbnb. “We are always listening to our Hosts and seeking ways to better meet their needs, and Visa Direct can play an important role in providing faster payouts for Hosts,” continued Shrauger. This collaboration is the latest in a series of Visa initiatives to help its financial-institution clients enable buyers and sellers access to tools and resources they need to build stronger business operations and move money around the world at a time when real time payments have never been more important. The new solution for Airbnb Hosts is expected to be available over the course of the next year. Visit Visa Direct to learn more about how Visa can help unlock new ways to move money. About Visa Inc. Visa Inc. (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network - enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device, for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews. About Airbnb Airbnb was born in 2007 when two Hosts welcomed three guests to their San Francisco home, and has since grown to 4 million Hosts who have welcomed over 800 million guest arrivals in almost every country across the globe. Every day, Hosts offer one-of-a-kind stays and unique Experiences that make it possible for guests to experience the world in a more authentic, connected way. [1] Visa Direct capability enabled through Airbnb’s financial institution partners. [2] Actual fund availability depends on receiving financial institution and region. [3] Visa Business and Economic Insights: American Mood Trend. April 2021.",
    "url": "https://www.businesswire.com/news/home/20210428005375/en/Visa-and-Airbnb-Partner-To-Get-Hosts-Paid-Faster-With-Visa-Direct",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T07:00:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa and Airbnb Partner To Get Hosts Paid Faster With Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-and-airbnb-partner-to-get-hosts-paid-faster-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE:V), the world's leader in digital payments, and Airbnb (NASDAQ: ABNB), a leading online marketplace for lodging and experiences, today announced Airbnb Hosts in select markets will be able to access their earnings more quickly. Through Airbnb's use of Visa Direct[1], Visa's real-time[2] push payments platform, Hosts will have an option to move money from Airbnb to a bank account associated with an eligible Visa debit card. “Giving people access to mone",
    "url": "https://www.businesswire.com/news/home/20210428005375/en/Visa-and-Airbnb-Partner-To-Get-Hosts-Paid-Faster-With-Visa-Direct/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T07:00:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 09:41:00",
    "publisher": "Business Wire",
    "title": "Visa en Airbnb-partner om hosts sneller betaald te krijgen met Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-en-airbnbpartner-om-hosts-sneller-betaald-te-krijgen-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), ‘s werelds leider in digitale betalingen, en Airbnb (NASDAQ: ABNB), een toonaangevende online marktplaats voor accommodatie en ervaringen, hebben vandaag aangekondigd dat Airbnb-hosts in geselecteerde markten in staat zullen zijn om sneller toegang krijgen tot hun inkomsten. Door Airbnb’s gebruik van Visa Direct Visa’s realtime pushbetalingsplatform, hebben verhuurders de mogelijkheid om geld van Airbnb over te boeken naar een bankrekening die is gekoppeld aan een in aanmerking komende Visa-betaalpas. “Mensen toegang geven tot geld dat ze hebben verdiend wanneer ze het verdienen, is een krachtige motor om gemeenschappen en het herstel van de wereldeconomie te ondersteunen”, aldus Ruben Salazar, SVP en Global Head van Visa Direct. “Visa Direct-mogelijkheden op het Airbnb-platform kunnen de cashflow voor verhuurders helpen verbeteren, waardoor ze zich kunnen concentreren op het verwelkomen van reizigers die graag de wereld opnieuw willen verkennen.” Deze bekendmaking is officieel geldend in de originele brontaal. Vertalingen zijn slechts als leeshulp bedoeld en moeten worden vergeleken met de tekst in de brontaal, die als enige rechtsgeldig is.",
    "url": "https://www.businesswire.com/news/home/20210428005697/nl/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T09:41:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 10:02:33",
    "publisher": "Zacks Investment Research",
    "title": "Traders Looking for Markets to Wake up",
    "image": "https://images.financialmodelingprep.com/news/traders-looking-for-markets-to-wake-up-20210428.jpg",
    "site": "zacks.com",
    "text": "Traders Looking for Markets to Wake up",
    "url": "https://www.zacks.com/commentary/1466533/traders-looking-for-markets-to-wake-up",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T10:02:33-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 10:19:37",
    "publisher": "Schaeffers Research",
    "title": "Visa Stock Blasted with Bull Notes After Earnings",
    "image": "https://images.financialmodelingprep.com/news/visa-stock-blasted-with-bull-notes-after-earnings-20210428.jpg",
    "site": "schaeffersresearch.com",
    "text": "The shares of Visa Inc (NYSE:V) are up 1.2% to trade at $232.75 at last check, after the credit card giant reported better-than-expected fiscal second-quarter earnings and revenue.",
    "url": "https://www.schaeffersresearch.com/content/news/2021/04/28/visa-stock-blasted-with-bull-notes-after-earnings",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T10:19:37-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 12:17:26",
    "publisher": "Zacks Investment Research",
    "title": "Visa's (V) Earnings and Revenues Surpass Estimates in Q2",
    "image": "https://images.financialmodelingprep.com/news/visas-v-earnings-and-revenues-surpass-estimates-in-q2-20210428.jpg",
    "site": "zacks.com",
    "text": "Visa's (V) Q2 results reflect gains in payments volume and processed transactions, partly offset by softness in cross-border volumes.",
    "url": "https://www.zacks.com/stock/news/1467784/visas-v-earnings-and-revenues-surpass-estimates-in-q2",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T12:17:26-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 12:34:00",
    "publisher": "Business Wire",
    "title": "Visa e Airbnb stringono un accordo di collaborazione per consentire ai proprietari di alloggi di essere pagati più rapidamente con Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-e-airbnb-stringono-un-accordo-di-collaborazione-per-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa Inc. (NYSE: V), leader mondiale nel settore dei pagamenti digitali, e Airbnb (NASDAQ: ABNB), importante mercato online nel settore dell’ospitalità e delle esperienze di viaggio, hanno annunciato oggi che i proprietari di alloggi di Airbnb in determinati mercati potranno accedere più rapidamente ai propri utili. Attraverso l’utilizzo da parte di Airbnb di Visa Direct[1], la piattaforma di pagamento in tempo reale da debitore a creditore (push) di Visa[2], i proprietari di alloggi avranno la possibilità di trasferire denaro da Airbnb a un conto bancario associato a una carta di debito Visa idonea. “Consentire alle persone di accedere in tempo reale ai propri guadagni è uno strumento potente per supportare le comunità e la ripresa dell’economia globale”, ha dichiarato Ruben Salazar, vicepresidente senior e responsabile globale di Visa Direct. Il testo originale del presente annuncio, redatto nella lingua di partenza, è la versione ufficiale che fa fede. Le traduzioni sono offerte unicamente per comodità del lettore e devono rinviare al testo in lingua originale, che è l'unico giuridicamente valido.",
    "url": "https://www.businesswire.com/news/home/20210428005884/it/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T12:34:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 19:50:00",
    "publisher": "Business Wire",
    "title": "Visa et Airbnb s'associent pour permettre aux Hôtes d'être payés plus rapidement grâce à Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-et-airbnb-sassocient-pour-permettre-aux-htes-dtre-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE : V), leader mondial des paiements électroniques, et Airbnb (NASDAQ : ABNB), plateforme en ligne de premier plan spécialisée dans l'hébergement et les expériences, ont annoncé aujourd'hui que les hôtes Airbnb sur certains marchés pourraient accéder plus rapidement à leurs bénéfices. Airbnb recourant à Visa Direct[1], plateforme de paiements push en temps réel [2] de Visa, les hôtes auront la possibilité de transférer de l'argent depuis Airbnb vers un compte bancaire associé, au moyen d'une carte de débit éligible Visa. « Le fait de permettre aux personnes d'accéder à l'argent qu'elles ont gagné, lorsqu'elles le gagnent, constitue un puissant moteur de soutien aux communautés ainsi qu'à la reprise de l'économie mondiale », a déclaré Ruben Salazar, vice-président principal et directeur mondial de Visa Direct. « Les capacités de Visa Direct sur la plateforme Airbnb contribuent à améliorer le flux de trésorerie pour les hôtes, leur permettant ainsi de se concentrer sur l'accueil des voyageurs impatients d'explorer à nouveau le monde. » En dépit d'une année difficile, le futur s'annonce aujourd'hui plus clément, les individus prévoyant des escapades sûres pour les mois et années à venir. En effet, plus de 60 % des consommateurs aux États-Unis affirment être prêts à de nouveau voyager[3]. L'expérience de paiement optimisée grâce à Visa Direct peut contribuer à un meilleur contrôle des hôtes sur leurs finances, afin qu'ils continuent d'offrir à leurs voyageurs des expériences uniques et mémorables. « Airbnb comptant parmi les premières plateformes à mettre en place Visa Direct, cette nouvelle fonctionnalité permettra à la communauté de nos hôtes d'accéder plus rapidement à leurs bénéfices », a déclaré Sam Shrauger, vice-président des paiements chez Airbnb. « Nous sommes constamment à l'écoute de nos hôtes, nous recherchons les moyens de mieux répondre à leurs besoins, et Visa Direct peut jouer un rôle majeur dans l'exécution de paiements plus rapides pour nos hôtes », a poursuivi Shrauger. Cette collaboration est la dernière d'une série d'initiatives de Visa destinées à permettre à ses institutions financières clientes de conférer aux acheteurs et vendeurs les outils et ressources dont ils ont besoin pour bâtir des opérations d'entreprise plus solides, ainsi que pour transférer de l'argent à travers le monde, à l'heure où les paiements en temps réel n'ont jamais été aussi importants. La nouvelle solution destinée aux hôtes Airbnb devrait être disponible au cours de l'année prochaine. Rendez-vous sur Visa Direct pour en savoir plus sur la manière dont Visa peut contribuer à dévoiler de nouveaux moyens de transférer de l'argent. À propos de Visa Inc. Visa Inc. (NYSE : V) est le leader mondial des paiements numériques. Notre mission est de relier le monde grâce au réseau de paiement le plus innovant, le plus fiable et le plus sûr, et, ce faisant, de permettre aux individus, aux entreprises et aux économies de prospérer. Notre réseau de traitement global de pointe, VisaNet, fournit des paiements sécurisés et fiables dans le monde entier, et est capable de gérer plus de 65 000 messages de transaction par seconde. La focalisation incessante de la société sur l’innovation est un catalyseur pour la croissance rapide du commerce numérique accessible à tous sur tout type d’appareil et partout. À l’heure où le monde est en train de passer de l’analogique au numérique, Visa met à disposition sa marque, ses produits, ses employés, son réseau et son envergure pour remodeler l’avenir du commerce. Pour en savoir plus, rendez-vous sur À propos de Visa, visa.com/blog et @VisaNews. À propos d'Airbnb Airbnb est née en 2007, lorsque deux hôtes ont accueilli trois voyageurs dans leur maison de San Francisco. La plateforme s'est depuis développée jusqu'à représenter 4 millions d'hôtes, qui ont accueilli plus de 800 millions de voyageurs à leur arrivée dans presque tous les pays du monde. Chaque jour, les hôtes proposent des séjours inégalés et des expériences uniques, qui permettent aux voyageurs de découvrir le monde de manière plus authentique et plus connectée. [1] Capacité Visa Direct mise en place via les institutions financières partenaires d'Airbnb. [2] La disponibilité réelle des fonds dépend de l'institution financière et de la région qui les reçoivent. [3] Visa Business and Economic Insights: American Mood Trend (Renseignements Visa sur l'activité économique : tendance relative à l'humeur des Américains). Avril 2021. Le texte du communiqué issu d’une traduction ne doit d’aucune manière être considéré comme officiel. La seule version du communiqué qui fasse foi est celle du communiqué dans sa langue d’origine. La traduction devra toujours être confrontée au texte source, qui fera jurisprudence.",
    "url": "https://www.businesswire.com/news/home/20210428006193/fr/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T19:50:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-28 20:23:00",
    "publisher": "Business Wire",
    "title": "Visa und Airbnb schließen Partnerschaft für eine schnellere Bezahlung von Gastgebern mit Visa Direct",
    "image": "https://images.financialmodelingprep.com/news/visa-und-airbnb-schlieen-partnerschaft-fr-eine-schnellere-bezahlung-20210428.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V), der weltweite Marktführer im digitalen Zahlungsverkehr, und Airbnb (NASDAQ: ABNB), ein führender Online-Marktplatz für Unterkünfte und Erlebnisse, haben heute bekannt gegeben, dass Airbnb-Gastgeber in ausgewählten Märkten schneller über ihre Einnahmen verfügen können. Durch die Nutzung von Visa Direct[1], der Plattform von Visa für Push-Zahlungen in Echtzeit[2], werden Gastgeber die Möglichkeit haben, Geld von Airbnb auf ein Bankkonto zu überweisen, das mit einer geeigneten Visa-Debitkarte verknüpft ist. „Menschen sofort Zugriff auf Geld zu geben, das sie erwirtschaftet haben, ist ein starker Antrieb zur Unterstützung von Gemeinschaften und zur Erholung der Weltwirtschaft“, sagte Ruben Salazar, SVP und globaler Leiter von Visa Direct. „Die Visa-Direct-Funktionen auf der Airbnb-Plattform können dazu beitragen, den Cashflow für Gastgeber zu verbessern, sodass sie sich darauf konzentrieren können, Reisende willkommen zu heißen, die darauf brennen, die Welt wieder zu entdecken.“ Trotz eines schwierigen Jahres sieht die Zukunft positiver aus, da die Menschen in den kommenden Monaten und Jahren sichere Kurzurlaube planen. Tatsächlich sagen mehr als 60 % der Verbraucher in den USA, dass sie jetzt reisebereit sind.[3] Die verbesserte Auszahlungserfahrung mit Visa Direct kann Gastgebern eine bessere Kontrolle über ihre Finanzen ermöglichen, damit sie weiterhin mehr Gästen einzigartige und unvergessliche Erlebnisse bieten können. „Als eine der ersten Reiseplattformen, die Visa Direct unterstützt, wird diese neue Funktion unserer Gastgeber-Community helfen, schneller auf ihre Einkünfte zuzugreifen“, sagte Sam Shrauger, Vorstand des Bereichs für Zahlungen (Payments) bei Airbnb. „Wir hören unseren Gastgebern immer zu und suchen nach Möglichkeiten, ihre Bedürfnisse besser zu befriedigen. Visa Direct kann eine wichtige Rolle dabei spielen, schnellere Auszahlungen für Gastgeber zu ermöglichen“, so Shrauger weiter. Diese Zusammenarbeit ist die jüngste in einer Reihe von Visa-Initiativen, um Finanzinstituten zu helfen, Käufern und Verkäufern den Zugang zu den Tools und Ressourcen zu ermöglichen, die sie benötigen, um ihr operatives Geschäft zu stärken und Gelder auf der ganzen Welt zu bewegen – und Zahlungen in Echtzeit waren noch nie so wichtig wie heute. Die neue Lösung für Airbnb-Gastgeber wird voraussichtlich im Laufe des nächsten Jahres verfügbar sein. Auf Visa Direct erfahren Sie mehr darüber, wie Visa dabei helfen kann, neue Wege des Geldverkehrs zu erschließen. Über Visa Inc. Visa Inc. (NYSE: V) ist der weltweite Marktführer im digitalen Zahlungsverkehr. Unser Ziel ist, die Welt durch das innovativste, zuverlässigste und sicherste Zahlungsnetzwerk zu verbinden und so Einzelpersonen, Unternehmen und Volkswirtschaften zum Erfolg zu verhelfen. Unser fortschrittliches Transaktionsverarbeitungsnetzwerk VisaNet gewährleistet sicheres und zuverlässiges Bezahlen rund um die Welt und bietet Kapazitäten zur Verarbeitung von mehr als 65.000 Transaktionsmeldungen pro Sekunde. Die unermüdliche Innovationsorientierung des Unternehmens ist ein Katalysator für das rasante Wachstum des digitalen Handels auf jedem Gerät, für jede Person und überall. So wie sich die Welt zunehmend von analog zu digital entwickelt, setzt Visa seine Marke, seine Produkte, seine Mitarbeiter sowie sein Netzwerk und seine breite Präsenz dafür ein, die Zukunft des Handels neu zu gestalten. Für weitere Informationen besuchen Sie bitte Über Visa, visa.com/blog und @VisaNews. Über Airbnb Airbnb wurde 2007 ins Leben gerufen, als zwei Gastgeber drei Gäste in ihrem Haus in San Francisco willkommen hießen. Seitdem ist Airbnb auf 4 Millionen Gastgeber angewachsen, die über 800 Millionen Gäste in fast allen Ländern der Welt empfangen haben. Jeden Tag ermöglichen Gastgeber einmalige Aufenthalte und einzigartige Erlebnisse, die es den Gästen ermöglichen, die Welt auf eine authentische, vernetzte Weise zu erleben. [1] Visa Direct wird über die Finanzinstitutspartner von Airbnb möglich gemacht. [2] Die tatsächliche Verfügbarkeit von Geldern hängt vom empfangenden Finanzinstitut und der Region ab. [3] Visa Business and Economic Insights: American Mood Trend. April 2021. Die Ausgangssprache, in der der Originaltext veröffentlicht wird, ist die offizielle und autorisierte Version. Übersetzungen werden zur besseren Verständigung mitgeliefert. Nur die Sprachversion, die im Original veröffentlicht wurde, ist rechtsgültig. Gleichen Sie deshalb Übersetzungen mit der originalen Sprachversion der Veröffentlichung ab.",
    "url": "https://www.businesswire.com/news/home/20210428006203/de/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-28T20:23:00-04:00",
    "date_et": "2021-04-28"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-29 04:44:00",
    "publisher": "Business Wire",
    "title": "ビザとAirbnbが提携し、ビザ・ダイレクトでホストへの支払いを迅速化",
    "image": "https://images.financialmodelingprep.com/news/airbnb-20210429.jpg",
    "site": "businesswire.com",
    "text": "サンフランシスコ--(BUSINESS WIRE)--（ビジネスワイヤ） -- デジタル決済の世界的リーダーのビザ（NYSE：V）と、宿泊と体験のための大手オンライン・マーケットプレイスのAirbnb（NASDAQ：ABNB）は本日、一部の市場のAirbnbホストがより迅速に収益にアクセスできるようになると発表しました。Airbnbがビザ・ダイレクト[1]（ビザのリアルタイム[2]プッシュ型決済プラットフォーム）を利用することで、ホストは対象となるビザ・デビット・カードに結び付けられた銀行口座にAirbnbから資金を移すことが可能になります。 ビザ・ダイレクトの上級副社長でグローバルヘッドのルーベン・サラザーは、次のように述べています。「人々が稼いだお金を稼いだときに利用できるようにすることは、地域社会と世界経済の回復を支える強力な推進力になります。Airbnbプラットフォーム上のビザ・ダイレクト機能は、ホストのキャッシュフローの改善に役立ち、ホストは世界を再び探訪したいと思っている旅行者を迎えることに集中できるようになります。」 厳しい年にもかかわらず、人々は数カ月後、数年後に安全な旅行を計画しており、明るい未来が見えつつあります。実際、米国の消費者の60%以上が、旅行に行く準備が既にできていると答えています[3]。ビザ・ダイレクトの支払い機能が向上したことで、ホストは財務管理をしやすくなり、より多くの宿泊客にユニークで思い出に残る体験を提供し続けることが可能になります。 Airbnbのサム・シュローガー決済担当副社長は、次のように述べています。「ビザ・ダイレクトを導入した最初の旅行プラットフォームの1つとして、この新機能により、ホストはより速く収益にアクセスできるようになります。私たちは常にホストの声に耳を傾け、ホストのニーズを満たす方法を模索していますが、ビザ・ダイレクトはホストに迅速な支払いをする上で重要な役割を果たすことができます。」 今回の提携は、ビザの一連の取り組みの中でも最新のもので、金融機関の顧客が強力なビジネスを構築するために必要なツールやリソースに買い手や売り手がアクセスできるようにし、リアルタイムの決済がかつてないほど重要になっている現在、世界中でお金を動かすことができるようにするためのものです。このAirbnbホスト向けの新たなソリューションは、来年にも利用できるようになる見込みです。ビザがどのようにして新たなお金の流れを作ることができるかについては、ビザ・ダイレクトをご覧ください。 ビザについて ビザ（NYSE：V）は、デジタル決済で世界をリードしています。その使命は、安全で信頼のおける革新的な決済ネットワークで世界を結び、消費者、企業、経済全体に利便性をもたらすことです。当社の高度な世界的処理ネットワークのVisaNetは、安全で信頼性の高い決済手段を世界で提供し、毎秒6万5000件を超える取引を処理する能力を備えています。当社の技術革新に対する献身は、端末や場所を問わず、誰でも利用できるデジタル・コマースの急速な成長を推進しています。世界規模でアナログからデジタルへの移行が進む今、ビザは当社のブランド、商品、人材、ネットワーク、スケールを活用して、商取引の新たな未来を切り開きます。詳細情報については、About Visa、visa.com/blog、@VisaNewsをご覧ください。 Airbnbについて Airbnbは、2007年に2人のホストがサンフランシスコの自宅に3人の宿泊客を迎え入れたことから始まり、現在では世界のほぼ全ての国で400万人のホストが8億人以上の宿泊客を迎えるまでに成長しました。ホストは毎日、独自の滞在とユニークな体験を提供し、宿泊客がよりリアルでつながりのある方法で世界を体験できるようにしています。 [1] Airbnbの提携金融機関が提供するビザ・ダイレクト機能。 [2] 実際の資金反映は受信金融機関および地域によって異なります。 [3] Visa Business and Economic Insights: American Mood Trend. April 2021. 本記者発表文の公式バージョンはオリジナル言語版です。翻訳言語版は、読者の便宜を図る目的で提供されたものであり、法的効力を持ちません。翻訳言語版を資料としてご利用になる際には、法的効力を有する唯一のバージョンであるオリジナル言語版と照らし合わせて頂くようお願い致します。",
    "url": "https://www.businesswire.com/news/home/20210429005474/ja/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-29T04:44:00-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-29 12:38:00",
    "publisher": "Business Wire",
    "title": "Visa B2B Connect entra en operación en América Latina",
    "image": "https://images.financialmodelingprep.com/news/visa-b2b-connect-entra-en-operacin-en-amrica-latina-20210429.png",
    "site": "businesswire.com",
    "text": "Ciudad de México--(BUSINESS WIRE)--Visa Inc. (NYSE: V) anunció hoy que Visa B2B Connect ya entró en operación en México con CIBanco. Visa B2B Connect es una red abierta, innovadora e interoperable que les permite a los bancos y a sus clientes comerciales enviar y recibir pagos corporativos internacionales de empresa a empresa (B2B) de manera rápida, segura y con un bajo costo operativo. La red única basada en pagos sin tarjeta simplifica considerablemente los pagos corporativos internacionales al facilitar las transacciones del banco de origen directamente al banco beneficiario, habilitando una experiencia de extremo a extremo mejorada y fluida. Visa B2B Connect mejora los sistemas existentes de transferencias de fondos bilaterales. Por ejemplo, acelera de manera significativa la velocidad de liquidación de fondos, ya que en vez de tomar varios días, o hasta semanas, ahora con esta solución se pueden llevar a cabo en tan solo uno o dos días dependiendo del uso horario en la plaza de destino. La plataforma también aumenta drásticamente la visibilidad y previsibilidad del flujo de transacciones, permitiendo rastrear el estatus de los pagos desde el banco de origen hasta el banco de destino en tiempo casi real, mejorando así la precisión de las transacciones y permitiendo una conciliación más fácil. “El lanzamiento de Visa B2B Connect en México –el primer proyecto puesto en marcha para Visa en América Latina y el Caribe– marca un hito importante que nos ayudará a revolucionar la forma en que los pagos internacionales se efectúan en la región, habilitando el acceso a pagos internacionales de empresa a empresa más simples, transparentes y sin fricción”, dijo Juan Pablo Cuevas, jefe de Soluciones Comerciales de Visa América Latina y el Caribe. La seguridad y la protección mejoradas contra fraude son también características clave incorporadas en esta plataforma única, gracias a la función de identidad digital de Visa B2B Connect que tokeniza la información comercial confidencial de las corporaciones, como detalles bancarios y números de cuenta, con un identificador único para facilitar las transacciones en un ecosistema global, reduciendo así las oportunidades de fraude. Visa B2B Connect también supera las limitaciones de los sistemas de circuito cerrado, ya que la red puede trabajar (y es compatible) con otros rieles y redes de pago existentes. “Nos entusiasma ser el primer socio de negocios de Visa en la región que habilita este nuevo servicio de pagos revolucionario, que proporciona a nuestros clientes corporativos transacciones de negocio internacionales más rápidas, oportunas, seguras y controladas”, indicó Mario Maciel, CEO de CIBanco. “Con Visa B2B Connect estamos fortaleciendo nuestro enfoque innovador para cumplir con los altos estándares de un ambiente internacional que es cada vez más abierto, dinámico e interconectado”. El objetivo de Visa es ampliar la red a más bancos emisores en México y a lo largo de otros mercados en la región. Visa B2B Connect está disponible para implementación en 84 mercados alrededor del mundo, incluyendo América Latina y el Caribe. “Visa B2B Connect puede impulsar un valor sustancial y mayores eficiencias para nuestros bancos y sus clientes corporativos”, explicó Edward Domínguez, jefe de Visa B2B Connect en América Latina y el Caribe. “Ya hemos empezado a procesar transacciones en vivo en la nueva red realizadas para clientes comerciales de CIBanco. Visa B2B Connect está creciendo tal como se esperaba y estamos teniendo magnífica atracción afiliando a bancos en América Latina”, concluyó. Para más información sobre Visa B2B Connect, visite www.visa.com/visab2bconnect. Acerca de Visa Inc. Visa Inc. (NYSE: V) es la compañía líder mundial en pagos digitales. Nuestra misión es conectar al mundo por medio de la red de pagos más innovadora, confiable y segura, que habilita a las personas, a las empresas y a las economías para prosperar. Nuestra avanzada red de procesamiento global, VisaNet, proporciona pagos seguros y confiables en todo el mundo y es capaz de procesar más de 65.000 mensajes de transacción por segundo. La continua concentración de la compañía en la innovación es un catalizador para el rápido crecimiento del comercio digital en cualquier dispositivo, para todos, en todo lugar. A medida que el mundo se mueve de lo analógico a lo digital, Visa está aplicando su marca, sus productos, su personal, su red y su escala a la tarea de moldear el nuevo futuro del comercio. Para más información, visite Acerca de Visa, visa.com/blog y @VisaNews.",
    "url": "https://www.businesswire.com/news/home/20210429005919/es/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-29T12:38:00-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-29 16:05:00",
    "publisher": "Business Wire",
    "title": "Visa Inc. to Participate in Upcoming Investor Conferences",
    "image": "https://images.financialmodelingprep.com/news/visa-inc-to-participate-in-upcoming-investor-conferences-20210429.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa Inc. (NYSE: V) today announced its participation in the following investor conferences. On Monday, May 10, Al Kelly, Chairman and Chief Executive Officer, will present at the virtual MoffettNathanson Payments, Processors, and IT Services Summit. The discussion will begin at 9:00 a.m. Eastern Time and last for approximately 50 minutes. On Monday, May 24, Al Kelly, Chairman and Chief Executive Officer, will present at the virtual J.P. Morgan Global Technology, Media and Communications Conference. The discussion will begin at 2:00 p.m. Eastern Time and last for approximately 35 minutes. Listen-only audio webcasts and replays will be accessible for 30 days on the Investor Relations website at http://investor.visa.com. About Visa Inc. Visa Inc. (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network – enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews.",
    "url": "https://www.businesswire.com/news/home/20210429005451/en/Visa-Inc.-to-Participate-in-Upcoming-Investor-Conferences",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-29T16:05:00-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-29 17:58:00",
    "publisher": "Business Wire",
    "title": "Visa与爱彼迎合作，利用Visa Direct加快房东收款",
    "image": "https://images.financialmodelingprep.com/news/visavisa-direct-20210429.jpg",
    "site": "businesswire.com",
    "text": "旧金山--(BUSINESS WIRE)--(美国商业资讯)--全球数字支付领导者Visa (NYSE:V)和领先的住宿与体验在线平台爱彼迎(Airbnb, NASDAQ: ABNB)今天宣布，一些特定市场的爱彼迎房东将能够更快地取得收益。爱彼迎通过使用Visa的实时[2]推送支付平台Visa Direct[1]，房东将可以选择把爱彼迎里的资金转到符合要求的Visa借记卡银行账户中。 Visa Direct高级副总裁兼全球主管Ruben Salazar表示：“让人们在赚到钱的时候就可以拿到钱，这是支持社区和全球经济复苏的强大动力。爱彼迎平台上的Visa Direct功能可以帮助改善房东的现金流，让他们能够专注于迎接渴望再次探索世界的旅行者。” 尽管今年挑战重重，但随着人们计划在未来几个月和几年安全出游，未来的前景一片光明。实际上，超过60%的美国消费者表示他们现在已经做好出门旅行准备[3]。Visa Direct带来的增强的支付体验可以帮助房东更好地控制自己的财务状况，从而可以继续为更多的房客提供难忘的独特体验。 爱彼迎支付副总裁Sam Shrauger表示：“作为首批启用Visa Direct的旅行平台之一，这项新功能将帮助我们的房东社区更快地取得收益。我们一直在倾听房东的意见，并寻找能够更好地满足他们需求的方式，而Visa Direct在为房东提供更快支付方面可以发挥重要作用。” 此次合作是Visa实施的一系列措施中的最新一项，目的是帮助其金融机构客户使买家和卖家能够获得所需的工具和资源，以便在实时付款变得无比重要的今天开展更为强大的业务运营，并在全球范围内转移资金。这一针对爱彼迎房东推出的新型解决方案有望在明年投入使用。访问Visa Direct，进一步了解Visa如何帮助用户挖掘新的资金转移方式。 关于Visa Inc. Visa Inc. (NYSE: V)是全球领先的数字支付公司。我们的使命是通过最具创新性、最可靠和最安全的支付网络连接世界，推动个人、企业和经济活动的蓬勃发展。我们拥有先进的全球支付处理网络VisaNet，能够在世界范围内提供安全可靠的支付服务，每秒可处理65,000多笔交易。公司对创新的不懈努力是数字商务能够惠及全球各地的所有民众、并在各类设备上得以迅速发展的催化剂。在世界从模拟向数字转变之际，Visa正运用我们的品牌、产品、人才、网络和规模，重新塑造商业的未来。如需了解更多信息，请访问关于Visa、visa.com/blog和@VisaNews。 关于爱彼迎 爱彼迎诞生于2007年，源于当时有两位房东在他们位于旧金山的家中接待了三位游客。现在，公司已经发展到拥有400万房东用户，几乎遍布全球每一个国家，共计接待了超过8亿名游客。这些房东每天为房客提供独一无二的住宿和旅行体验，使他们能够以更真实、更直接的方式体验世界。 [1] Visa Direct的功能通过爱彼迎的金融机构合作伙伴得以实现。 [2] 资金的实际可用性取决于接收资金的金融机构和地区。 [3] Visa商业与经济洞察：美国情绪趋势。2021年4月。 免责声明：本公告之原文版本乃官方授权版本。译文仅供方便了解之用，烦请参照原文，原文版本乃唯一具法律效力之版本。",
    "url": "https://www.businesswire.com/news/home/20210429006199/zh-CN/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-29T17:58:00-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-29 17:58:00",
    "publisher": "Business Wire",
    "title": "Visa與Airbnb合作，利用Visa Direct加快房東收款",
    "image": "https://images.financialmodelingprep.com/news/visaairbnbvisa-direct-20210429.jpg",
    "site": "businesswire.com",
    "text": "舊金山--(BUSINESS WIRE)--(美國商業資訊)--全球數位支付領導者Visa (NYSE:V)和首屈一指的住宿與體驗線上平臺Airbnb (NASDAQ: ABNB)今天宣佈，一些特定市場的Airbnb房東將能夠更快地取得收益。透過使用Visa的即時[2]推送支付平臺Visa Direct[1]，Airbnb房東將可以選擇把資金從Airbnb轉移到符合要求的Visa金融卡銀行帳戶中。 Visa Direct資深副總裁兼全球主管Ruben Salazar表示：「讓人們在賺到錢的時候就可以拿到錢，這是支持社區和全球經濟復甦的強大動力。Airbnb平臺上的Visa Direct功能可以幫助改善房東的現金流，讓他們能夠專注於迎接渴望再次探索世界的旅行者。」 儘管這一年挑戰重重，但隨著人們計畫在未來幾個月和幾年安全出遊，未來的前景一片光明。實際上，超過60%的美國消費者表示他們現在已經做好出門旅行的準備[3]。Visa Direct帶來的升級支付體驗可以幫助房東加強管控自己的財務狀況，從而可以繼續為更多的房客提供難忘的獨特體驗。 Airbnb支付副總裁Sam Shrauger表示：「作為首批啟用Visa Direct的旅行平臺之一，這項新功能將幫助我們的房東業界更快地取得收益。我們一直在傾聽房東的意見，並尋找更符合其需求的方式，而Visa Direct在為房東提供更快支付方面可以扮演重要角色。」 此次合作是Visa實施的一系列措施中的最新一項，目的是協助其金融機構客戶使買家和賣家能夠獲得所需的工具和資源，以便在即時付款變得無比重要的今天建立更強大的業務運作，並在全球轉移資金。這一針對Airbnb房東推出的新型解決方案預期在明年可供使用。請造訪Visa Direct，進一步瞭解Visa如何幫助用戶發掘新的資金轉移方式。 關於Visa Inc. Visa Inc. (NYSE: V)是全球首屈一指的數位支付公司。我們的使命是透過最具創新性、最可靠和最安全的支付網路連接世界，推動個人、企業和經濟活動的蓬勃發展。我們擁有先進的全球支付處理網路VisaNet，能夠在全世界提供安全可靠的支付服務，每秒可處理65,000多筆交易。公司對創新的不懈努力是數位商務能夠惠及全球各地的所有民眾、並在各類裝置上得以迅速成長的催化劑。在世界從類比向數位轉變之際，Visa正運用我們的品牌、產品、人才、網路和規模，重新塑造商業的未來。如欲瞭解更多資訊，請造訪關於Visa、visa.com/blog和@VisaNews。 關於Airbnb Airbnb誕生於2007年，源於當時有兩位房東在他們位於舊金山的家中接待了三位遊客。現在，公司已經發展到擁有400萬房東用戶，幾乎遍佈全球每一個國家，共計接待了超過8億名遊客。這些房東每天為房客提供獨一無二的住宿和旅行體驗，使他們能夠以更真實、互連的方式體驗世界。 [1] Visa Direct的功能透過Airbnb的金融機構合作夥伴啟用。 [2] 資金的實際可用性取決於接收資金的金融機構和地區。 [3] Visa商業與經濟洞察：美國情緒趨勢。2021年4月。 免責聲明：本公告之原文版本乃官方授權版本。譯文僅供方便瞭解之用，煩請參照原文，原文版本乃唯一具法律效力之版本。",
    "url": "https://www.businesswire.com/news/home/20210429006200/zh-HK/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-29T17:58:00-04:00",
    "date_et": "2021-04-29"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-04-30 07:03:00",
    "publisher": "The Motley Fool",
    "title": "Is Visa the Long-Term Stock for You?",
    "image": "https://images.financialmodelingprep.com/news/is-visa-the-longterm-stock-for-you-20210430.jpg",
    "site": "fool.com",
    "text": "This is a great long-term growth story, but there are other options out there too.",
    "url": "https://www.fool.com/investing/2021/04/30/is-visa-the-long-term-stock-for-you/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-04-30T07:03:00-04:00",
    "date_et": "2021-04-30"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-03 13:33:39",
    "publisher": "InvestorPlace",
    "title": "7 Overvalued Blue-Chip Stocks That Are Not Tech Stocks",
    "image": "https://images.financialmodelingprep.com/news/7-overvalued-bluechip-stocks-that-are-not-tech-stocks-20210503.jpg",
    "site": "investorplace.com",
    "text": "While tech stocks are expected to be highly valued, it makes no sense for mature blue-chip stocks to be valued so highly. The post 7 Overvalued Blue-Chip Stocks That Are Not Tech Stocks appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/05/7-overvalued-blue-chip-stocks-that-are-not-tech-stocks/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-03T13:33:39-04:00",
    "date_et": "2021-05-03"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-05 07:01:17",
    "publisher": "PYMNTS",
    "title": "Tala and Visa Partnership Seeks To Ignite Stablecoin Use In Emerging Markets",
    "image": "https://images.financialmodelingprep.com/news/tala-and-visa-partnership-seeks-to-ignite-stablecoin-use-20210505.jpg",
    "site": "pymnts.com",
    "text": "Call it an ignition play for cryptocurrency — specifically, making crypto spendable, not just a store of value — across borders with the unbanked populations of the world, billions of consumers among them, as the match. In an interview with Karen Webster, Cuy Sheffield, head of Crypto at Visa, and Shivani Siroya, founder and CEO […]",
    "url": "https://www.pymnts.com/cryptocurrency/2021/tala-and-visa-partnership-seeks-to-ignite-stablecoin-use-among-the-unbanked/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-05T07:01:17-04:00",
    "date_et": "2021-05-05"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-07 04:47:14",
    "publisher": "Seeking Alpha",
    "title": "BXMX: An Overwrite Strategy Focused On The S&P 500",
    "image": "https://images.financialmodelingprep.com/news/bxmx-an-overwrite-strategy-focused-on-the-sp-500-20210507.jpg",
    "site": "seekingalpha.com",
    "text": "This fund has come a long way since it was originally added to the portfolio.",
    "url": "https://seekingalpha.com/article/4425436-bxmx-overwrite-strategy-focused-on-s-and-p-500",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-07T04:47:14-04:00",
    "date_et": "2021-05-07"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-07 10:03:00",
    "publisher": "Market Watch",
    "title": "MarketWatch Premium: Visa vs. Mastercard — should you buy either stock now?",
    "image": "https://images.financialmodelingprep.com/news/marketwatch-premium-visa-vs-mastercard-should-you-buy-either-20210507.jpg",
    "site": "marketwatch.com",
    "text": "Both Visa and Mastercard trade at high valuations, but they're expected to continue to post brisk earnings growth.",
    "url": "https://www.marketwatch.com/story/visa-vs-mastercard-should-you-buy-either-stock-now-11620396184",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-07T10:03:00-04:00",
    "date_et": "2021-05-07"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-09 05:47:04",
    "publisher": "Seeking Alpha",
    "title": "48 Berkshire/Buffett May Holdings Braced By 30 Blooming Dividends",
    "image": "https://images.financialmodelingprep.com/news/48-berkshirebuffett-may-holdings-braced-by-30-blooming-dividends-20210509.jpg",
    "site": "seekingalpha.com",
    "text": "48 Berkshire/Buffett May Holdings Braced By 30 Blooming Dividends",
    "url": "https://seekingalpha.com/article/4426331-48-berkshirebuffett-may-holdings-braced-by-30-blooming-dividends",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-09T05:47:04-04:00",
    "date_et": "2021-05-09"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-09 07:00:00",
    "publisher": "Barron's",
    "title": "Giant Pension Sold Marijuana Stocks Canopy, Aurora, and Cronos. Two Stocks It Bought.",
    "image": "https://images.financialmodelingprep.com/news/giant-pension-sold-marijuana-stocks-canopy-aurora-and-cronos-20210509.jpg",
    "site": "barrons.com",
    "text": "British Columbia Investment Management slashed positions in Canopy Growth, Aurora Cannabis, and Cronos Group in the first quarter, and bought up Mastercard and Visa stock.",
    "url": "https://www.barrons.com/articles/pension-sold-marijuana-stocks-canopy-aurora-cronos-bought-visa-mastercard-51620339774",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-09T07:00:00-04:00",
    "date_et": "2021-05-09"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-10 14:15:07",
    "publisher": "Benzinga",
    "title": "Why Visa & Mastercard Investors Shouldn't Sweat Fed's New Debit Routing Rule Change",
    "image": "https://images.financialmodelingprep.com/news/why-visa-mastercard-investors-shouldnt-sweat-feds-new-debit-routing-20210510.jpg",
    "site": "benzinga.com",
    "text": "On Friday, The U.S. Federal Reserve issued a press release highlighting proposed changes to debit card routing rules that analysts say could have an impact on Visa Inc (NYSE: V) and Mastercard Inc (NYSE: MA). What Happened?",
    "url": "https://www.benzinga.com/analyst-ratings/analyst-color/21/05/21036625/why-visa-mastercard-investors-shouldnt-sweat-feds-new-debit-routing-rule-change",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-10T14:15:07-04:00",
    "date_et": "2021-05-10"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 01:51:38",
    "publisher": "Seeking Alpha",
    "title": "Bear Market Buys: Buyandhold 2012, BM Cashflow Detective, And Chuck Walston's Top Dividend Stocks, Part 3",
    "image": "https://images.financialmodelingprep.com/news/bear-market-buys-buyandhold-2012-bm-cashflow-detective-and-20210511.jpg",
    "site": "seekingalpha.com",
    "text": "Bear Market Buys: Buyandhold 2012, BM Cashflow Detective, And Chuck Walston's Top Dividend Stocks, Part 3",
    "url": "https://seekingalpha.com/article/4427197-bear-market-buys-buyandhold-2012-bm-cashflow-detective-and-chuck-walstons-top-dividend-stocks-part-3",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T01:51:38-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 02:43:37",
    "publisher": "Seeking Alpha",
    "title": "Upcoming Ex-Dividend Dates: May 11-24, 2021",
    "image": "https://images.financialmodelingprep.com/news/upcoming-exdividend-dates-may-1124-2021-20210511.jpg",
    "site": "seekingalpha.com",
    "text": "Upcoming Ex-Dividend Dates: May 11-24, 2021",
    "url": "https://seekingalpha.com/article/4427208-upcoming-ex-dividend-dates-may-11-24-2021",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T02:43:37-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 07:00:00",
    "publisher": "Business Wire",
    "title": "Tap to Ride! Monterey-Salinas Transit Becomes 1st in California to Offer Riders the Ability to Tap to Pay with Visa",
    "image": "https://images.financialmodelingprep.com/news/tap-to-ride-montereysalinas-transit-becomes-1st-in-california-20210511.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Today, in collaboration with Visa, Caltrans, Cybersource, Littlepay, and SC Soft, Monterey-Salinas Transit (MST) became the first transit agency in California to offer bus riders a contactless payment option. As cities begin to reopen, public transportation will play a critical role in recovery, and contactless payments can help provide a safe and easy experience for riders and transit operators seeking limited physical touchpoints and interactions. MST riders ca",
    "url": "https://www.businesswire.com/news/home/20210511005504/en/Tap-to-Ride%21-Monterey-Salinas-Transit-Becomes-1st-in-California-to-Offer-Riders-the-Ability-to-Tap-to-Pay-with-Visa/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T07:00:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 07:00:00",
    "publisher": "Business Wire",
    "title": "Tap to Ride! Monterey-Salinas Transit Becomes 1st in California to Offer Riders the Ability to Tap to Pay with Visa",
    "image": "https://images.financialmodelingprep.com/news/tap-to-ride-montereysalinas-transit-becomes-1st-in-california-to-offer-20210511.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Today, in collaboration with Visa, Caltrans, Cybersource, Littlepay, and SC Soft, Monterey-Salinas Transit (MST) became the first transit agency in California to offer bus riders a contactless payment option. As cities begin to reopen, public transportation will play a critical role in recovery, and contactless payments can help provide a safe and easy experience for riders and transit operators seeking limited physical touchpoints and interactions. MST riders can now simply tap their contactless credit, debit, prepaid card or payment-enabled device on readers in MST buses for an easy and secure way to travel, without needing to purchase or load a separate transit card or handle cash while boarding. Visa research shows that enabling tap to pay on transit systems like these can be good for economic recovery, bringing more than a 15% lift in transactions from merchants in surrounding neighborhoods1. MST is the fifth transit agency in the U.S. to accept tap to pay for fares, following Chicago, Miami, New York and Portland, OR. MST is also the first public transit system in the country that is located outside of a large urban area to introduce tap to pay fares – demonstrating contactless payments as a good fit for any size agency looking to enhance the customer experience. “Visa recognizes the importance of expanding eligibility and access to fare payment options that meet the needs of a diverse set of transit riders,” said Brian Cole, SVP and head of North America product, Visa. “This effort with MST and Caltrans illustrates how open, contactless payments can support innovative and equitable fare policies to benefit riders and transit operators across the state.” MST riders who tap will benefit from “fare capping” ensuring riders won’t pay more than $10.00 per day—as long as they pay with the same card or mobile wallet throughout the day. The tap to pay option on MST’s entire bus fleet is the first contactless payment demonstration of the California Integrated Travel Project (Cal-ITP), a Caltrans-led initiative to make travel simpler and more cost-effective for the 40 million California residents, served by 300-plus transit agencies, who collectively take approximately 1.3 billion2 passenger trips annually. “We are committed to serving all of our riders and delivering new methods of ease and convenience,” said Carl Sedoryk, general manager and CEO, Monterey-Salinas Transit. “The availability of a contactless fare payment system means increased flexibility, and we are thrilled to be collaborating with Visa and Caltrans to bring the enhanced convenience and safety benefits of tap to pay to our community.” Bringing the MST Demonstration to Life Cybersource, a Visa solution, Littlepay, a transit-focused payments platform, and SC Soft, a transit ticketing and Automated Fare Collection specialist, have been critical in bringing the MST demonstration to life. Cybersource’s platform is powering the fast-to-market deployment of contactless solutions in the mass transit space, providing a full suite of payment and fraud management tools and an extensive network of partners and acquirers. Cybersource offers brand agnostic transit compliant processing solutions and enables easier implementation of digital payments for operators, while helping protect against fraud. Littlepay provides mass transit transaction processing, including the ability to cap fares and guarantee the best-value fare for frequent riders. SC Soft is a system integrator specializing in ticketing & Automated Fare Collection solutions for transit agencies around the world. “Cybersource looks forward to supporting Cal-ITP partners to improve transit access within communities throughout the state,” said Fernando Souza, Vice President, Cybersource. “There is a great sense of urgency among transit operators to adopt these solutions and we are committed to powering secure, seamless contactless solutions in a world where no contact, touchless experiences are here to stay.” “Removing barriers to transit ridership underscores what Cal-ITP is all about, and the launch of this contactless payment demonstration represents a significant step toward a simpler and more equitable public transit system throughout California,” said Caltrans Director Toks Omishakin. Adoption of contactless payments continues to grow in the U.S. as more consumers realize they can pay for the things they need with a simple and secure tap. In the US, one in 10 face to face Visa transactions are now done with a tap, more than a 2x increase since the beginning of the pandemic, showcasing increased consumer preference for fast, touch-free payment experiences. About Visa Inc. Visa Inc. (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable, and secure payment network - enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of connected commerce on any device, and a driving force behind the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, Visa’s Blog and @VisaNews. __________ 1 Visa Q2 FY21 Earnings Transcript 2 Caltrans, FY2018-2019",
    "url": "https://www.businesswire.com/news/home/20210511005504/en/Tap-to-Ride%21-Monterey-Salinas-Transit-Becomes-1st-in-California-to-Offer-Riders-the-Ability-to-Tap-to-Pay-with-Visa",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T07:00:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 08:45:00",
    "publisher": "Business Wire",
    "title": "Tik om te rijden! Monterey-Salinas Transit wordt eerste in Californië om de mogelijkheid te bieden aan passagiers om te betalen met Visa",
    "image": "https://images.financialmodelingprep.com/news/tik-om-te-rijden-montereysalinas-transit-wordt-eerste-in-californi-20210511.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Vandaag werd Monterey-Salinas Transit (MST), in samenwerking met Visa, Caltrans, Cybersource, Littlepay en SC Soft, het eerste vervoersbedrijf in Californië dat busrijders een contactloze betalingsmogelijkheid biedt. Nu steden heropenen, zal het openbaar vervoer een cruciale rol spelen bij het herstel, en contactloze betalingen kunnen een veilige en gemakkelijke ervaring bieden aan passagiers en vervoerders die op zoek zijn naar beperkte fysieke contactpunten en interacties. MST-rijders kunnen nu eenvoudig hun contactloze creditcard, betaalpas, prepaidkaart of betaalapparaat op de lezers in MST-bussen tikken voor een gemakkelijke en veilige manier van reizen, zonder dat ze een aparte ov-kaart hoeven te kopen of laden of contant geld moeten afhandelen tijdens het instappen. Deze bekendmaking is officieel geldend in de originele brontaal. Vertalingen zijn slechts als leeshulp bedoeld en moeten worden vergeleken met de tekst in de brontaal, die als enige rechtsgeldig is.",
    "url": "https://www.businesswire.com/news/home/20210511005740/nl/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T08:45:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 12:20:00",
    "publisher": "Business Wire",
    "title": "Avvicina e parti! Monterey-Salinas Transit diventa la 1a agenzia in California offrire ai viaggiatori la possibilità di pagare con Visa semplicemente avvicinando la carta",
    "image": "https://images.financialmodelingprep.com/news/avvicina-e-parti-montereysalinas-transit-diventa-la-1a-agenzia-20210511.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Oggi, grazie alla collaborazione con Visa, Caltrans, Cybersource, Littlepay e SC Soft, Monterey-Salinas Transit (MST) è diventata la prima agenzia di viaggio della California a offrire a chi viaggia in autobus un’opzione di pagamento contactless. Con l’inizio della riapertura delle città, i trasporti pubblici svolgeranno un ruolo decisivo nel ritorno alla normalità e i pagamenti contactless possono contribuire a rendere più semplice e sicura l’esperienza di pagamento dei viaggiatori e degli operatori del trasporto desiderosi di ridurre al minimo punti di contatto fisici e interazioni. Il testo originale del presente annuncio, redatto nella lingua di partenza, è la versione ufficiale che fa fede. Le traduzioni sono offerte unicamente per comodità del lettore e devono rinviare al testo in lingua originale, che è l'unico giuridicamente valido.",
    "url": "https://www.businesswire.com/news/home/20210511005972/it/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T12:20:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 13:57:56",
    "publisher": "GeekWire",
    "title": "Remitly lands investment from Visa amid reports of IPO preparation",
    "image": "https://images.financialmodelingprep.com/news/remitly-lands-investment-from-visa-amid-reports-of-ipo-preparation-20210511.png",
    "site": "geekwire.com",
    "text": "The news: Seattle mobile remittance startup Remitly landed an undisclosed equity investment from Visa.",
    "url": "https://www.geekwire.com/2021/remitly-lands-investment-visa-amid-reports-ipo-preparation/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T13:57:56-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 13:58:00",
    "publisher": "Business Wire",
    "title": "Visa reforça seu compromisso global com a sustentabilidade ambiental prometendo zerar as emissões líquidas até 2040",
    "image": "https://images.financialmodelingprep.com/news/visa-refora-seu-compromisso-global-com-a-sustentabilidade-ambiental-prometendo-20210511.png",
    "site": "businesswire.com",
    "text": "SÃO PAULO--(BUSINESS WIRE)--A Visa (NYSE: V), líder mundial em tecnologia de pagamento, anunciou novo compromisso global para zerar as emissões líquidas de gases de efeito estufa até 2040, informando ainda que a empresa alcançou a neutralidade de carbono em todas as suas operações em 2020.1 Além disso, revelou planos para tornar-se uma empresa que contribui positivamente para o clima por meio de novas parcerias e expansão de iniciativas voltadas a apoiar o comércio sustentável e a transição para uma economia de baixo carbono, indo além de seu próprio alcance. “A Visa está comprometida com a criação de um futuro mais sustentável”, afirma Al Kelly, chairman e CEO da Visa. “O compromisso de zerar as emissões líquidas e o aprimoramento de esforços em toda nossa rede, em apoio a iniciativas sustentáveis, são formas imediatas de alcançarmos nossas metas em ajudar a construir um futuro melhor para o planeta.” Emissões líquidas zero até 2040 - 10 anos à frente do a cordo climático estabelecido em Paris Como parte do compromisso de zerar as emissões líquidas até 2040, a Visa anunciou que é a nova signatária do Compromisso do Clima, uma iniciativa cofundada pela Amazon e Global Optimism, e nova integrante da Climate Business Network, do World Wildlife Fund (WWF) para acelerar ações para um futuro de emissões líquidas zero. O compromisso da Visa de zerar as emissões líquidas está alinhado com padrões e definições globais emergentes e incluirão esforços com fornecedores para diminuir significativamente a pegada de gases de efeito estufa dos produtos e serviços adquiridos pela empresa. A Visa também se comprometeu a estabelecer metas baseadas na ciência por meio da iniciativa Science Based Target, a fim de limitar o aumento de temperatura a 1,5ºC. Esses novos compromissos se unem à liderança existente da Visa na área de sustentabilidade, como a transição para 100% de uso de energia renovável em 2020. “A Visa está usando a força da nossa rede para acelerar a sustentabilidade e a recuperação econômica e ajudar a garantir a prosperidade do planeta e das economias ao redor do mundo”, conta Douglas Sabo, chefe de sustentabilidade da Visa. “Ao priorizarmos o uso de energia limpa e práticas sustentáveis, investindo em iniciativas ambientalmente inovadoras e trabalhando com líderes corporativos e da sociedade civil, estamos nos comprometendo a ser parte de uma solução global para a mudança climática.” Apoio ao comércio sustentável A Visa está expandindo suas iniciativas para usar seus produtos, serviços, rede, dados, expertise em pagamento e marca para apoiar o comércio sustentável e a transição para uma economia de baixo carbono. A empresa acaba de comunicar que colaborará com o Cambridge Institute for Sustainability Leadership (CISL) na identificação de novas oportunidades para aplicar as funcionalidades de pagamento eletrônico e a rede da Visa na conquista de um futuro sustentável. Os resultados da colaboração são esperados para o segundo semestre de 2021. A colaboração da Visa com a CISL complementa os esforços da companhia de trabalhar em toda sua rede para apoiar um futuro de baixo carbono, o que inclui sustentabilidade em: Parcerias para promover cartões e contas de pagamento; Iniciativas globais em apoio a comportamentos sustentáveis em áreas como mobilidade e viagem; Desenvolvimento de insights focados em um crescimento sustentado para as partes com interesse no comércio, ajudando-as a entender o que impede e o que leva o consumidor a adotar tais comportamentos; Uso das plataformas da marca para inspirar milhões de consumidores a ter um estilo de vida sustentável. As novas metas e esforços da Visa em prol de um comércio sustentável baseiam-se em sua reconhecida liderança em sustentabilidade no setor, o que inclui a presença em listas como: Índice Dow Jones de Sustentabilidade , Empresas Mais Responsáveis da América, 100 Melhores Cidadãos Corporativos e 100 Empresas Mais Justas. Para mais informações, visite: https://usa.visa.com/visa-everywhere/blog/bdp/2021/04/15/sustainable-commerce-and-1618453815474.html. Este comunicado contém declarações prospectivas segundo a acepção da U.S. Private Securities Litigation Reform Act, de 1995. Normalmente, as declarações prospectivas são identificadas por palavras como “irá”, “planeja”, “espera” e expressões similares. Exemplos de declarações prospectivas incluem, entre outras, declarações relativas ao prazo e à probabilidade de realizarmos ações ligadas à nossa estratégia, planos para futuras iniciativas e metas climáticas e o potencial impacto de nossas ações. Por natureza, declarações prospectivas: (i) referem-se somente à data em que foram realizadas, (ii) não são declarações de fatos históricos nem garantias de desempenho futuro (iii), estão sujeitas a riscos, incertezas, hipóteses e alterações nas circunstâncias que são difíceis de prever ou quantificar. Portanto, os resultados reais poderão diferir material e adversamente das declarações prospectivas da Visa devido a uma variedade de fatores, inclusive os contidos em nosso Relatório Anual no Formulário 10-K para o ano fiscal encerrado em 30 de setembro de 2020 e em outros documentos arquivados na U.S. Securities and Exchange Commission. Não se deve confiar indevidamente em tais declarações. Exceto quando exigido por lei, não pretendemos atualizar ou revisar qualquer declaração prospectiva em razão de novas informações, desenvolvimentos futuros ou outros motivos. Sobre a Visa Inc. Visa Inc. (NYSE:V) é a empresa líder em pagamentos digitais no mundo. Nossa missão é conectar o mundo por meio do que há de mais inovador, confiável e seguro em meios de pagamentos – permitindo que pessoas, negócios e economias prosperem. Nossa avançada rede de processamento global, a VisaNet, oferece pagamentos seguros e confiáveis em todo o mundo e é capaz de processar mais de 65.000 transações por segundo. O foco implacável da empresa em inovação é um catalisador para o rápido crescimento do comércio conectado em qualquer dispositivo e uma força motriz por trás do sonho de um futuro sem dinheiro em papel para todos, em todos os lugares. À medida que o mundo passa do analógico para o digital, a Visa insere sua marca, produtos, pessoas, rede e escala para remodelar o futuro do comércio. Para mais informações visite www.visa.com.br ou acompanhe nossa página no LinkedIn. Para saber mais sobre como a Visa realiza suas transações clique aqui. 1 A conquista de neutralidade de carbono cobre a pegada das emissões de gases de efeito estufa de Escopo 1 (fonte própria), Escopo 2 (eletricidade comprada) e viagens de negócios e elementos do deslocamento de funcionários de Escopo 3 (cadeia de valor) da Visa. Os Escopos 1, 2 e 3 seguem as definições do Protocolo de Gases de Efeito Estufa do World Resources Institute (WRI) e do Conselho Empresarial Mundial para o Desenvolvimento Sustentável (WBCSD, na sigla em inglês). O texto no idioma original deste anúncio é a versão oficial autorizada. As traduções são fornecidas apenas como uma facilidade e devem se referir ao texto no idioma original, que é a única versão do texto que tem efeito legal.",
    "url": "https://www.businesswire.com/news/home/20210511006056/pt/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T13:58:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 15:44:00",
    "publisher": "Business Wire",
    "title": "Antippen und losfahren! Monterey-Salinas Transit bietet Fahrgästen als erster Dienst in Kalifornien die Option für Visa-Zahlungen mit Antippen",
    "image": "https://images.financialmodelingprep.com/news/antippen-und-losfahren-montereysalinas-transit-bietet-fahrgsten-als-erster-dienst-20210511.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Seit heute ist Monterey-Salinas Transit (MST) in Zusammenarbeit mit Visa, Caltrans, Cybersource, Littlepay und SC Soft die erste Transitagentur in Kalifornien, die Busfahrgästen eine Option zum kontaktlosen Bezahlen anbietet. Die Städte öffnen sich wieder, und der öffentliche Nahverkehr wird eine entscheidende Rolle bei der Wiederherstellung der Normalität spielen. Kontaktloses Bezahlen kann zur Schaffung eines sicheren, einfachen Erlebnisses für Fahrgäste und Fahrer im Nahverkehr beitragen, die gerne wenige Flächen berühren und wenig physisch interagieren möchten. Die Fahrgäste von MST können jetzt einfach ihre kontaktlose Kredit-, Debit- oder Prepaid-Karte oder ihr zahlungsfähiges Gerät auf Lesegeräte in MST-Bussen tippen. So können sie auf einfache, sichere Weise reisen, ohne eine Extra-Fahrkarte zu kaufen oder zu laden oder während der Fahrt Bargeld zu benutzen. Studien von Visa zeigen, dass die Freischaltung von Zahlungen per Antippen in Nahverkehrssystemen wie diesem gut für die Erholung der Wirtschaft sein kann und eine Steigerung der Transaktionen um mehr als 15 % bei Händlern in den umliegenden Vierteln mit sich bringen kann1. MST ist nach Chicago, Miami, New York und Portland, Oregon die fünfte Transit-Agentur in den USA, die das Bezahlen von Fahrkarten per Antippen akzeptiert. MST ist zudem das erste öffentliche Nahverkehrssystem des Landes, das sich außerhalb eines städtischen Großraums befindet und das Bezahlen von Fahrkarten per Antippen einführt. Dies zeigt, dass sich kontaktloses Bezahlen gut für Agenturen jeder Größe eignet, die das Kundenerlebnis verbessern möchten. „Visa erkennt, wie wichtig es ist, die Möglichkeiten und den Zugang zu Zahlungsoptionen für Fahrkarten zu erweitern, die dem Bedarf verschiedenster Fahrgäste im Nahverkehr gerecht werden“, sagte Brian Cole, SVP und Leiter Produkte in Nordamerika bei Visa. „Dieses Projekt zusammen mit MST und Caltrans zeigt, wie offene, kontaktlose Zahlungen förderlich für innovative, gerechte Tarifstrategien sein können, die den Fahrgästen und Betreibern im Nahverkehr im gesamten Bundesstaat zugute kommen.“ MST-Fahrgäste, die das Antippen nutzen, werden von einem „Fahrpreisdeckel“ profitieren, der dafür sorgt, dass niemand mehr als 10,00 USD pro Tag bezahlt – wenn sie an dem Tag mit der gleichen Karte oder der gleichen mobilen Geldbörse zahlen. Die Option zum Bezahlen per Antippen in der gesamten Busflotte von MST ist die erste Demonstration von kontaktlosem Bezahlen im California Integrated Travel Project (Cal-ITP), einer Initiative von Caltrans, mit der das Reisen für die 40 Millionen Einwohner Kaliforniens einfacher und kosteneffektiver werden soll. Über 300 Transitagenturen, die zusammen jährlich etwa 1,3 Milliarden2 Personenfahrten übernehmen, tragen dazu bei. „Wir fühlen uns verpflichtet, alle unsere Fahrgäste zu bedienen und neue Methoden für Komfort und bequeme Abläufe bereitzustellen“, sagte Carl Sedoryk, General Manager und CEO bei Monterey-Salinas Transit. „Die Verfügbarkeit eines Systems für das kontaktlose Bezahlen von Fahrkarten bringt mehr Flexibilität mit sich, und wir freuen uns sehr, dass wir mit Visa und Caltrans zusammenarbeiten und unserer Community die Vorteile von erhöhtem Komfort und mehr Sicherheit durch das Zahlen per Antippen eröffnen können.“ Die MST-Demonstration wird zum Leben erweckt Cybersource, eine Visa-Lösung, Littlepay, eine auf den Nahverkehr spezialisierte Zahlungsplattform, und SC Soft, ein Spezialist für Fahrkarten im Nahverkehr und den automatischen Einzug von Fahrpreisen, haben eine wesentliche Rolle dabei gespielt, dass die MST-Demonstration zum Leben erweckt wurde. Die Plattform von Cybersource unterstützt die schnelle Markteinführung kontaktloser Lösungen im Bereich Massenverkehrsmittel. Sie bietet eine vollständige Suite von Werkzeugen für Zahlungs- und Betrugsmanagement und unterhält ein umfassendes Netzwerk aus Partnern und Acquirern. Cybersource bietet markenunabhängige, nahverkehrskonforme Lösungen für die Abwicklung an, ermöglicht die einfachere Implementierung digitaler Zahlungen für die Betreiber und trägt gleichzeitig zum Schutz vor Betrug bei. Littlepay übernimmt die Abwicklung von Transaktionen für Massenverkehrsmittel, einschließlich der Möglichkeit, Fahrpreise zu deckeln und einen wertoptimierten Fahrpreis für Vielfahrer zu garantieren. SC Soft ist ein Systemintegrator, der auf Lösungen für Fahrkartenverkauf und den automatischen Einzug von Fahrpreisen für Transitagenturen auf der ganzen Welt spezialisiert ist. „Cybersource freut sich darauf, die Partner von Cal-ITP bei der Verbesserung des Zugangs zum Nahverkehr in Communitys im gesamten Bundesstaat zu unterstützen“, sagte Fernando Souza, Vice President von Cybersource. „Unter den Betreibern des öffentlichen Nahverkehrs besteht großer Handlungsdruck, diese Lösungen einzuführen, und wir fühlen uns dazu verpflichtet, sichere, nahtlose kontaktlose Lösungen in einer Welt zu unterstützen, in der kontakt- und berührungslose Optionen dauerhaft verfügbar sein werden.“ „Mit der Beseitigung von Hindernissen bei der Nutzung des Nahverkehrs wird unterstrichen, worum es Cal-ITP geht. Der Beginn dieser Demonstration kontaktloser Zahlungen bedeutet einen signifikanten Schritt hin zu einem einfacheren, gerechteren System des öffentlichen Nahverkehrs in ganz Kalifornien“, sagte Toks Omishakin, Director von Caltrans. Die Einführung kontaktloser Zahlungen geht in den USA voran, da immer mehr Verbraucher feststellen, dass sie für ihren Bedarf mit einem einfachen, sicheren Antippen bezahlen können. In den USA erfolgt bereits eine von zehn persönlichen Visa-Transaktionen per Antippen. Das ist eine Steigerung um mehr als das Doppelte seit Beginn der Pandemie und zeigt eine gestiegene Präferenz der Verbraucher für schnelle, berührungsfreie Zahlungsoptionen. Über Visa Inc. Visa Inc. (NYSE: V) ist der weltweite Marktführer im digitalen Zahlungsverkehr. Unser Ziel ist, die Welt durch das innovativste, zuverlässigste und sicherste Zahlungsnetzwerk zu verbinden und so Einzelpersonen, Unternehmen und Volkswirtschaften zum Erfolg zu verhelfen. Unser fortschrittliches globales Netzwerk VisaNet für die Transaktionsverarbeitung gewährleistet sicheres und zuverlässiges Bezahlen rund um die Welt und bietet Kapazitäten zur Verarbeitung von mehr als 65.000 Transaktionsmeldungen pro Sekunde. Der unermüdliche Fokus des Unternehmens auf Innovation ist ein Motor für das schnelle Wachstum des vernetzten Handels über alle Geräte und ein Impulsgeber zur Umsetzung des Traums einer bargeldlosen Zukunft für alle Menschen überall. So wie sich die Welt zunehmend von analog zu digital entwickelt, setzt Visa seine Marke, seine Produkte, seine Mitarbeiter sowie sein Netzwerk und seine breite Präsenz dafür ein, die Zukunft des Handels neu zu gestalten. Für weitere Informationen besuchen Sie bitte Über Visa, den Blog von Visa und @VisaNews. __________ 1 Visa Q2 FY21 Earnings Transcript 2 Caltrans, GJ 2018-2019 Die Ausgangssprache, in der der Originaltext veröffentlicht wird, ist die offizielle und autorisierte Version. Übersetzungen werden zur besseren Verständigung mitgeliefert. Nur die Sprachversion, die im Original veröffentlicht wurde, ist rechtsgültig. Gleichen Sie deshalb Übersetzungen mit der originalen Sprachversion der Veröffentlichung ab.",
    "url": "https://www.businesswire.com/news/home/20210511006158/de/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T15:44:00-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-11 16:36:56",
    "publisher": "Seeking Alpha",
    "title": "Billionaires Love 50 Stocks: 32 Pay Dividends",
    "image": "https://images.financialmodelingprep.com/news/billionaires-love-50-stocks-32-pay-dividends-20210511.jpg",
    "site": "seekingalpha.com",
    "text": "Kiplinger Investing publishes opportune stock and fund lists for investors online. This updated billionaires stock list by Dan Burrows, first published 12/8/20, was updated with YCharts data 5/7/21.",
    "url": "https://seekingalpha.com/article/4427548-billionaires-love-50-stocks-32-pay-dividends",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-11T16:36:56-04:00",
    "date_et": "2021-05-11"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 03:37:00",
    "publisher": "Business Wire",
    "title": "Le paiement sans contact est désormais possible dans le bus ! Monterey-Salinas Transit devient la 1ère régie de Californie à offrir aux passagers la possibilité du paiement sans contact avec Visa",
    "image": "https://images.financialmodelingprep.com/news/le-paiement-sans-contact-est-dsormais-possible-dans-le-bus-20210512.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Aujourd'hui, en collaboration avec Visa, Caltrans, Cybersource, Littlepay, et SC Soft, Monterey-Salinas Transit (MST) est devenue la première régie de transports en Californie à proposer aux passagers des bus la possibilité du paiement sans contact. À l'heure où les villes débutent leur réouverture, les transports publics sont voués à jouer un rôle essentiel dans la reprise, et les paiements sans contact peuvent contribuer à une expérience sûre et facile pour les passagers et les opérateurs de transports souhaitant réduire les interactions et les contacts physiques. Les passagers de MST peuvent désormais tout simplement appliquer leur carte de crédit, carte de débit, carte prépayée ou appareil de paiement sans contact sur les lecteurs installés dans les bus MST pour bénéficier d'une expérience de transport facile et sûre, sans avoir à acheter ou à recharger une carte de transports distincte, ni à manipuler d'argent liquide au moment de monter à bord. Les recherches de Visa démontrent que la possibilité du paiement sans contact dans les transports publics tels que le bus peut se révéler bénéfique pour la reprise économique, en générant une augmentation de 15 % des transactions pour les commerçants des quartiers environnants1. MST est la cinquième régie de transports aux États-Unis à accepter le paiement sans contact pour les tickets de bus, après Chicago, New York et Portland, dans l'Oregon. MST est également la première régie publique de transports du pays à permettre le paiement sans contact des tickets de bus, parmi les régies de transports situées en dehors des grandes zones urbaines – ce qui démontre que le paiement sans contact est adapté aux agences de toutes tailles désireuses d'améliorer l'expérience client. « Visa comprend l'importance d'un élargissement de l'admissibilité et de l'accès aux options de paiement des tickets de bus, afin de répondre aux besoins d'un ensemble divers de passagers des transports en commun », a déclaré Brian Cole, vice-président principal et directeur produit Amérique du Nord chez Visa. « Cet effort aux côtés de MST et Caltrans illustre combien les paiements ouverts sans contact peuvent soutenir les politiques innovantes et équitables concernant les tickets de bus, bénéficiant ainsi aux passagers des transports en commun et aux opérateurs de régies de transports dans l'ensemble de l'état. » Les passagers de MST utilisant le paiement sans contact bénéficieront d'un plafonnement du prix des tickets de bus, de sorte qu'ils ne paieront jamais plus de 10,00 USD par jour – à condition de payer avec la même carte ou le même portefeuille mobile au cours de la journée. L'option du paiement sans contact sur l'ensemble de la régie de bus MST constitue la première expérimentation de paiement sans contact de l'initiative California Integrated Travel Project (Cal-ITP), menée par Caltrans pour veiller à ce que les déplacements soient plus simples et plus rentables pour les 40 millions d'habitants de la Californie, servis par plus de 300 régies de transports, qui assurent chaque année environ 1,3 milliard2 de trajets pour les passagers. « Nous avons pour vocation de servir tous nos passagers, ainsi que de proposer de nouvelles méthodes simples et pratiques », a déclaré Carl Sedoryk, président-directeur général de Monterey-Salinas Transit. « La possibilité du paiement sans contact pour les tickets de bus est synonyme de plus grande souplesse, et nous sommes heureux de collaborer avec Visa et Caltrans pour apporter ces avantages de commodité et de sécurité à notre communauté grâce au paiement sans contact. » Donner vie à l'expérimentation de MST Cybersource, une solution Visa, Littlepay, une plateforme de paiement axée sur les transports en commun, et SC Soft, un spécialiste de la collecte des tickets de transports et de la perception automatisée des droits de transport, ont joué un rôle essentiel pour donner vie à l'expérimentation de MST. La plateforme de Cybersource propulse le déploiement rapide sur le marché de solutions sans contact dans le domaine des transports en commun, en proposant une gamme complète d'outils de gestion des paiements et de la fraude, ainsi qu'un vaste réseau de partenaires et d'acquéreurs. Cybersource offre des solutions de traitement des transports en commun neutres vis à vis de marques, et permet une mise en place plus facile des paiements numériques pour les opérateurs, tout en contribuant à lutter contre la fraude. Littlepay assure le traitement des transactions liées aux transports en commun, notamment la capacité de plafonner le coût des tickets de bus et de garantir des prix attractifs pour les passagers fréquents. SC Soft est un intégrateur de systèmes spécialisé dans les solutions de billetterie et de perception automatisée des droits de transport pour les régies de transports du monde entier. « Cybersource est impatiente de soutenir les partenaires de l'initiative Cal-ITP, afin d'améliorer l'accès aux transports en commun au sein des communautés de l'état », a déclaré Fernando Souza, vice-président de Cybersource. « Le sentiment d'urgence est palpable parmi les opérateurs de régies de transports concernant l'adoption de ces solutions, et nous avons pour vocation de fournir des solutions sans contact sécurisées et fluides dans un monde où les expériences sans contact sont vouées à perdurer. » « La suppression des barrières aux transports en commun souligne toute la signification de l'initiative Cal-ITP, et le lancement de cette expérimentation de paiement sans contact constitue une étape majeure en direction d'un système de transports publics plus simple et plus équitable partout en Californie », a déclaré Toks Omishakin, directeur de Caltrans. L'adoption du paiement sans contact ne cesse de se développer aux États-Unis, de plus en plus de clients réalisant qu'il leur suffit d'un geste sans contact simple et sécurisé pour payer ce dont ils ont besoin. Aux États-Unis, une transaction Visa physique sur 10 est aujourd'hui effectuée sans contact, soit une multiplication par plus de 2 depuis le début de la pandémie, ce qui démontre la préférence croissante des consommateurs pour des expériences de paiement rapides et sans contact. À propos de Visa Inc. Visa Inc. (NYSE : V) est le leader mondial des paiements numériques. Notre mission consiste à relier le monde grâce au réseau de paiement le plus innovant, le plus fiable et le plus sûr, et ainsi à permettre aux personnes, aux entreprises et aux économies de prospérer. Notre réseau de traitement mondial de pointe, VisaNet, fournit des paiements sécurisés et fiables dans le monde entier et est capable de gérer plus de 65 000 messages de transaction par seconde. La focalisation incessante de la société sur l’innovation est un catalyseur pour la croissance rapide du commerce connecté sur tout type d’appareil, et une force motrice derrière le rêve d’un avenir sans numéraire, pour tous, et partout. À l’heure où le monde est en train de passer de l’analogique au numérique, Visa met à disposition sa marque, ses produits, ses employés, son réseau et son envergure pour remodeler l’avenir du commerce. Pour en savoir plus, rendez-vous sur À propos de Visa, le blog de Visa et @VisaNews. __________ 1 Relevé des revenus Visa au T2 de l'exercice 2021 2 Caltrans, exercice 2018-2019 Le texte du communiqué issu d’une traduction ne doit d’aucune manière être considéré comme officiel. La seule version du communiqué qui fasse foi est celle du communiqué dans sa langue d’origine. La traduction devra toujours être confrontée au texte source, qui fera jurisprudence.",
    "url": "https://www.businesswire.com/news/home/20210512005398/fr/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T03:37:00-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 06:19:00",
    "publisher": "The Motley Fool",
    "title": "How Visa Direct Is Modernizing Money",
    "image": "https://images.financialmodelingprep.com/news/how-visa-direct-is-modernizing-money-20210512.jpg",
    "site": "fool.com",
    "text": "Visa Direct provides a new way to send money around the world faster and cheaper.",
    "url": "https://www.fool.com/investing/2021/05/12/how-visa-direct-is-modernizing-money/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T06:19:00-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa Launches U.S. Spending Momentum Index—A New Way to Gauge the Economic Health of U.S. Consumers",
    "image": "https://images.financialmodelingprep.com/news/visa-launches-us-spending-momentum-indexa-new-way-to-gauge-20210512.png",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V) today launched the Visa U.S. Spending Momentum Index (SMI), an economic indicator designed to be a timely gauge of the health of consumer spending. The Visa SMI delivers insight into what drives upturns and downturns in spending by measuring the breadth of the momentum supporting these trends. “This past year underscores the importance of looking not only at how much is being spent, but also how many consumers are spending,” said Wayne Best, Visa’s Chief Economist. “What made the most recent downturn and now recovery so different than any previous business cycle was how the pandemic impacted the ability as much as the willingness of consumers to spend. Understanding how many consumers are feeling sufficiently confident and financially secure to spend more is at the heart of what the Visa SMI does.” In April 2021, the Visa SMI hit 136.0, confirming that the U.S. economic recovery remains on firm ground. At its current level, the Visa SMI implies that 65 percent of consumers are now spending more than they did a year ago, while only 35 percent are spending the same or less. Even compared to April 2019, which was not affected by the pandemic and lockdowns, 51 percent of consumers are spending more. The SMI reached its lowest level in April 2020 at 70.5 and did not pass 100 again until October, indicating that many people were still unable to participate in the recovery for much of 2020. While the downturn this time was deeper, the recovery has been six months faster than the recession of 2008-2009. “The SMI’s latest strong reading provides evidence that consumer confidence is building as the pace of vaccinations increase and restrictions are eased across the country,” added Wayne Best. “Signs of economic recovery, additional stimulus payments and optimism that the pandemic is waning are contributing to stronger spending compared to last year and even within recent months.\" The gains in spending momentum, however, remain uneven. The SMI for cities that experienced the greatest job losses in April 2020 has been on average 1.5 points lower over the last year than cities where job losses were more limited, indicating that fewer consumers were able to join the recovery where joblessness was higher. The SMI for Chicago, one of the hardest hit cities in terms of job losses, has averaged 100.5 over the last 12 months, compared to a city with fewer job losses such as Atlanta, where the SMI was 104.0 over the same time frame. The gap between the two has narrowed within the last three months, helped in part by Chicago’s progress in vaccinating a greater share of its residents. Previously only available to Visa clients, Visa is now publishing components of the SMI on a monthly basis for the general public, in part to help track economic recovery progress. The SMI builds on Visa’s commitment to powering commerce by providing tools and insights to uplift people, businesses and economies everywhere. About the Visa SMI The Visa SMI is based on a sample of aggregated, depersonalized VisaNet data. Visa adjusts this data through proprietary methods to exclude factors that do not reflect spending momentum. The resulting sample data is then aggregated using a diffusion index framework where index values are scored from 0 to 200. When the Visa SMI rises above 100, the consumer spending momentum is strengthening and when it falls below 100, the spending momentum is weakening as fewer consumers are spending more relative to the previous year. The index is adjusted for day of week, month, holidays, and broad annual trends, and these seasonal adjustments are subject to revision each year. The Visa SMI does not take into account the volume of payments nor does it rely on all Visa-branded credentials, and therefore does not reflect Visa operational or financial performance. It is intended for informational purposes only and is offered on an “as is” basis without any warranties of any kind, express or implied. Each SMI report is as of the publication date. Eligible Visa clients in the U.S may access more detailed and customized insights at the national, regional and local spending level, including spending on the main categories of goods and services. For more information about the Visa U.S. Spending Momentum Index, please visit www.visa.com/partner-with-us/visa-consulting-analytics/spending-momentum-index.html About Visa Visa (NYSE: V) is the world’s leader in digital payments. Our mission is to connect the world through the most innovative, reliable and secure payment network - enabling individuals, businesses and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of digital commerce on any device, for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. For more information, visit About Visa, visa.com/blog and @VisaNews.",
    "url": "https://www.businesswire.com/news/home/20210512005129/en/Visa-Launches-U.S.-Spending-Momentum-Index%E2%80%94A-New-Way-to-Gauge-the-Economic-Health-of-U.S.-Consumers",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T07:00:00-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 07:00:00",
    "publisher": "Business Wire",
    "title": "Visa Launches U.S. Spending Momentum Index—A New Way to Gauge the Economic Health of U.S. Consumers",
    "image": "https://images.financialmodelingprep.com/news/visa-launches-us-spending-momentum-indexa-new-way-to-20210512.jpg",
    "site": "businesswire.com",
    "text": "SAN FRANCISCO--(BUSINESS WIRE)--Visa (NYSE: V) today launched the Visa U.S. Spending Momentum Index (SMI), an economic indicator designed to be a timely gauge of the health of consumer spending. The Visa SMI delivers insight into what drives upturns and downturns in spending by measuring the breadth of the momentum supporting these trends. “This past year underscores the importance of looking not only at how much is being spent, but also how many consumers are spending,” said Wayne Best, Visa's",
    "url": "https://www.businesswire.com/news/home/20210512005129/en/Visa-Launches-U.S.-Spending-Momentum-Index%E2%80%94A-New-Way-to-Gauge-the-Economic-Health-of-U.S.-Consumers/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T07:00:00-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 10:01:13",
    "publisher": "InvestorPlace",
    "title": "Tread Carefully With Social Capital Hedosophia V Stock",
    "image": "https://images.financialmodelingprep.com/news/tread-carefully-with-social-capital-hedosophia-v-stock-20210512.jpg",
    "site": "investorplace.com",
    "text": "As growth stocks sell off it may be best to take your time with IPOE stock, even as it approaches the closure of its merger with SoFi. The post Tread Carefully With Social Capital Hedosophia V Stock appeared first on InvestorPlace.",
    "url": "https://investorplace.com/2021/05/ipoe-stock-tread-carefully/",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T10:01:13-04:00",
    "date_et": "2021-05-12"
  },
  {
    "symbol": "V",
    "publishedDate": "2021-05-12 11:16:19",
    "publisher": "Zacks Investment Research",
    "title": "Visa (V) Partners With MST to Ease California's Transit Journey",
    "image": "https://images.financialmodelingprep.com/news/visa-v-partners-with-mst-to-ease-californias-transit-20210512.jpg",
    "site": "zacks.com",
    "text": "Visa (V) joins forces with MST to launch contactless payment option and offer equitable fare payment system to California residents.",
    "url": "https://www.zacks.com/stock/news/1541005/visa-v-partners-with-mst-to-ease-californias-transit-journey",
    "ticker": "V",
    "event_date": "2021-04-28",
    "window_start": "2021-04-21",
    "window_end": "2021-05-12",
    "publishedDateET": "2021-05-12T11:16:19-04:00",
    "date_et": "2021-05-12"
  }
]